{"count":9690,"totalPages":323,"currentPage":8,"articles":[{"article_title":"Arbitrum (ARB) Shows Buy Signal: Why Timing Might Be Off","author":"Abiodun Oladokun","article_detailed_content":"Arbitrum’s (ARB) on-chain metrics have flashed a buy signal amid general market consolidation. However, an assessment of the Layer 2 (L2) token’s performance on a three-day chart hinted at the possibility of a further decline in its value in the short term. Arbitrum Traders Wonder If the Time Is Right At press time, ARB’s Market Value to Realized Value (MVRV) ratio, assessed using different moving averages (30-day and 365-day), returned negative values. The token’s MVRV ratios on 30-day and 365-day moving averages were -3.51% and -31.72%, respectively. An asset’s MVRV ratio tracks the ratio between the asset’s current market price and the average price of its coin or token circulation. When its value is positive, the asset is overvalued. This means that the asset’s current value is higher than the price at which most investors acquire their holdings. On the other hand, a negative MVRV ratio suggests that the asset in question is undervalued, as its market value is below the average purchase price of all its tokens in circulation. A negative MVRV ratio presents a good time to buy because it signals to traders that the asset trades at a price lower than its historical cost basis. Hence, if they buy at that point, they will see returns. Arbitrum MVRV Ratio Source: Santiment Further, a negative sentiment has been trailing ARB since April. At press time, the token’s weighted sentiment was -0.99. Read More: Optimism vs. Arbitrum: Ethereum Layer-2 Rollups Compared Arbitrum Weighted Sentiment Source: Santiment Historically, this has been known to present a good buying opportunity. When an asset’s sentiment grows poor, and the market expects further decline, crypto assets often initiate uptrends as sellers become increasingly exhausted. ARB Price Prediction: Short-term Losses Are Ahead While the metrics highlighted above hinted at the possibility of a rally, some indicators showed that the market may witness a further downtrend in the short term. At the time of writing, ARB’s Relative Strength Index (RSI) was 29.79, sitting below the neutral line. This signaled that traders preferred to sell their ARB rather than hold them or accumulate more tokens. The RSI measures the momentum of an asset’s price change. It ranges from 0 to 100, with values above 70 suggesting overbought conditions and below 30 signaling oversold conditions. Further, ARB’s Chaikin Money Flow (CMF), which measures the flow of capital into and out of the asset, was -0.10 at press time. This negative value suggested increased liquidity exit from the token’s market, which may put downward pressure on its price. If bearish pressure mounts, ARB’s price may fall below the long-term support of $0.92 at which it currently trades. Its value may drop under $0.90 to trade at $0.84. Read More: Arbitrum (ARB) Price Prediction 2024/2025/2035 Arbitrum Price Analysis. Source: Tradingview However, if this projection is invalidated and the bulls regain market control, the L2 token’s price might rally above $1 to exchange hands at $1.2. The post Arbitrum (ARB) Shows Buy Signal: Why Timing Might Be Off appeared first on BeInCrypto.","article_summary":"While Arbitrum's MVRV ratio and Weighted Sentiment tell traders that this might be a good time to buy, growing bearish activity in its market hint at a decline in the short term. The post Arbitrum (ARB) Shows Buy Signal: Why Timing Might Be Off appeared first on BeInCrypto.","publisher":{"name":"Be(In)Crypto","logo":"https://t3.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://beincrypto.com/&size=64"},"creation_date":"2024-05-15T11:00:27Z","categories":["arbitrum","arb","token","optimism","ethereum","crypto","flow"],"article_link":"https://beincrypto.com/arbitrum-arb-flashes-buy-signal-warning/","thumbnail_image":"https://beincrypto.com/wp-content/uploads/2023/03/bic_Arbitrum_ARB_coins_2-2.png"},{"article_title":"Internet Computer Introduces ckUSDC, Algorand Emerging Challenger Captures Market Focus","author":"thebittimes@thebitfinance.com (TheBitTimes.Com)","article_detailed_content":"The crypto industry is an evolving sector, where novel and disruptive technologies are coming to the market on a regular basis. Internet Computer (ICP) latest offering is ckUSDC, a significant stride in the stable coin world. At the same time, while Borroe Finance ($ROE), which is a disruptive and highly innovative DeFi platform, is gaining more and more traction in the community. >>BUY $ROE TOKENS NOW<< Internet Computer's ckUSDC: A New Approach to Stablecoins The Internet Computer (ICP) from DFINITY Foundation is a blockchain which has the purpose of changing the Internet by providing a decentralized and scalable platform for smart contracts and applications. The most recent stablecoin is an intermediary token to enable interaction and exchange between decentralized applications and traditional financial systems, hence, providing uninterrupted connectivity and interaction. cryptOMC is the cryptographic protocol that is designed to let canisters (Internet Computers and smart contracts) interact with the USD Coin (USDC) stablecoin. The chain-key signatures are the way of interaction that allow canisters to create their own Bitcoin addresses and to launch a valid transaction. The chain key tokens such as the chain-key-bitcoin (ckBTC) is an important element as it provides a simple and fast channel of assets between many different blockchains. The ckUSDC works with the protocol level economics and governance mechanism of Internet Computer. ICP token performs different functions in the platform: the voting rights, the SNS transactions, the buying cycles in dApps development and the payments to the providers of computational resources. The brain of the Internet Computer, which is NNS (Network Neural System), conducts all the self-organizing and self-governing activities of the ICP (Internet Computer Protocol) DAO (Distributed Autonomous Organization). This allows the local community to participate in decision-making processes on a transparent basis through community stakeholder governance. Borroe Finance ($ROE) Enabling Revenue Streams Tokenization Borroe Finance ($ROE) is a solid platform through which companies and creators can tokenize their revenue streams as non-fungible tokens (NFTs). These NFTs can be sold at a discount price, which is a way to immediately generate revenue for business and serve as a special investment opportunity for investors. The funding realm of Borroe Finance ($ROE) is distinct from the typical DeFi projects in the web3 sector. This deflationary aspect then attracts investors who are trying to find safe and soaring assets in a world that is generally unstable and volatile. The tokens showed strong performance at presale stages, which is a good indicator of early success. Borroe Finance ($ROE) is an AI based tool that examines the quality of invoices to give credit checks to the assets being brought to the platform. The AI-based risk assessment regarding liquidity pool assets provides a reliable funding source that avoids the common problems related to invoice trading. The platform has a schedule for the token burning mechanism too which provides safety for its users. Therefore, this approach will entice investors who are looking for a stable and secure cryptocurrency. As a Polygon-powered decentralized project that is scalable and secure, Borroe Finance ($ROE) operates by community-driven governance. These activities are conducted by the participation of investors in presale events and creating a feeling of ownership among them and thus investors are attracted and the uniqueness of the crowdfunding method of the project is emphasized. The AI-based model of the Borroe Finance has shown remarkable outcomes, and we can see that the price of the token $ROE has gone up to $0.010 to $0.025. Currently, Borroe Finance ($ROE) is in a vesting stage and is approaching a release of a 6-week airdrop plan. Investors are eagerly waiting for the release, and the token will be offered for sale at the price of $0.025. The lockup period and the scheduling of airdrop are anticipated to be highly attractive for participants in the protocol and those who are in search of the innovative approach to decentralized finance. The management team of Borroe Finance ($ROE) - Maxim Prishchepo and Michael Price - consists of a team of highly skilled experts, who provide consultancy concerning the quality of the project and ensure its smooth running. Transparency and security are the two main pillars of the Borroe Finance ($ROE) philosophy. The project has been awarded a BlockAudit certificate, after inspections of smart contracts, thus having the security and integrity of them proved. The founders' commitment to the accessibility of the public made the project more trustworthy and reliable within the crypto community. Learn more about Borroe Finance ($ROE) here: Visit Borroe Finance Presale | Join The Telegram Group | Follow Borroe Finance on Twitter Source: https://thebittimes.com/internet-computer-introduces-ckusdc-algorand-emerging-challenger-captures-market-focus-tbt88357.html","article_summary":"The crypto industry is an evolving sector, where novel and disruptive technologies are coming to the market on a regular basis. Internet Computer (ICP) latest offering is ckUSDC, a significant stride in the stable coin world. At the...","publisher":{"name":"The Bit Times","logo":"https://logo.clearbit.com/thebittimes.com?size=96"},"creation_date":"2024-05-15T11:00:09Z","categories":["algorand","crypto","icp","defi","blockchain","token","usdc","bitcoin","web3","ai","cryptocurrency"],"article_link":"https://thebittimes.com/internet-computer-introduces-ckusdc-algorand-emerging-challenger-captures-market-focus-tbt88357.html","thumbnail_image":"https://cdn.thebittimes.com/vimedia/w800/2024/05/15/1715736463.webp"},{"article_title":"Avara to launch Lens Network on zkSync to expand on success of Lens Protocol","author":"Liam 'Akiba' Wright","article_detailed_content":"Building on the success of Lens Protocol, Lens Lab, an entity under Avara, has announced the Lens Network, a blockchain-based network aimed at transforming the future of social media interactions. Developed on the ZK Stack utilizing zkSync technology on Ethereum, the Lens Network is poised to address and overcome the prevalent scalability challenges faced by blockchain technologies. It aims to match conventional social networks’ user experience while retaining web3’s distinctive features, such as user ownership and secure transactions. Per the announcement, the primary goal of the Lens Network is to enable the broad adoption of web3 social functionalities by providing a robust infrastructure that can support new user experiences and monetization models. Stani Kulechov, the founder of Avara, emphasized that the Lens Network would introduce a hybrid architecture combining Validium and Volition with the ZK Stack on Ethereum, thereby scaling effectively and contributing to a more open and fair internet. Alex Gluchowski, co-founder and CEO of Matter Labs, highlighted the crucial balance that the Lens Network aims to maintain between user-friendly interfaces and essential elements like data ownership, freedom of speech, and transaction security. The new network promises to empower developers with the flexibility to build diverse social applications and support seamless integration with EVM and non-EVM blockchains. The rollout of the Lens Network will occur in three phases, starting with a Validium that uses ZK compression techniques on Ethereum to ensure robust data accessibility. Subsequent phases will introduce separate Validium chains designed to cater to different social network use cases and levels of privacy, eventually culminating in a Volition network that blends rollups and Validium for enhanced security and flexibility. Lens Labs also highlighted enhanced user empowerment, with features allowing users more control over their online presence and interaction modalities. The network supports existing Lens Profiles and offers new minting options on the Lens website, ensuring users can effortlessly maintain or expand their digital identities. Christina Beltramini, a long-standing member of the Lens team, expressed her enthusiasm about the launch of the Lens Network. Reflecting on her journey, she stated, “Joining the Lens team over 2.5 years ago, we set out to radically transform social media. Our goal was to advance the possibilities of social, but not by compromising on the fundamentals of the blockchain and its potential. This has always been core to our vision.” Beltramini emphasized that the development of the Lens Network marks a significant milestone in realizing its vision of a scalable, secure, and cost-effective blockchain-based social media solution that does not sacrifice user experience. For more detailed information on technical specifications and the phased rollout plan, interested parties can refer to the official blog post on t2, a blog platform built on Lens Protocol. The launch of the Lens Network by Lens Lab under Avara marks a significant step towards creating decentralized, user-centric social media platforms that offer scalability, security, and user ownership. This aligns with the broader vision of a more accessible and equitable digital future. The post Avara to launch Lens Network on zkSync to expand on success of Lens Protocol appeared first on CryptoSlate.","article_summary":"Building on the success of Lens Protocol, Lens Lab, an entity under Avara, has announced the Lens Network, a blockchain-based network aimed at transforming the future of social media interactions. Developed on the ZK Stack utilizing zkSync technology on Ethereum, the Lens Network is poised to address and overcome the prevalent scalability challenges faced by […] The post Avara to launch Lens Network on zkSync to expand on success of Lens Protocol appeared first on CryptoSlate.","publisher":{"name":"Crypto Slate","logo":"https://t0.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://cryptoslate.com/&size=64"},"creation_date":"2024-05-15T10:55:09Z","categories":["ethereum","blockchain","web3","core"],"article_link":"https://cryptoslate.com/avara-to-launch-lens-network-on-zksync-to-expand-on-success-of-lens-protocol/","thumbnail_image":"https://cryptoslate.com/wp-content/uploads/2024/05/lens-network.jpg"},{"article_title":"Crypto in peril as court ruling sets a dangerous precedent","author":"thebittimes@thebitfinance.com (TheBitTimes.Com)","article_detailed_content":"On May 14, a Dutch court sentenced Alexey Pertsev, developer of Tornado Cash, to five years in prison. This unprecedented ruling can create a dangerous precedent for cryptocurrency and privacy development, challenging previous worldwide regulatory knowledge. In a surprising development, Alexey Pertsev was convicted of money laundering—not because he directly laundered money, but because he developed and maintained an open-source and permissionless privacy tool on Ethereum (ETH) that a minority of users allegedly used for criminal activities. Notably, the Dutch court estimates that 84% of all transactions in Tornado Cash were non-criminal, according to a report by FreedomTech. This has outraged the crypto and privacy communities, as experts warn of a dangerous precedent that could harm the industry. Picks for you Colony Lab launches a “Liquid Vesting” platform to democratize early-stage crypto investments 1 hour ago We asked ChatGPT-4o what will be XRP price at the end of 2024; Here’s what it said 2 hours ago Silver vs inflation: Is silver a hedge against inflation? 2 hours ago Crypto expert PlanB reveals when Bitcoin will ‘go vertical’ 2 hours ago According to multiple sources, most open-source protocols and applications could become a target following this ruling’s logic. Experts warn of dangerous precedent from Tornado Cash’s Dutch ruling In this context, independent journalist and privacy advocate Lola Leetz deemed the Tornado Cash verdict “completely insane.” In a thread posted on X, Leetz explained the consequences of the Dutch ruling and how it changes developers’ accountability. As described, “open-source developers building non-custodial tools can be held responsible for criminal activity when criminal actors cannot be stopped or deanonymized.” Leetz also explained that this laid out software development as criminal intent. Moreover, the journalist classifies Tornado Cash as a communications service despite the court ruling otherwise. The entire Tornado Cash verdict is completely insane and will turn the legality of building any privacy service on its head. 1.Open-source devs building non-custodial tools can be held responsible for criminal activity when crim. actors cannot be stopped or deanonymized pic.twitter.com/Bjw9ry5zkM — L0la L33tz (@L0laL33tz) May 14, 2024 The open-source development and privacy hub FreedomTech made a similar thread that delves into more details of the Tornado Cash ruling on the Netherlands. Essentially, the thread argues that Pertsev could not stop the illicit use of his tool and highlights that it even implemented compliance features according to the known regulations at that time. Tornado Cash dev ruled liable for all illicit use, despite no ability to prevent it ️ We'll break down both the ruling itself and the craziness of the precedent set here by the case against Alex Pertsev, a developer and co-founder of the @TornadoCash project pic.twitter.com/wRycZZGiBk — Freedom.Tech (@freedomtech) May 14, 2024 What is next for crypto and privacy developers? Interestingly, Joel Valenzuela – responsible for business development and marketing for Dashpay – warned of privacy being “under attack.” Valenzuela mentioned other regulation and enforcement events that fall in a similar category to Alexey Pertsev’s sentencing. In particular, the arrest of Samourai Wallet developers, Wasabi Wallet’s leaving the United States and then shutting down, privacy coins’ delistings, and peer-to-peer crypto exchange platforms’ shutting down. Nevertheless, the content creator highlighted privacy as a human right and a normal attribute to seek. According to him, cryptocurrency users should focus on using privacy by default for everyday transactions, like “buying a coffee.” Joel also said developers should avoid being in the U.S. and Europe while remaining anonymous for safety concerns. Tornado Cash developer Alexey Pertsev has been found guilty of money laundering and sentenced to 64 months in prison! This travesty of justice in the Dutch courts shows that the crypto crackdown is indeed global. As a recap, Tornado Cash is a smart contract on Ethereum which… pic.twitter.com/ZxOrHPrgUD — Joel Valenzuela (@TheDesertLynx) May 14, 2024 In conclusion, the Dutch court’s ruling against Alexey Pertsev sets a troubling precedent for cryptocurrencies and privacy. This decision undermines the role of developers in creating open-source, non-custodial tools. Experts warn that targeting developers in this way threatens innovation and privacy rights. The case has agitated the crypto community, emphasizing potential widespread implications for similar technologies. Developers and privacy advocates continue to voice their concerns, pointing out the ruling’s broader impact on privacy and online freedom. Moving forward, the industry must navigate these new legal challenges carefully to protect privacy and foster innovation in the digital space. Source: https://thebittimes.com/crypto-in-peril-as-court-ruling-sets-a-dangerous-precedent-tbt88384.html","article_summary":"On May 14, a Dutch court sentenced Alexey Pertsev, developer of Tornado Cash, to five years in prison. This unprecedented ruling can create a dangerous precedent for cryptocurrency and privacy development, challenging previous worldwide...","publisher":{"name":"The Bit Times","logo":"https://logo.clearbit.com/thebittimes.com?size=96"},"creation_date":"2024-05-15T10:54:24Z","categories":["crypto","cryptocurrency","ethereum","eth","xrp","bitcoin"],"article_link":"https://thebittimes.com/crypto-in-peril-as-court-ruling-sets-a-dangerous-precedent-tbt88384.html","thumbnail_image":"https://cdn.thebittimes.com/vimedia/w800/2024/05/15/ca466f12c0a7fdcdadc576a678b41b25.webp"},{"article_title":"Liquid Restaking Protocol YieldNest Launches ynETH on Mainnet!","author":"Advertorial","article_detailed_content":"YieldNest, an innovative liquid restaking protocol, proudly announces the official launch of ynETH on Mainnet after securing $5.2MIL in their initial round. This was all made possible as a result of the hard work and dedication of their team and marks the start of a new chapter. A word from the CEO of YieldNest about this achievement: “We are thrilled to announce the launch of YieldNest on Mainnet. This milestone represents our dedication and vision to revolutionize the liquid restaking landscape. With YieldNest, we are not just providing a solution; we are shaping the future of decentralized finance. ” Amadeo Brands Restaking ETH on YieldNest is simple, where users receive ynETH (a native liquid restaking token) to earn base layer and restaking rewards. YieldNest provides an easy solution for ETH holders to natively restake their ETH into EigenLayer and earn rewards without sacrificing liquidity. YieldNest’s mission is to ensure a seamless and secure user experience, while simultaneously enhancing the Ethereum ecosystem and delivering consistent, sustainable yields to its users over the long term. Simplified overview of the rewards possibilities Special Launch Program To celebrate the launch on Mainnet and reward early supporters, YieldNest launched their Seeds Program. Users have the unique opportunity to receive a 5x boost multiplier on their Seeds for 7 days. This exclusive campaign ends on May 21, at 11:59 PM UTC. Pioneer Program To make it even more exciting – YieldNest is launching their Pioneer Program, which rewards users who restake 5 ETH or more. They will receive eligibility to mint an exclusive NFT that will provide a 15% permanent Seed boost. This exclusive campaign ends on May 28, at 11:59 PM UTC. Follow this step-by-step guide to restake your ETH. Why YieldNest? YieldNest ensures high security and risk management. They recently received top tier security audits from ChainSecurity and Zokyo. They also launched their independent risk and research group, the YieldNest Risk Team which is powered by the LlamaRisk team from Curve. This team carefully selects and fully vets operators and AVSs with the highest possible risk-adjusted yield with risk assessment. Not to mention that YieldNest is backed by the best of the industry. Hereby a few notable names: Lead Contributor Faculty Group, along with venture capitalists Backed VC, Frax Founder Sam Kazemian, Curve founder Michael Egorov, Kyber founder Loi Luu, Convex co-founders Winthorpe & C2TP, Proof Capital, LVT Capital, Contango, Mozaik Capital, Kahuna, Rana Capital, Insignius Capital, CKC, and angels & advisors from blue-chip DeFi teams at Algorand (Steve Kokinos), Curve (Martin Krung & Nagaking), Moralis (Ivan on Tech), Yearn (Wavey), Google (Allen Day) & others. How to get ynETH? Restaking with YieldNest is simple and secure: Visit their website Go to the app Select ynETH Select the amount of ETH you want to deposit Confirm the transaction Done! YieldNest has recently launched, so you are still early. Make sure you grab your chance to be one of the first and get rewarded along the way. About YieldNest Led by a team of industry veterans, YieldNest aims to become EigenLayer’s top liquid restaking solution, unlocking the next generation of ETH yields through custom-tailored restaking strategies. The post Liquid Restaking Protocol YieldNest Launches ynETH on Mainnet! appeared first on BeInCrypto.","article_summary":"YieldNest, an innovative liquid restaking protocol, proudly announces the official launch of ynETH on Mainnet after securing $5.2MIL in their initial round. This was all made possible as a result of the hard work and dedication of their team and marks the start of a new chapter. A word from the CEO of YieldNest about … Continued The post Liquid Restaking Protocol YieldNest Launches ynETH on Mainnet! appeared first on BeInCrypto.","publisher":{"name":"Be(In)Crypto","logo":"https://t3.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://beincrypto.com/&size=64"},"creation_date":"2024-05-15T10:54:06Z","categories":["eth","token","ethereum","nft","defi","algorand"],"article_link":"https://beincrypto.com/liquid-restaking-protocol-yieldnest-launches-yneth-on-mainnet/","thumbnail_image":"https://beincrypto.com/wp-content/uploads/2024/05/Снимок-экрана-2024-05-15-в-13.50.29.png"},{"article_title":"Bitcoin (BTC) Becomes Essential for Pension Funds, According to Crypto Expert Michael Saylor","author":"Lucien Renard","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! In a recent development, MicroStrategy co-founder Michael Saylor predicts that US pension funds will need to include Bitcoin in their portfolios. The State of Wisconsin Investment Board (SWIB) has recently acquired $99 million worth of shares of BlackRock’s Bitcoin ETF (IBIT). […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! In a recent development, MicroStrategy co-founder Michael Saylor predicts that US pension funds will need to include Bitcoin in their portfolios. The State of Wisconsin Investment Board (SWIB) has recently acquired $99 million worth of shares of BlackRock’s Bitcoin ETF (IBIT). […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T10:53:07Z","categories":["bitcoin","btc","crypto","pepe"],"article_link":"https://en.coinotag.com/bitcoin-btc-becomes-essential-for-pension-funds-according-to-crypto-expert-michael-saylor/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-5.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Ethereum’s Apeiron Game Launches $1M Esports Championship: A New Milestone for ETH Gaming","author":"Merritt Vale","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Ethereum-based trading card game, Apeiron, has announced a $1 million prize pool for its inaugural world championship, Apeiron Guild Wars 2024. The top 12 guilds will compete for a share of the prize pool, with half the prize pool being in […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Ethereum-based trading card game, Apeiron, has announced a $1 million prize pool for its inaugural world championship, Apeiron Guild Wars 2024. The top 12 guilds will compete for a share of the prize pool, with half the prize pool being in […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T10:50:36Z","categories":["eth","pepe"],"article_link":"https://en.coinotag.com/ethereums-apeiron-game-launches-1m-esports-championship-a-new-milestone-for-eth-gaming/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies35.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Robinhood and Other Top 10 Platforms Announce Support for SOL and 12 Other Altcoins: A Major Boost for Crypto Traders","author":"Crypto Vira","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Robinhood Crypto has announced a series of exciting features to attract new users and expand its footprint in Europe. These features aim to provide European crypto enthusiasts with a more comprehensive and user-friendly experience. Meanwhile, Coinbase has added a new altcoin […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Robinhood Crypto has announced a series of exciting features to attract new users and expand its footprint in Europe. These features aim to provide European crypto enthusiasts with a more comprehensive and user-friendly experience. Meanwhile, Coinbase has added a new altcoin […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T10:49:17Z","categories":["sol","crypto","pepe"],"article_link":"https://en.coinotag.com/robinhood-and-other-top-10-platforms-announce-support-for-sol-and-12-other-altcoins-a-major-boost-for-crypto-traders/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-13.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Crypto Trader’s $46 Million Profit from PEPE Sparks Insider Trading Suspicions","author":"Lynn Wang","article_detailed_content":"A crypto trader made headlines after turning a modest $3,000 investment into over $46 million by trading Pepe (PEPE). The on-chain tracking platform Lookonchain highlighted this remarkable profit, amounting to a 15,718x return. Indeed, the trader’s success story showcases the volatility and potential of meme coins. Yet, it raises questions about the timing and knowledge behind such trades. PEPE Trader’s Remarkable Profit Stirs Market Speculations Lookonchain outlined that the trader initially invested nearly $3,000 on April 15, 2023, to purchase 4.9 trillion PEPE tokens. Since then, PEPE’s value has skyrocketed. This allowed the trader to sell portions of their holdings for substantial profits. They sold 1.41 trillion PEPE for $7.4 million and 255 billion PEPE for approximately $2.3 million. Despite these sales, the trader still holds 3.5 trillion PEPE, valued at around $38.9 million based on current prices. “[Their] total profit on PEPE is ~$46.3 million,” Lookonchain concluded. Read more: 7 Hot Meme Coins and Altcoins that are Trending in 2024 The Trader’s Transactions to Purchase 4.9 Trillion PEPE. Source: X/Lookonchain However, the purchase date raised questions among the crypto community since it was close to PEPE’s launch time. Moreover, on the same date, on-chain data revealed that the trader swapped 20,000 Timeless (LIT) tokens, worth roughly $2,256, to buy 3.4 trillion PEPE. Given LIT’s relatively obscure status and market capitalization of only $3.6 million, the decision to trade LIT for PEPE at that moment suggests a level of insider knowledge. On April 15, 2023, the LIT token traded at $0.111814, starkly contrasting its current price of $0.001539. This further fueled speculation about the trader’s possible insider status. Nevertheless, the trade proved timely and extraordinarily profitable. Read more: Pepe (PEPE) Price Prediction 2024 / 2025 / 2030 LIT Price Performance. Source: CoinGecko Regardless of the trader’s insider status, PEPE has experienced a meteoric rise. CoinGecko data indicates that PEPE reached a new all-time high of $0.00001151 today, marking its second record high this week. With a market capitalization of $4.68 billion, PEPE now ranks third among meme coins, trailing only Dogecoin (DOGE) and Shiba Inu (SHIB). PEPE’s recent success can be attributed to the renewed interest in meme assets following the return of Keith Gill, also known as “The Roaring Kitty.” Gill, famed for his role in the GameStop stock frenzy, recently resurfaced on social media, igniting a wave of speculation and investment in meme coins and stocks. BeInCrypto reported that Gill’s comeback has driven significant gains in meme coins like Roaring Kitty (KITTY) and GameStop (GME), with GME’s price surging by 3,814% in the past week alone. The post Crypto Trader’s $46 Million Profit from PEPE Sparks Insider Trading Suspicions appeared first on BeInCrypto.","article_summary":"A crypto trader's $3,000 investment in PEPE meme coin skyrocketed to $46 million. The post Crypto Trader’s $46 Million Profit from PEPE Sparks Insider Trading Suspicions appeared first on BeInCrypto.","publisher":{"name":"Be(In)Crypto","logo":"https://t3.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://beincrypto.com/&size=64"},"creation_date":"2024-05-15T10:46:55Z","categories":["crypto","pepe","token","dogecoin","doge","shib"],"article_link":"https://beincrypto.com/crypto-trader-46-million-profit-from-pepe/","thumbnail_image":"https://beincrypto.com/wp-content/uploads/2023/05/bic_Pepe_neutral_3.png"},{"article_title":"Match-Trade Announces Appointment of New CCO in Management Revamp","author":"Tareq Sikder","article_detailed_content":"Match-Trade Technologies, a provider of trading technology and liquidity solutions, has announced changes in its strategic management positions following the opening of its representative office in Dubai earlier this year. Adjusting Leadership Roles for MENA Expansion Machel Nichols, who has spearheaded the Sales division at Match-Trade Technologies with notable success, will be transitioning to Match-Prime Liquidity, the company's strategic partner, as Chief Commercial Officer (CCO). This move aims to strengthen the company's presence in the MENA region. Przemysław Wojtyna, a member of the company since December 2021, will assume the role of Sales Manager at Match-Trade Technologies. Michael Nichols commented on his transfer to the liquidity provider: \"During my tenure at Match-Trade, we successfully broke barriers in the industry, setting new market trends. Now, I am excited to shift my focus to expanding our business in Dubai as part of the Match-Prime team, with whom I have closely collaborated for years. My new role will help secure face-to-face meetings with our clients while spearheading the Dubai office's growth and helping the team achieve its goals.\" Management Changes and Technological Advancements Meanwhile, Wojtyna's transition from Head of Business Development is met with recognition for his instrumental role in advancing the Match2Pay payment processor, positioning it for future growth. Wojtyna emphasized his commitment to managing the global sales team and driving technological advancements, particularly in servicing the prop trading industry with the latest Match-Trader platform. “The forex market is very dynamic, so many challenges await me, but I believe in the strength of our team and the unlimited potential inherent in our in-house technology. We intend to continue providing technological advancements to the market. Therefore, my priority lies in servicing the prop trading industry's growth with our latest development of the Match-Trader platform, a turnkey solution for Prop firms”, added Wojtyna. Commenting on these developments, Michal Karczewski, Match-Trade's CEO and a Co-Founder of Match-Prime Liquidity, highlighted the strategic significance of leveraging the expertise of individuals who have contributed significantly to the company's success. “Throughout their professional careers, they’ve both built solid positions in the industry and have an excellent sense of the potential our companies bring to the market. For me, those guarantees that both gentlemen will excel in their new roles,” commented Karczewski. This article was written by Tareq Sikder at www.financemagnates.com.","article_summary":"Match-Trade Technologies, a provider of trading technology and liquidity solutions, has announced changes in its strategic management positions following the opening of its representative office in Dubai earlier this year. Adjusting Leadership Roles for MENA Expansion Machel Nichols, who has spearheaded the Sales division at Match-Trade Technologies with notable success, will be transitioning to Match-Prime Liquidity, the company's strategic partner, as Chief Commercial Officer (CCO). This move aims to strengthen the company's presence in the MENA region. Przemysław Wojtyna, a member of the company since December 2021, will assume the role of Sales Manager at Match-Trade Technologies. Michael Nichols commented on his transfer to the liquidity provider: \"During my tenure at Match-Trade, we successfully broke barriers in the industry, setting new market trends. Now, I am excited to shift my focus to expanding our business in Dubai as part of the Match-Prime team, with whom I have closely collaborated for years. My new role will help secure face-to-face meetings with our clients while spearheading the Dubai office's growth and helping the team achieve its goals.\" Management Changes and Technological Advancements Meanwhile, Wojtyna's transition from Head of Business Development is met with recognition for his instrumental role in advancing the Match2Pay payment processor, positioning it for future growth. Wojtyna emphasized his commitment to managing the global sales team and driving technological advancements, particularly in servicing the prop trading industry with the latest Match-Trader platform. “The forex market is very dynamic, so many challenges await me, but I believe in the strength of our team and the unlimited potential inherent in our in-house technology. We intend to continue providing technological advancements to the market. Therefore, my priority lies in servicing the prop trading industry's growth with our latest development of the Match-Trader platform, a turnkey solution for Prop firms”, added Wojtyna. Commenting on these developments, Michal Karczewski, Match-Trade's CEO and a Co-Founder of Match-Prime Liquidity, highlighted the strategic significance of leveraging the expertise of individuals who have contributed significantly to the company's success. “Throughout their professional careers, they’ve both built solid positions in the industry and have an excellent sense of the potential our companies bring to the market. For me, those guarantees that both gentlemen will excel in their new roles,” commented Karczewski. This article was written by Tareq Sikder at www.financemagnates.com.","publisher":{"name":"Finance Magnates","logo":"https://t1.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.financemagnates.com/&size=64"},"creation_date":"2024-05-15T10:45:33Z","categories":["general"],"article_link":"https://www.financemagnates.com//executives/match-trade-announces-appointment-of-new-cco-in-management-revamp/","thumbnail_image":""},{"article_title":"FXCubic Enhances Crypto Trading with Devexperts’ DXtrade CFD Integration: A Boost for Coin Traders","author":"Marisol Navaro","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! FXCubic and Devexperts Collaborate to Enhance DXtrade CFD FXCubic, a leading liquidity provider, has integrated with Devexperts’ white-label trading platform, DXtrade CFD. This collaboration aims to enhance the efficiency and customization of OTC brokers using DXtrade CFD. With this integration, brokers […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! FXCubic and Devexperts Collaborate to Enhance DXtrade CFD FXCubic, a leading liquidity provider, has integrated with Devexperts’ white-label trading platform, DXtrade CFD. This collaboration aims to enhance the efficiency and customization of OTC brokers using DXtrade CFD. With this integration, brokers […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T10:43:12Z","categories":["crypto","pepe"],"article_link":"https://en.coinotag.com/fxcubic-enhances-crypto-trading-with-devexperts-dxtrade-cfd-integration-a-boost-for-coin-traders/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-18.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Choosing the Right Prop Trading Platform – Interview with PipFarm’s CEO James Glyde","author":"FM Contributors","article_detailed_content":"While there is no shortage of prop trading platforms available on the market, these options are not all created equal. Finance Magnates spoke with James Glyde, CEO of PipFarm for his perspective and preferences on prop trading platforms. He also touched on the overall prop trading market and the strengths and weaknesses of multiple offerings. What motivated you to launch PipFarm when there is so much competition in the funded trader sector? Honestly, it’s exciting. Having worked in regulated business environments my entire career, I saw a great opportunity to use my skills and background to build an exciting product and brand without having both hands tied behind my back. We’re planning a lot of fun stuff product-wise. It’s true, the level of competition increased significantly recently. We have already noticed the impact: PPC bidding costs have risen, affiliates are becoming more selective and demanding, and competition is pushing prices down and risk up. However, this level of competition is temporary. Inevitably, many newcomers will fade away when they encounter operational problems, do not gain the expected traction, or do not meet their forecast profit margin. It’s already happening big names too. How has the prop trading industry responded to the MetaQuotes prohibition? When MetaQuotes informed brokers to immediately cease grey labelling their MetaTrader platforms to evaluation firms, most reacted by suspending their operations. Some firms haven’t recovered. Many evaluation firms built a business model that infringed on the terms and conditions of their primary platform provider. Another reason I chose cTrader is that Spotware has tailored its agreements for the funded trader business model. They officially support this business model. While many traders suffered from firms pausing operations, it provided cTrader a great opportunity to become the preferred trading platform among aspiring prop traders. One thing I’ve observed in all my roles is that cTrader users are more profitable traders. The prop trading industry triggered a resurgence of white-label trading platforms. Can you explain why you chose cTrader? The planning of PipFarm began long before the launch. Last year, every funded trader firm offered MT4 or MT5. At the time, only FTMO offered cTrader. There was a clear opportunity for the first one-stage cTrader prop firm evaluation. cTrader was an easy choice for me. The platform is feature-rich, well-developed, thoroughly tested, incredibly stable and extensively documented. Having spent several years selling and later working with cTrader at various brokers, I know this platform will meet PipFarm’s demands. You played a key role in the company’s early development and even accepted cTrader’s first Best Trading Platform award at the 2018 Finance Magnates London Summit. What are your thoughts on how the company has matured since leaving? cTrader was ahead of its time, and brokers were set in their ways. However, as time passed, cTrader’s novel features became more conventional; now, the platform offers the most comprehensive trading experience, with manual, automated, and copy trading all rolled into one. The substantial investment in mobile trading has really paid off, too. Now, cTrader wins awards yearly, and brokers are expected to offer cTrader. That only happened because of 15 years of consistently developing new features while competitors let their products stagnate. Most prop firms leading the industry are managed by individuals and teams outside the online trading industry. This year, experienced professionals like yourself are entering the market; why now and what impact will that have on the market? People and companies who’ve worked in the industry as long as I have are naturally cautious. We’re used to following rules and regulations and considering the potential risk and impact of every decision. As I mentioned earlier, PipFarm resulted from months of consideration and planning. I’m sure my peers watched the industry grow from the sidelines and consulted with regulatory experts before making their move. I feel there is a significant opportunity to level up the experience offered to traders. Most firms focus on churning accounts with aggressive promotions and unreasonable rules rather than focusing on what matters. We surveyed our small but growing community, and when asked which three features they look for in a prop firm, 85% said they look for firms with clear rules, and 75% avoid firms with consistency rules. 60% of respondents said they are happy with cTrader, and 19% said they don’t care about the trading platform and rules are more important than platforms. While a handful of firms stand out and truly impress me, many more simply practice aggressive and dishonest marketing tactics. Why do you think this market is rife with inexperience? We’ve seen this before with forex brokers in 2011, binary options in 2015, ICOs in 2017 and now this. It’s a product where, according to the marketing campaigns, with a small investment, you could make lots more money. In the end, things got so out of hand that regulators had to step in and take away every advantage. Just as consumers are attracted to the potential to profit, so are operators, who can set up highly profitable businesses with minimal barriers to entry and no oversight or operational expenses related to legal or compliance. Everything can be thrown into the marketing budget. Funded trader evaluations are a fantastic product that allows everyone to access and try trading with minimal financial liability. I hope more experienced participants will protect this industry and preserve its advantages for users before it’s too late. This article was written by FM Contributors at www.financemagnates.com.","article_summary":"While there is no shortage of prop trading platforms available on the market, these options are not all created equal. Finance Magnates spoke with James Glyde, CEO of PipFarm for his perspective and preferences on prop trading platforms. He also touched on the overall prop trading market and the strengths and weaknesses of multiple offerings. What motivated you to launch PipFarm when there is so much competition in the funded trader sector? Honestly, it’s exciting. Having worked in regulated business environments my entire career, I saw a great opportunity to use my skills and background to build an exciting product and brand without having both hands tied behind my back. We’re planning a lot of fun stuff product-wise. It’s true, the level of competition increased significantly recently. We have already noticed the impact: PPC bidding costs have risen, affiliates are becoming more selective and demanding, and competition is pushing prices down and risk up. However, this level of competition is temporary. Inevitably, many newcomers will fade away when they encounter operational problems, do not gain the expected traction, or do not meet their forecast profit margin. It’s already happening big names too. How has the prop trading industry responded to the MetaQuotes prohibition? When MetaQuotes informed brokers to immediately cease grey labelling their MetaTrader platforms to evaluation firms, most reacted by suspending their operations. Some firms haven’t recovered. Many evaluation firms built a business model that infringed on the terms and conditions of their primary platform provider. Another reason I chose cTrader is that Spotware has tailored its agreements for the funded trader business model. They officially support this business model. While many traders suffered from firms pausing operations, it provided cTrader a great opportunity to become the preferred trading platform among aspiring prop traders. One thing I’ve observed in all my roles is that cTrader users are more profitable traders. The prop trading industry triggered a resurgence of white-label trading platforms. Can you explain why you chose cTrader? The planning of PipFarm began long before the launch. Last year, every funded trader firm offered MT4 or MT5. At the time, only FTMO offered cTrader. There was a clear opportunity for the first one-stage cTrader prop firm evaluation. cTrader was an easy choice for me. The platform is feature-rich, well-developed, thoroughly tested, incredibly stable and extensively documented. Having spent several years selling and later working with cTrader at various brokers, I know this platform will meet PipFarm’s demands. You played a key role in the company’s early development and even accepted cTrader’s first Best Trading Platform award at the 2018 Finance Magnates London Summit. What are your thoughts on how the company has matured since leaving? cTrader was ahead of its time, and brokers were set in their ways. However, as time passed, cTrader’s novel features became more conventional; now, the platform offers the most comprehensive trading experience, with manual, automated, and copy trading all rolled into one. The substantial investment in mobile trading has really paid off, too. Now, cTrader wins awards yearly, and brokers are expected to offer cTrader. That only happened because of 15 years of consistently developing new features while competitors let their products stagnate. Most prop firms leading the industry are managed by individuals and teams outside the online trading industry. This year, experienced professionals like yourself are entering the market; why now and what impact will that have on the market? People and companies who’ve worked in the industry as long as I have are naturally cautious. We’re used to following rules and regulations and considering the potential risk and impact of every decision. As I mentioned earlier, PipFarm resulted from months of consideration and planning. I’m sure my peers watched the industry grow from the sidelines and consulted with regulatory experts before making their move. I feel there is a significant opportunity to level up the experience offered to traders. Most firms focus on churning accounts with aggressive promotions and unreasonable rules rather than focusing on what matters. We surveyed our small but growing community, and when asked which three features they look for in a prop firm, 85% said they look for firms with clear rules, and 75% avoid firms with consistency rules. 60% of respondents said they are happy with cTrader, and 19% said they don’t care about the trading platform and rules are more important than platforms. While a handful of firms stand out and truly impress me, many more simply practice aggressive and dishonest marketing tactics. Why do you think this market is rife with inexperience? We’ve seen this before with forex brokers in 2011, binary options in 2015, ICOs in 2017 and now this. It’s a product where, according to the marketing campaigns, with a small investment, you could make lots more money. In the end, things got so out of hand that regulators had to step in and take away every advantage. Just as consumers are attracted to the potential to profit, so are operators, who can set up highly profitable businesses with minimal barriers to entry and no oversight or operational expenses related to legal or compliance. Everything can be thrown into the marketing budget. Funded trader evaluations are a fantastic product that allows everyone to access and try trading with minimal financial liability. I hope more experienced participants will protect this industry and preserve its advantages for users before it’s too late. This article was written by FM Contributors at www.financemagnates.com.","publisher":{"name":"Finance Magnates","logo":"https://t1.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.financemagnates.com/&size=64"},"creation_date":"2024-05-15T10:42:51Z","categories":["general"],"article_link":"https://www.financemagnates.com//thought-leadership/choosing-the-right-prop-trading-platform-interview-with-pipfarms-ceo-james-glyde/","thumbnail_image":""},{"article_title":"Top Performing Cryptocurrencies to Watch in May 2024: Unveiling High-Potential Coins and Their Symbols","author":"Lucien Renard","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! As we move into May 2024, the crypto market is buzzing with potential investment opportunities. With a myriad of options available, it can be challenging to identify the most promising cryptocurrencies. “In this crowded market, it’s more important than ever to […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! As we move into May 2024, the crypto market is buzzing with potential investment opportunities. With a myriad of options available, it can be challenging to identify the most promising cryptocurrencies. “In this crowded market, it’s more important than ever to […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T10:41:10Z","categories":["pepe","crypto"],"article_link":"https://en.coinotag.com/top-performing-cryptocurrencies-to-watch-in-may-2024-unveiling-high-potential-coins-and-their-symbols/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-6.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Bitcoin Nears $63K as Bulls Chew Through 'Taker Selling'","author":"Omkar Godbole","article_detailed_content":"A taker order is the","article_summary":"A taker order is the","publisher":{"name":"CoinDesk","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.coindesk.com/&size=64"},"creation_date":"2024-05-15T10:38:04Z","categories":["bitcoin"],"article_link":"https://www.coindesk.com/markets/2024/05/15/bitcoin-gains-2-to-628k-as-bulls-chew-through-taker-selling/?utm_medium=referral&utm_source=rss&utm_campaign=headlines","thumbnail_image":"https://www.coindesk.com/resizer/N-8QF3wbmxSz-tK3Fo8d68_qafE=/800x600/cloudfront-us-east-1.images.arcpublishing.com/coindesk/CIJWJZ4WLFCE5DCN4JZDK3KZL4.png"},{"article_title":"Google I/O 2024 Unveils Gemini AI’s Impressive Demonstrations","author":"Emman Omwanda","article_detailed_content":"Google I/O 2024, an annual developer conference, demonstrated several spectacular innovations in AI via the Gemini model. The event took place at the Shoreline Amphitheater in Mountain View, California. Google’s Gemini AI demo revealed various capabilities of the Gemini AI. These demonstrations confirmed the huge possibilities of AI in different areas and gave the viewers a firsthand experience of the technology’s huge potential. Email Interactions and Information Retrieval with Gemini AI. Among all the improvements presented at Google I/O, the most amazing was the Summarize Emails feature for Gmail, which Gemini AI powers. This feature tackles the problem of information overload by shortening long emails into summaries that the user likes. With the help of natural language processing abilities, Gemini can extract the required information from large email communications. Hence, users can review the key points without wasting time on large content. Gmail Q&A: The process of Email Interaction Should Be Much Simpler. Paradoxically, many Time-Wasting Activities exist. Assume that would be boiled down to five. TFL: This is deleting address duplicates and replying to conflicts. One of the significant incidents that came to light was the Gmail Q&A feature, a tool created to simplify email communications in the Google Workspace. Thus, this feature enables users to ask Gemini a particular question; the AI will then get the data of the emails right away. Gemini AI’s advanced capabilities Gemini’s ability to recognize and sort different content types, such as receipts and invoices, can be seen. This capability is a new way of doing tasks that involves producing new things by managing the company’s resources creatively; therefore, it makes the business more productive by automating the tiresome and boring tasks of the company, and it also helps in information recovery to be done quickly and efficiently. Gemini Advanced proved its competence in dealing with complex data sets, showing its ability to do a 1,500-page PDF document accurately. This demo proved the Gemini’s ability to get information from long texts, which helped it understand the context and, therefore, could quickly extract information from the texts. Besides, Gemini’s ability to find the differences and similarities in the documents shows its potential for many uses, such as regulations compliance and academic research. AI coaching with Gemini AI coaching for soccer, in which Gemini displayed the players’ actual performance on the spot. Using computer vision technology, Gemini tested players’ techniques and gave them the feedback necessary to raise their skills. This example of the use of AI in sports training manifests its transformation of skill development; thus, it provides personalized insights specific to individual players’ needs. Project Astra’s AR revolution The innovative Project Astra brought to the scene the latest AR technology and techniques using Gemini AI, which changed the way people communicate with digital content. Through the use of real-time object recognition and multi-modal reasoning, Project Astra makes the user interact more effectively in different areas, from gaming to everyday tasks. The ability of the device to maintain the context is a sign of great progress in the field of AR technology, which thus will make the experiences immersive and personalized. Imagen 3 redefines visual creation Artificial Intelligence is pushing the Boundaries of Generative AI to the point where it is no longer possible to distinguish it from a human. In image 3, the generation of AI and the capabilities of AI in image creation are shown; hence, the user can create visually stunning content using textual prompts. This new invention is the inventor of new creative worlds, allowing users to create different visual products with little input. Through AI, Imagen 3 enables users to create their ideas and journey into new areas of expression. MusicFX DJ music composition with AI The key factor that differentiates the future of music creation from the current will be the incorporation of AI in the music production process and the enhancement of the creative aspect of music through AI-powered tools. Through the MusicFX DJ, the interaction of AI and music composition was displayed. The users were provided with a unique platform to compose music using intuitive controls and text prompts. This cutting-edge device boosts creativity by allowing users to play with different sound combinations and arrangements. Although MusicFX DJ accepts traditional music composition styles, it is also an encouraging way to promote music education and artistic expression.","article_summary":"Google I/O 2024, an annual developer conference, demonstrated several spectacular innovations in AI via the Gemini model. The event took place at the Shoreline Amphitheater in Mountain View, California. Google’s Gemini AI demo revealed various capabilities of the Gemini AI. These demonstrations confirmed the huge possibilities of AI in different areas and gave the viewers […]","publisher":{"name":"Cryptopolitan","logo":"https://t0.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.cryptopolitan.com/&size=64"},"creation_date":"2024-05-15T10:36:58Z","categories":["ai","ar"],"article_link":"https://www.cryptopolitan.com/google-i-o-unveils-gemini-ais-demonstrations/","thumbnail_image":"https://www.cryptopolitan.com/wp-content/uploads/2024/05/Default_Google_IO_2024_Unveils_Gemini_AIs_Impressive_Demonstra_1-2.jpg"},{"article_title":"Runes are Taking Off: Bitcoin-Based Tokens Get Performance Boost on Exchanges","author":"Hristina Vasileva","article_detailed_content":"The market for Runes, the new generation of Bitcoin-based tokens, is taking off and showing both growing volumes and some clear winners. Runes are still in the discovery stage, but recent OKX statistics show mainstream trading may soon take off. 🚨Runes are thriving on our Marketplace🚨 In the first few weeks since launch we've had: #️⃣ +1K BTC trading volume #️⃣ +100K no. of transactions #️⃣ +57K cumulative no. of pending orders Etch, manage & trade #Runes with full self-custody using #OKXWallet now. pic.twitter.com/0lDIVfNLrG — OKX (@okx) May 13, 2024 OKX is also turning into an informal hub for early Runes trading. More than 50% of current volumes are concentrated on the exchange, where price discovery is happening. The appearance of runes followed a few months of testing out BRC-20 tokens as the main tool on the Bitcoin network. Runes are specific assets based on direct UTXO records, which first went live in April 2024. The early-stage asset may greatly impact the ecosystem, while avoiding blockchain bloat. Runes Aim for Efficient Bitcoin-Based Tokenization The potential to create runes has existed since Bitcoin block 840,000, or for fewer than 4,000 blocks. Runes are the brainchild of Bitcoin developer Casey Rodarmore, to boost the creation of fungible tokens with a minimal effect on the blockchain. Overall, Runes are trying to offer a better tokenization standard, following previous attempts to generate Bitcoin-based tokens. Previously, Bitcoin offered technologies like colored coins. Later, Taproot assets, RGB tokens and BRC-20 assets went through their own hype cycle, but started causing network overload and high transaction fees. If Runes fulfills its promises, it may become the tool for the long-awaited “Bitcoin summer of DeFi”. The only drawback is that the expansion of Runes may take some time, and projects may already be dedicated to an older type of token. Runes Boost New Wave of Meme Tokens In the early days of Runes application, the chief driver for new projects is the creation or expansion of memes. The current leader of Rune technology tokens is Dog-Go-To-The-Moon (DOG), which is relatively obscure compared to other meme assets. DOG is ranked 268 based on market capitalization, with a supply of 100B tokens. The new meme token Rune launched on April 27, at $0.004, then slid by 50% to the current range of $0.002. Overall, Runes-based tokens have a market cap of just under $200M in total, but even at this early stage are showing competition and hype. Who Will Bring Liquidity to Runes? Runes offer some novelty, but token generation has become almost trivial in crypto space. In fact, more than 1 million tokens have been created, and very few make it into a liquid asset with meaningful trading. Finding the users, investors and markets for those tokens is a whole other issue. Just as soon as Runes launched on Bitcoin, there are projects that aim to bridge them with the Ethereum ecosystem, which still has the most liquid decentralized financial services. 🫂 #RunesBridge and @TunaChain forge a strategic alliance, Aiming to cultivate a vibrant and robust Bitcoin ecosystem for all users. 🔗 Tuna Chain, a modular Layer 2 solution built on #Bitcoin, introduces a native stablecoin and a Hybrid ZK-OP solution. It effortlessly… pic.twitter.com/T45SkUcVLy — RunesBridge (@RunesBridge) May 14, 2024 Currently, Runes projects are trying to build liquidity models, including Ordinals, NFT, and fungible tokens. Collections are dropping almost daily, competing for attention. Runes fungible tokens are still extremely volatile, even the earliest tokens with the most recognizable brands. Gentlemen, it's been a privilege playing with you #Runes pic.twitter.com/0JNzFhqswO — RomanSoldier (@RomanSoldierNFT) May 14, 2024 At the current early stage, Runes are all about hype and seeing which memes and collections will rise. Early investors are trying to buy up as much Runes as possible. The Runes and NFT trading systems are still trying to smooth out order books to avoid volatility. Runes hopes to create an environment similar to Ethereum-based DeFi. But for now, the market is driven by factors like the recently renewed GameStop stock rally after the renewed messages from Roaring Kitty. The Top 10 Rune coins with the highest trading volume in the last 24 hours have seen a few new entries, including GameStop and Roaring Kitty. Can traditional finance memes also find a home in Bitcoin?👀 pic.twitter.com/qPakgkJrX7 — GeniiData (@GeniiData) May 14, 2024 The greatest appeal of Runes is that they are currently near rock-bottom valuations. The main hope is that the Bitcoin DeFi summer may build value similar to that locked on Solana and Ethereum. Runes may also be used for airdrops, or tied to Ordinals collections. Since anyone can “etch” a Rune and airdrop it, wallets are already receiving copycat tokens and new assets, with no known history or liquidity. Additionally, valid Runes in 2024 are those minted after block 840,000. Earlier projects also claimed to mint Runes, but some of the early assets may be destroyed or invalid.","article_summary":"The market for Runes, the new generation of Bitcoin-based tokens, is taking off and showing both growing volumes and some clear winners. Runes are still in the discovery stage, but recent OKX statistics show mainstream trading may soon take off. OKX is also turning into an informal hub for early Runes trading. More than 50% […]","publisher":{"name":"Cryptopolitan","logo":"https://t0.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.cryptopolitan.com/&size=64"},"creation_date":"2024-05-15T10:36:56Z","categories":["btc","bitcoin","blockchain","token","rune","crypto","ethereum","nft","defi","near","solana"],"article_link":"https://www.cryptopolitan.com/runes-bitcoin-based-boost-on-exchanges/","thumbnail_image":"https://www.cryptopolitan.com/wp-content/uploads/2024/05/runes-1.jpg"},{"article_title":"XRP To Nearly $600? Analyst Makes Bold Claim, But Can It Overcome Legal Hurdles?","author":"Christian Encila","article_detailed_content":"A fresh prediction has ignited discussion in the XRP community. Analyst Cryptobilbuwoo is charting an ambitious course for the cryptocurrency, with a potential price target that has some investors excited and others skeptical. Echoes Of 2017: Fibonacci Paints A Bullish Picture Cryptobilbuwoo’s forecast draws inspiration from historical patterns, particularly the XRP rally of 2017. By leveraging Fibonacci retracement levels, a common technical analysis tool, they see a potentially similar scenario unfolding for the altcoin. Imagine a roadmap to the summit. Fibonacci levels act as checkpoints, highlighting potential resistance or support zones during a price rise. Cryptobilbuwoo suggests XRP could break through the $33 mark, aligning with the key Fib. 1.618 level. This would be a significant step forward, but the real climb comes next – a projected ascent to $589, based on the Fib. 2.382 level. A Lofty Target: Can XRP Reach The Top? However, there’s a significant hurdle to overcome. To reach $589, the coin would require a staggering price increase of over 100,000%. This ambitious target has many market analysts raising eyebrows. It’s a leap that some consider more akin to wishful thinking than a realistic market prediction. Other crypto market analysts present a contrasting view, suggesting XRP could even fall to zero. While this scenario seems extreme, it underscores the inherent volatility of the cryptocurrency market. At the time of writing, XRP was trading at $0.5004, down 1.4% and 4.2% in the daily and weekly timeframes, data from Coingecko shows. Meanwhile, in the XRP community, the $589 narrative used to be the main focus. The community’s excitement to see XRP at $589 is evident in the tweet below: It seems that most of the XRP community would hate to wake up tomorrow to a $589 XRP, as this would mean they could no longer accumulate it. But then again $589 is still cheap and actually nothing compared to what is actually coming! pic.twitter.com/hvySrx0RpY — Dr. Huber (@Leerzeit) May 7, 2024 Signs Of Optimism: Fueling The Ascent? Despite the skepticism surrounding the $589 target, there are positive signs for XRP. The coin has displayed resilience, consistently hovering above the psychologically important $0.50 level. Additionally, a trend of investors moving XRP off exchanges has emerged. This could indicate a more long-term bullish outlook and potentially reduce selling pressure. Technically, Cryptobilbuwoo finds support for their prediction in XRP’s historical price charts. They point to a descending triangle pattern on the XRP/BTC chart, a formation that preceded XRP’s breakout in 2017. Could this be a sign of history repeating itself? The Verdict: A Measured Climb Or A Fall From Grace? The future for XRP likely lies somewhere between the extremes. The $589 target might be overly optimistic, but a measured upswing based on technical indicators and reduced selling pressure remains a possibility. Featured image from Reddit, chart from TradingView","article_summary":"A fresh prediction has ignited discussion in the XRP community. Analyst Cryptobilbuwoo is charting an ambitious course for the cryptocurrency, with a potential price target that has some investors excited and others skeptical. Related Reading: Bullish On Ethereum: Analyst Predicts Crypto’s Imminent Takeoff Echoes Of 2017: Fibonacci Paints A Bullish Picture Cryptobilbuwoo’s forecast draws inspiration from historical patterns, particularly the XRP rally of 2017. By leveraging Fibonacci retracement levels, a common technical analysis tool, they see a potentially similar scenario unfolding for the altcoin. Imagine a roadmap to the summit. Fibonacci levels act as checkpoints, highlighting potential resistance or support zones during a price rise. Cryptobilbuwoo suggests XRP could break through the $33 mark, aligning with the key Fib. 1.618 level. This would be a significant step forward, but the real climb comes next – a projected ascent to $589, based on the Fib. 2.382 level. A Lofty Target: Can XRP Reach The Top? However, there’s a significant hurdle to overcome. To reach $589, the coin would require a staggering price increase of over 100,000%. This ambitious target has many market analysts raising eyebrows. It’s a leap that some consider more akin to wishful thinking than a realistic market prediction. Other crypto market analysts present a contrasting view, suggesting XRP could even fall to zero. While this scenario seems extreme, it underscores the inherent volatility of the cryptocurrency market. At the time of writing, XRP was trading at $0.5004, down 1.4% and 4.2% in the daily and weekly timeframes, data from Coingecko shows. Meanwhile, in the XRP community, the $589 narrative used to be the main focus. The community’s excitement to see XRP at $589 is evident in the tweet below: It seems that most of the XRP community would hate to wake up tomorrow to a $589 XRP, as this would mean they could no longer accumulate it. But then again $589 is still cheap and actually nothing compared to what is actually coming! pic.twitter.com/hvySrx0RpY — Dr. Huber🔥🦅🔥 (@Leerzeit) May 7, 2024 Signs Of Optimism: Fueling The Ascent? Despite the skepticism surrounding the $589 target, there are positive signs for XRP. The coin has displayed resilience, consistently hovering above the psychologically important $0.50 level. Additionally, a trend of investors moving XRP off exchanges has emerged. This could indicate a more long-term bullish outlook and potentially reduce selling pressure. Related Reading: Pepe Power! Meme Coin Surges On Back Of GameStop Nostalgia Technically, Cryptobilbuwoo finds support for their prediction in XRP’s historical price charts. They point to a descending triangle pattern on the XRP/BTC chart, a formation that preceded XRP’s breakout in 2017. Could this be a sign of history repeating itself? The Verdict: A Measured Climb Or A Fall From Grace? The future for XRP likely lies somewhere between the extremes. The $589 target might be overly optimistic, but a measured upswing based on technical indicators and reduced selling pressure remains a possibility. Featured image from Reddit, chart from TradingView","publisher":{"name":"NewsBTC","logo":"https://t1.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.newsbtc.com/&size=64"},"creation_date":"2024-05-15T10:35:22Z","categories":["xrp","cryptocurrency","crypto","optimism"],"article_link":"https://www.newsbtc.com/news/xrp-to-nearly-600-analyst-makes-bold-claim-but-can-it-overcome-legal-hurdles/","thumbnail_image":"https://www.newsbtc.com/wp-content/uploads/2024/05/a_f833ff.jpg?fit=460%2C305"},{"article_title":"Bitget Wallet Unveils Bitget Onchain Layer, Rolls Out $10M BWB Ecosystem Fund","author":"Chainwire &#160;","article_detailed_content":"Victoria, Seychelles, May 15th, 2024, Chainwire Bitget Wallet, a leading non-custodial wallet and decentralized ecosystem platform, has announced the launch of its latest product blueprint, the Bitget Onchain Layer, to revolutionize the overall Web3 experience for its users. The Bitget Onchain Layer will not only integrate a host of native DApps within Bitget Wallet through joint collaboration with builders, but also position Bitget Wallet as the primary on-chain extension and future of the Bitget ecosystem. Concurrently, a $10 million BWB Ecosystem Fund has also been established, dedicated to accelerating the development of the Bitget Onchain Layer and supporting aligned projects and initiatives. Powering the Bitget Onchain Layer are native Modular Feature-DApps (MFDs), specialized applications to streamline user interactions, enhance liquidity aggregation, and fortify security measures. Initially, the ecosystem fund will be dedicated towards the investment and incubation of various Web3 trading services, of which three are already in the pipeline: Pre-Market, on-chain derivatives market, and Trading Bot. These services, in the form of MFDs, will further complement Bitget Wallet’s existing Swap trading service. Since its inception as a multi-chain wallet in 2018, Bitget Wallet has evolved into a comprehensive platform featuring native functions such as multi-chain wallet, Swap, intelligent market data, Launchpad, inscriptions tool, and earning center, reflecting its transformation from an asset management tool to a full-stack DeFi ecosystem and platform. In this journey, Bitget Wallet has attracted over 20 million users globally and has gained widespread recognition. Just last month, the platform achieved a record high in Swap data, with trading and order volumes surpassing MetaMask. As Bitget Wallet continues to build, several enduring yet unresolved challenges in the Web3 space demand attention, including navigating across multiple blockchain networks, selecting the right DEXs, choosing from a myriad of liquidity pools, and much more, oftentimes resulting in a poor user experience. To produce innovative solutions to these problems, Bitget Wallet first began by introducing a native swap aggregator, Bitget Swap, to cater towards user demands for seamless on-chain trading and potential earning experiences. Deploying Bitget Swap as a native platform feature also opened up avenues for more value-added features including gas-free transactions and multiple trading modes to enhance the overall trading experience for users, forming the first step in Bitget Wallet’s journey to developing a native on-chain ecosystem layer. On a macro level, the Bitget Onchain Layer serves as an intermediate layer that abstracts away complexities for users to interact with the Web3 world with the help of Modular-Feature DApps (MFDs). These function both as standalone DApps as well as native features integrated directly into Bitget Wallet. By working with industry developers to create effective and purposeful MFDs, Bitget Wallet aims to meet users’ needs in a more efficient manner, while also supporting developers and DApp projects in Web3. Aside from trading, the Bitget Onchain Layer also aims to provide native accessibility for new narratives, assets, and opportunities across Web3 from Bitget Wallet by introducing an open and collaborative ecosystem strategy to offer comprehensive coverage over a spectrum of financial services. In tandem with the development of the Bitget Onchain Layer, the wallet has also prioritized the burgeoning Meme ecosystem as a central focus of its product roadmap. Following the launch of Bitget Wallet’s experimental Meme token, $MOEW, the platform plans to explore further integrations and community engagements within this space, including Meme Grants and events to bolster Meme culture and Web3 engagement. Bitget Wallet has also engineered a dedicated Meme token leaderboard within its wallet interface, providing users with up-to-date information on the latest trending Meme coins and price movements, providing the competitive edge needed to stay ahead of the Meme market. Bitget Wallet and the Bitget Onchain Layer are fundamentally anchored by the BWB token, which has multiple roles within the ecosystem, including governance voting, eligibility for participation in Launchpad events, staking rewards, and payment of multichain gas fees, among other utilities. Following the conclusion of the BWB Points Airdrop Campaign and BWB Ecosystem Partner Program, the wallet has now announced its allocation plans for the BWB token. The total supply of BWB tokens is set at 1 billion, distributed across community rewards, team, and partnership initiatives. Nearly 47% of this total supply will be allocated to the community treasury and 10% will go to investors, while 5% will be reserved for the pre-TGE (token generation event) airdrop. Moving ahead, Bitget Wallet will continue to refine its platform by integrating high-frequency and core features that enhance user experience and interaction within the Web3 ecosystem. The focus will remain on product growth and strategic infrastructure development to sustain advancement and ensure a robust foundation for the future. Bitget Wallet’s evolution reflects its commitment to pushing the boundaries of what a Web3 wallet can offer. It has transitioned from asset management to a broader scope of DeFi functionalities, reinforcing its market position and setting a new standard in the cryptocurrency and DeFi space. About Bitget Wallet Bitget Wallet is Asia’s largest and leading global Web3 trading wallet, with over 20 million users worldwide. It offers a comprehensive range of features, including asset management, intelligent market data, swap trading, launchpad, inscribing, and DApp browsing. Currently, it supports more than 100 major blockchains, hundreds of EVM-compatible chains, and over 250,000 cryptocurrencies. Bitget Wallet enhances liquidity by aggregating it across hundreds of top DEXs and cross-chain bridges, facilitating seamless trading on nearly 50 blockchains. For more information, users can visit: Website Twitter Telegram Discord Contact PR team media.web3@bitget.com The post Bitget Wallet Unveils Bitget Onchain Layer, Rolls Out $10M BWB Ecosystem Fund appeared first on CoinJournal.","article_summary":"Victoria, Seychelles, May 15th, 2024, Chainwire Bitget Wallet, a leading non-custodial wallet and decentralized ecosystem platform, has announced the launch of its latest product blueprint, the Bitget Onchain Layer, to revolutionize the overall Web3 experience for its users. The Bitget Onchain Layer will not only integrate a host of native DApps within Bitget Wallet through […] The post Bitget Wallet Unveils Bitget Onchain Layer, Rolls Out $10M BWB Ecosystem Fund appeared first on CoinJournal.","publisher":{"name":"CoinJournal","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://coinjournal.net/&size=64"},"creation_date":"2024-05-15T10:34:58Z","categories":["web3","defi","blockchain","token","core","cryptocurrency"],"article_link":"https://coinjournal.net/news/bitget-wallet-unveils-bitget-onchain-layer-rolls-out-10m-bwb-ecosystem-fund/","thumbnail_image":"https://coinjournal.net/wp-content/uploads/2024/05/codeNzkzMGNlNzQ2Yzk5MTQxOGE3Zjc3ZjI0NWFiZmM4M2FfRV_1715763539Ug2rV6WgRW.jpeg"},{"article_title":"Blockchain for Good Alliance: Harnessing tech for better future","author":"The Crypto Times Team","article_detailed_content":"On April 15 this year, Blockchain for Good Alliance (BGA)- a global blockchain collaborative- was officially launched at an event in Dubai, where leading organizations and academic groups involved in the Web3 landscape came together to leverage the technology for societal good. The mega event, which was held at the Blockchain Life Dubai, saw the presence of organizations like Bitcoin Decode Official, Bybit Web3, Aptos, Alchemy Pay, Harvard Blockchain Club, Solana Foundation, ICP. Hub UAE, Coineasy, Libera and Bu Zhi DAO among others. Representatives of all leading organizations present at the event claimed that the blockchain collective group BGA will focus upon sharing resources and acting as an incubation centre to solve global social, environmental and economical challenges. In this article, we will discuss in detail about the BGA initiative and the promise it holds for the future. What is Blockchain for Good Alliance(BGA)? The BGA describes itself as a “collaborative network of organizations, projects, and individuals committed to leveraging blockchain technology to solve global social, environmental, and economic challenges.” The alliance, comprising leading blockchain experts, philanthropists, and advocates, aims to harness the transformative potential of blockchain technology to address pressing global challenges and drive positive change across diverse sectors. As per the BGA members, the collaboration will see networking opportunities with key leaders of the industry and sharing of resources, and organizing of events.The facilities to be offered by the BGA includes sharing resources including mentors, funding, education material, meetups, web3 consultancy, community activation among others. BGA also welcomes grant applications from projects, communities, start-ups, non-profits, social enterprises,students’ groups among others. Abbie, a spokesperson and representative of the Harvard Blockchain Club, said, “We are thrilled to be a part of the Blockchain for Good Alliance (BGA) launch.” Abbie added, “Through our commitment to exploring university initiatives such as establishing a blockchain publication repository and supporting BGA’s impactful projects, we aim to promote a culture of innovation and collaboration within our academic community.” Principles and Objectives of BGA At the heart of the BGA lies a set of founding principles centered around transparency, inclusivity, and sustainability. The alliance seeks to pioneer innovative solutions that tackle critical issues such as poverty alleviation, environmental conservation, healthcare access, and more by fostering collaboration among private, public, and nonprofit stakeholders. One of the alliance’s primary objectives is to promote ethical and responsible blockchain adoption, ensuring that technology is wielded as a force for societal benefit rather than exploitation. By championing data sovereignty, privacy, and decentralization principles, the alliance endeavors to empower individuals and communities to take ownership of their cryptocurrencies and identities, fostering trust and resilience in an increasingly interconnected world. Strategic Partnerships and Initiatives Through strategic partnerships with vital industry players, governmental bodies, and grassroots organizations, BGA aims to amplify its impact and scale solutions for maximum reach. Through collaborative initiatives such as blockchain-based supply chain transparency, decentralised finance for underserved populations, and digital identity platforms for refugees and marginalised communities, the alliance seeks to demonstrate the tangible benefits of blockchain technology in driving social change. Furthermore, the alliance is committed to advocating for supportive regulatory frameworks that facilitate innovation while safeguarding against potential risks and abuses. President of Solana Foundation, Lily Liu, emphasized that the collaboration will enhance commitment to harnessing blockchain for global benefit while driving impactful change. “This initiative has opened doors for innovative public infrastructure projects such as Helium and Hivemapper, where users not only contribute but also earn from their participation. Moreover, Solana’s technology facilitates accessible cross-border remittances and new financial products, making it a pivotal player in creating a more inclusive financial system,” she said. Building a Sustainable Future As the world engages with complex challenges ranging from climate change to economic inequality, the Blockchain for Good Alliance stands as a beacon of hope, offering a pathway toward a more equitable and sustainable future. By harnessing the power of blockchain technology to democratize access to financial services, enhance supply chain transparency, and strengthen social welfare systems, the alliance seeks to empower individuals and communities to grow in the face of adversity. Moreover, the alliance recognises the importance of promoting a culture of innovation and collaboration within the blockchain ecosystem. The coalition aims to nurture the next generation of blockchain developers, entrepreneurs, and changemakers through educational initiatives, hackathons, and incubator programs, equipping them with the skills and resources to drive meaningful impact. Conclusion The launch of the Blockchain for Good Alliance represents a pivotal moment in the evolution of blockchain technology, signaling a shift toward a more humane and sustainable approach to innovation. By uniting diverse stakeholders behind a shared vision of social impact, the alliance holds the potential to catalyze transformative change and create a better world for generations to come.","article_summary":"On April 15 this year, Blockchain for Good Alliance (BGA)- a global blockchain collaborative- was officially launched at an event in Dubai, where leading organizations and academic groups involved in the Web3 landscape came together to leverage the technology for societal good. The mega event, which was held at the Blockchain Life Dubai, saw the […]","publisher":{"name":"Crypto Times","logo":"https://logo.clearbit.com/www.cryptotimes.io?size=96"},"creation_date":"2024-05-15T10:29:30Z","categories":["blockchain","web3","bitcoin","aptos","solana","icp","helium"],"article_link":"https://www.cryptotimes.io/2024/05/15/blockchain-for-good-alliance/","thumbnail_image":"https://www.cryptotimes.io/wp-content/uploads/2024/05/blockchainforgood-1024x576.jpg"},{"article_title":"Shiba Inu (SHIB) Poised for Breakthrough, Solana (SOL) Faces Pressure, Bitcoin (BTC) Eyes Uptrend Reversal: Crypto Market Update","author":"Lucien Renard","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Shiba Inu (SHIB) shows signs of a bullish breakout from a descending triangle pattern, with key support levels at 0.000021 and 0.00001817. Solana (SOL) is experiencing a squeeze between two crucial moving averages, indicating potential price volatility. Bitcoin (BTC) is trading […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Shiba Inu (SHIB) shows signs of a bullish breakout from a descending triangle pattern, with key support levels at 0.000021 and 0.00001817. Solana (SOL) is experiencing a squeeze between two crucial moving averages, indicating potential price volatility. Bitcoin (BTC) is trading […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T10:28:22Z","categories":["shib","solana","sol","bitcoin","btc","crypto","pepe"],"article_link":"https://en.coinotag.com/shiba-inu-shib-poised-for-breakthrough-solana-sol-faces-pressure-bitcoin-btc-eyes-uptrend-reversal-crypto-market-update/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies34.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"State Of Wisconsin Invests $164 Million In Spot Bitcoin ETFs As ”Big Fish Institutions” Endorse BTC","author":"thebittimes@thebitfinance.com (TheBitTimes.Com)","article_detailed_content":"The State of Wisconsin invested $164 million in spot Bitcoin ETFs (exchange-traded funds) in the first quarter as institutional interest in the king of cryptos grows. The state’s investment board acquired 94,562 iShares Bitcoin Trust (IBIT) ETF shares worth about $100 million and $64 million worth of shares in the Grayscale Bitcoin Trust (GBTC), according to a filing with the US Securities and Exchange Commission (SEC). The investment board has over $156 billion in assets under management that are owned by the Wisconsin Retirement System (WRS), the State Investment Fund, and other state trust funds. The disclosure comes days after New Hampshire state representative Keith Ammon said the state should consider allocating some of its reserves into Bitcoin ETFs. Should the State of New Hampshire investigate allocating a small percentage of its reserves into a Bitcoin ETF? 🧵 — Rep. Keith Ammon (@RepKeithAmmon) May 12, 2024 Ammon noted that if New Hampshire had invested 5% of its emergency fund in Bitcoin in 2016, it would have already made a 10x return. Institutions Flock To Bitcoin ETFs Bloomberg ETF analyst Eric Balchunas said that Wisconsin’s investment in Bitcoin ETFs shows growing interest from “big fish institutions.” Wow, a state pension bought $IBIT in first quarter. Normally you don't get these big fish institutions in the 13Fs for a year or so (when the ETF gets more liquidity) but as we've seen these are no ordinary launches. Good sign, expect more, as institutions tend to move in herds https://t.co/leKVe2CK1S — Eric Balchunas (@EricBalchunas) May 14, 2024 First-quarter disclosures by institutions show that a number of them are holding Bitcoin ETFs. Multinational bank BNB Paribas filed its 13F report with the SEC on May 1, showing it holds 1,030 IBIT shares. JPMorgan also disclosed that it holds over $750,000 worth of Bitcoin ETF shares. In its filing, the bank revealed a diversified investment portfolio with investments in ETFs managed by BlackRock, Fidelity, Grayscale, ProShares, and Bitwise. Also Read: Billionaire Mark Cuban Of TV Show ”Shark Tank” Says SEC Is Failing To Protect Investors And ”Killing” Crypto Businesses Ripple CEO Brad Garlinghouse Says It’s Clear The US Is ”Going After” Tether New Cryptocurrency Releases, Listings, & Presales Today – GreenWAVES, Preprints.io, Cifi Source: https://thebittimes.com/state-of-wisconsin-invests-164-million-in-spot-bitcoin-etfs-as-big-fish-institutions-endorse-btc-tbt88383.html","article_summary":"The State of Wisconsin invested $164 million in spot Bitcoin ETFs (exchange-traded funds) in the first quarter as institutional interest in the king of cryptos grows.The state’s investment board acquired 94,562 iShares Bitcoin...","publisher":{"name":"The Bit Times","logo":"https://logo.clearbit.com/thebittimes.com?size=96"},"creation_date":"2024-05-15T10:27:14Z","categories":["bitcoin","btc","bnb","crypto","tether","cryptocurrency"],"article_link":"https://thebittimes.com/state-of-wisconsin-invests-164-million-in-spot-bitcoin-etfs-as-big-fish-institutions-endorse-btc-tbt88383.html","thumbnail_image":"https://cdn.thebittimes.com/vimedia/w800/2024/05/15/723c68e879cdac00006ec04703f58b40.webp"},{"article_title":"Bitcoin (BTC) & Ethereum (ETH) Remain Stable as U.S. Consumer Prices Report Looms: Crypto Market Update","author":"Merritt Vale","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Bitcoin and Ethereum, the world’s leading cryptocurrencies, remain steady ahead of the U.S. Bureau of Labor Statistics consumer prices report. The Consumer Price Index report, a key metric for the Federal Reserve, is expected to reflect another high, potentially impacting the […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Bitcoin and Ethereum, the world’s leading cryptocurrencies, remain steady ahead of the U.S. Bureau of Labor Statistics consumer prices report. The Consumer Price Index report, a key metric for the Federal Reserve, is expected to reflect another high, potentially impacting the […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T10:25:13Z","categories":["bitcoin","btc","ethereum","eth","crypto","pepe"],"article_link":"https://en.coinotag.com/bitcoin-btc-ethereum-eth-remain-stable-as-u-s-consumer-prices-report-looms-crypto-market-update/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-18.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Poloniex hacker laundered over 60% of stolen funds in just one week","author":"Denis Omelchenko","article_detailed_content":"A hacker behind Poloniex, despite being allegedly identified, successfully laundered more than half of stolen funds via Tornado Cash. A hacker, who attacked Poloniex in late 2023 and was later allegedly identified, laundered over $66 million out of $100 million…","article_summary":"A hacker behind Poloniex, despite being allegedly identified, successfully laundered more than half of stolen funds via Tornado Cash. A hacker, who attacked Poloniex in late 2023 and was later allegedly identified, laundered over $66 million out of $100 million…","publisher":{"name":"Crypto.news","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://crypto.news/&size=64"},"creation_date":"2024-05-15T10:24:45Z","categories":["general"],"article_link":"https://crypto.news/poloniex-hacker-laundered-over-60-of-stolen-funds-in-just-one-week/","thumbnail_image":"https://crypto.news/app/uploads/2024/03/crypto-news-hacker-option01.webp"},{"article_title":"What is Gate.io Lock USDT & Earn and How to Buy 150% APR Exclusively for New Users?","author":"Gideon Wolf","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! [//]:content-type-MARKDOWN-DONOT-DELETE Discover the unique features and potential of {Coin Name} ({Coin Symbol}), a promising cryptocurrency in the digital market. Learn the step-by-step process of purchasing {Coin Name} ({Coin Symbol}) on a trusted exchange platform. Explore the applications, benefits, drawbacks, and future […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! [//]:content-type-MARKDOWN-DONOT-DELETE Discover the unique features and potential of {Coin Name} ({Coin Symbol}), a promising cryptocurrency in the digital market. Learn the step-by-step process of purchasing {Coin Name} ({Coin Symbol}) on a trusted exchange platform. Explore the applications, benefits, drawbacks, and future […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T10:24:19Z","categories":["usdt","pepe","cryptocurrency"],"article_link":"https://en.coinotag.com/what-is-gate-io-lock-usdt-earn-and-how-to-buy-150-apr-exclusively-for-new-users/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-6.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Robinhood Announces Passive Income Opportunities for Users Despite SEC Warning: Embracing Cryptocurrency (COIN)","author":"Sheila Belson","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Robinhood Crypto introduces a new Solana staking product designed for European users. This service allows users to stake their Solana assets directly through the Robinhood app. With the start of Solana staking, Robinhood also announced a bonus program to attract more […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Robinhood Crypto introduces a new Solana staking product designed for European users. This service allows users to stake their Solana assets directly through the Robinhood app. With the start of Solana staking, Robinhood also announced a bonus program to attract more […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T10:23:09Z","categories":["cryptocurrency","pepe","crypto","solana"],"article_link":"https://en.coinotag.com/robinhood-announces-passive-income-opportunities-for-users-despite-sec-warning-embracing-cryptocurrency-coin/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-1.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Can AI Improve Learning Outcomes Around the Globe?","author":"Aamir Sheikh","article_detailed_content":"Ever since ChatGPT appeared on the scene last year, there has been a great deal of conjecture over the long-term effects on many businesses and activities. However, the impact on education has been felt more instantly than anywhere else. The role of AI in student learning Students, rather than working themselves via conventional learning exercises, might ask a computer to write essays, solve arithmetic problems,or finish complicated coursework projects quickly and attribute the results to themselves. But the equation is changing as now institutes are looking at ways they can incorporate AI in the education system that can produce positive outcomes and enhance the learning experience rather than stifle it. There is an abundance of data that shows how students around the world are utilizing AI to complement their studies. In addition to that, students also want to learn AI. A study report by the GoStudent organization noted that 83% of students in the UK who have used AI really liked it. The indications in the data are quite clear; for innovators and educators alike, the paradigm should be towards ‘how AI can enhance education’ rather than ‘how to stop students from using it.’ Source: Gostudent. Merging AI and human elements in education Experts think that in education, the importance of human instructors can never be underestimated. Even though AI has the potential to make tasks simple and speed up the learning process, it cannot replace the human interactions that take place in the classroom. But AI can help teachers create tailored lesson plans in a matter of a few minutes and generate lesson transcripts and summaries so that they have more time to spend with students discussing the topics. There are about 220 million pupils that are out of school around the globe. But the ones who are at school are also not learning the essential skills that can help them transition successfully into a useful workforce. According to a World Economic Forum report, AI can help address these gaps in the education and social systems. The report also highlighted that, in addition to helping to develop students’ digital literacy, critical thinking, creativity, and problem-solving abilities, AI can enhance how pupils are guided and assessed. While grading through AI remains an ethical concern, we think that the former can be achieved with the help of technology. The Forum’s Future of Jobs report ranks the above-mentioned qualities as some of the most in-demand skill sets. Above all, AI offers a more customized method of instruction that is tailored to the requirements and interests of each individual learner.","article_summary":"Ever since ChatGPT appeared on the scene last year, there has been a great deal of conjecture over the long-term effects on many businesses and activities. However, the impact on education has been felt more instantly than anywhere else. The role of AI in student learning Students, rather than working themselves via conventional learning exercises, […]","publisher":{"name":"Cryptopolitan","logo":"https://t0.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.cryptopolitan.com/&size=64"},"creation_date":"2024-05-15T10:22:41Z","categories":["ai"],"article_link":"https://www.cryptopolitan.com/ai-improve-learning-outcomes-around-globe/","thumbnail_image":"https://www.cryptopolitan.com/wp-content/uploads/2024/05/philipcryptopolitan_AI_can_complement_education_a14f56a1-c3ad-4468-8c3f-e11cf43867a8-1.jpg"},{"article_title":"Robinhood Crypto Unveils Solana Staking Product In Europe","author":"Jalpa Bhavsar","article_detailed_content":"Robinhood Crypto has announced the launch of a Solana-staking product with several new features tailored especially for its European customers. 🚨 Announcing a few new updates to Robinhood Crypto 🚨 First, Solana ($SOL) #staking is now live for eligible European customers 🎉 This allows customers to earn staking rewards on their $SOL holdings with the flexibility to unstake at any time.https://t.co/yioQfCHT2n /1 pic.twitter.com/J6cH0PMDC6 — Robinhood Crypto EU (@RobinhoodCrypto) May 15, 2024 As per the announcement, these new features are Learn & Earn modules, localized apps, cryptocurrency incentives for new users, and staking. The updates are intended to enhance accessibility, elevate the user experience, and reaffirm the dedication towards European cryptocurrency traders. With this launch, European users can now directly stake their Solana holding through the application, earning rewards and giving them the freedom to unstake at any moment, as the company said in the statement. Additionally, the company added that new users can receive a 10% bonus on their net purchases during their first 30 days on the platform. It also noted that “this bonus will be paid out in USDC.” Robinhood Crypto plans to release localized app versions in Lithuania, Poland, and Italy to improve the user experience. By offering translations in their native tongue, this change seeks to give users a more relaxed and secure trading environment. Additionally, Robinhood Crypto is introducing Learn & Earn modules focusing on AVAX, BTC, and USDC. These modules are aimed at educating customers about various cryptocurrencies while offering rewards and will be accessible in multiple languages, including Italian, Polish, and Lithuanian, further empowering users to expand their crypto knowledge. Johann Kerbrat, VP and GM of Robinhood Crypto, stated in the statement, “Since launching at the end of last year, our customers in Europe have told us loud and clear that they want an app that provides local language support and products that help them earn additional passive income.” Also Read: Robinhood CEO States That Americans Deserve Access to Crypto Assets","article_summary":"The new users can receive a 10% bonus on their net purchases during their first 30 days on the platform.","publisher":{"name":"Crypto Times","logo":"https://logo.clearbit.com/www.cryptotimes.io?size=96"},"creation_date":"2024-05-15T10:22:11Z","categories":["crypto","solana","sol","cryptocurrency","avax","btc","usdc"],"article_link":"https://www.cryptotimes.io/2024/05/15/robinhood-crypto-unveils-solana-staking-product-in-europe/","thumbnail_image":"https://www.cryptotimes.io/wp-content/uploads/2024/05/Robinhood-Crypto-Unveils-Solana-Staking-Product-In-Europe-1024x576.jpg"}]}