{"count":9690,"totalPages":323,"currentPage":6,"articles":[{"article_title":"BlockTower Capital and Sonne Finance Hit by Major Exploits: Millions Lost in Crypto Heists","author":"Amara Khatri","article_detailed_content":"Both BlockTower Capital, a major crypto hedge fund, and DeFi platform Sonne Finance have been exploited, resulting in the loss of a substantial amount of funds. BlockTower Loses AUM Another day, another crypto exploit. This time, the victim is the major crypto hedge fund, BlockTower Capital. Hackers have managed to break through the hedge fund’s defenses and siphon away a significant percentage of its total assets under management (AUM), which is estimated to be at least $1.7 billion. Sources close to the matter have confirmed the breach, although specific details remain undisclosed. While the firm has refrained from issuing an official statement, key partners have been notified of the situation. The firm has brought in leading blockchain forensics analysts to trace the hacker and recover the stolen assets, demonstrating confidence in its recovery capabilities. Previous Troubles For BlockTower BlockTower Capital has faced previous setbacks, including a $1.5 million hack of decentralized exchange aggregator Dexible in February 2023, as well as challenges due to the collapse of Silvergate Bank and Signature Bank, both of which had significant crypto exposure. Furthermore, the closure of its \"market-neutral\" crypto fund, managing over $100 million, compounded the firm's challenges, reflecting a history of vulnerability to security threats. Sonne Finance Under Attack Too In a separate incident, Sonne Finance, a decentralized liquidity market protocol operating on Optimism and Base, experienced a cyber attack on May 15, resulting in a significant loss of funds. Initially reported by blockchain security firm Cyvers as a $3 million theft from Sonne's USD Coin (USDC) and Wrapped Ethereum (WETH) contracts on the Optimism chain, the situation quickly escalated. Within 30 minutes, Cyvers updated the estimate to $20 million. Sonne Finance promptly addressed the incident on Twitter, announcing the pause of all markets on Optimism while assuring the safety of markets on Base. Shortly after, it was revealed that scammers attempted to further capitalize on the situation. A fraudulent Twitter account impersonating Sonne Finance urged users to revoke approvals to prevent further losses, accompanied by a suspicious link. However, the tweet was swiftly deleted. Security Exploits Plague Crypto Industry Cryptocurrency hacks continue to plague the industry, with significant losses reported over the years. In 2022, hackers stole $4 billion, followed by $2 billion in 2023. Despite a 65% reduction in hacking incidents as of April 2024, the monetary losses remain substantial. According to the SlowMist Weekly Security Report from April 28 to May 4, 2024, total losses from crypto-related security incidents amounted to $71.39 million. Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.","article_summary":"Both BlockTower Capital, a major crypto hedge fund, and DeFi platform Sonne Finance have been exploited, resulting in the loss of a substantial amount of funds.","publisher":{"name":"Crypto Daily","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://cryptodaily.co.uk/&size=64"},"creation_date":"2024-05-15T12:01:02Z","categories":["crypto","defi","blockchain","optimism","usdc","ethereum","link","cryptocurrency"],"article_link":"https://cryptodaily.co.uk/2024/05/blocktower-capital-and-sonne-finance-hit-by-major-exploits-millions-lost-in-crypto-heists","thumbnail_image":"https://cryptodaily.blob.core.windows.net/space/photo_2024-05-15%2015.32.40.jpeg"},{"article_title":"First Mover Americas: Bitcoin Approaches $63K Ahead of U.S. CPI Data","author":"Jamie Crawley, Omkar Godbole","article_detailed_content":"The latest price moves in bitcoin (BTC) and crypto markets in context for May 15, 2024. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets.","article_summary":"The latest price moves in bitcoin (BTC) and crypto markets in context for May 15, 2024. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets.","publisher":{"name":"CoinDesk","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.coindesk.com/&size=64"},"creation_date":"2024-05-15T12:00:37Z","categories":["bitcoin","btc","crypto"],"article_link":"https://www.coindesk.com/markets/2024/05/15/first-mover-americas-bitcoin-approaches-63k-ahead-of-us-cpi-data/?utm_medium=referral&utm_source=rss&utm_campaign=headlines","thumbnail_image":"https://www.coindesk.com/resizer/Wdk3_4q4kBSyNIYxUy1b6DbD4wo=/800x600/cloudfront-us-east-1.images.arcpublishing.com/coindesk/5DJDWFA7DZD6NJ7R6POL6FI73E.JPG"},{"article_title":"Crypto Analyst Shares Top AI Altcoin Investments This Month","author":"Jake Simmons","article_detailed_content":"In an analysis of the current landscape at the nexus of artificial intelligence and altcoins, crypto analyst Prithvir (@Prithvir12) recently shared insights via X that highlight both the opportunities and pitfalls in the AI coin market this month. His analysis covers upcoming AI catalysts, their impact on specific tokens, and personal investment recommendations, shedding light on the nuanced strategies required in this volatile segment. In-Depth Look At The AI Crypto Market Prithvir underlines a series of significant events in the AI space that are anticipated to directly impact the crypto markets. He first points to NVIDIA’s earnings announcement scheduled for May 22nd, emphasizing NVIDIA’s pivotal role in AI technology, which could have cascading effects on AI-centric cryptocurrencies. Further stirring the market is the buzz around OpenAI’s GPT-4oT. Moreover, Prithvir discusses the influence of major tech conferences focused on AI advancements, notably Google’s I/O conference and Apple’s emphasis on AI at its upcoming Worldwide Developers Conference (WWDC). He predicts these events are poised to introduce new AI initiatives that could impact crypto markets. In his post, Prithvir also analyzes several tokens that have responded differently to these AI catalysts. He describes WLD, associated with OpenAI through Sam Altman, which experienced a 20% drop in price last week, a typical “sell the news” reaction post the GPT-4o announcement. He expresses concerns about WLD’s “ridiculous tokenomics” and the risks posed by potential coordinated short squeezes, advising traders to approach with caution. Prithvir also touches upon OLAS, which, despite losing some visibility since its peak in 2023, remains active on the Gnosis chain and could be poised for a comeback depending on market conditions and developments within its platform, according to the analyst. The token SPEC, however, has shown significant volatility, skyrocketing from $5 to $15 and then retracting to $8 within two weeks. Prithvir critiques its high fully diluted valuation (FDV) close to $1 billion, warning of the speculative nature and the inherent risks of engaging with such a volatile asset. Lastly, he addresses the group of ASI tokens FET, AGIX and OCEAN, representing the Super Intelligence Alliance, noting that their once-leading positions in AI-driven market rallies have dwindled. According to Prithvir, these tokens are currently overvalued, with limited upside potential, indicating a saturated market state for these assets. Prithvir’s Top Altcoin Picks Navigating through the complexities of the AI coin market, Prithvir shares his preferred investment strategies and picks. He highlights Render (RNDR) as a favorable choice, especially leading up to NVIDIA’s earnings and Apple’s WWDC, due to its direct ties to their technologies and expected feature enhancements which might boost its value. “NVIDIA due to comparisons of GPU networks and Apple due to the rendering software they have built that Apple always features at different keynotes. Hence, I think this could be a good swing trade leading up to WWDC Time period – 3 weeks,” the analyst stated. AR is Prithvir’s “biggest AI coin holding currently.” The project is praised by him for its pivot to AI functionalities with the AO Computer and robust team. The presence of AR on Tier-1 exchanges and its substantial backing makes it a “no-brainer” for a medium-term hold. He also mentions NEAR, albeit with a smaller investment footprint due to the perceived limited upside. “Smaller position than AR due to more limited upside. But could become one of the consensus AI trades of this cycle due to its brand value, good liquidity and innovations in other sectors such as Chain Abstraction,” Prithvir wrote via X. At press time, RNDR traded at $10.1089.","article_summary":"In an analysis of the current landscape at the nexus of artificial intelligence and altcoins, crypto analyst Prithvir (@Prithvir12) recently shared insights via X that highlight both the opportunities and pitfalls in the AI coin market this month. His analysis covers upcoming AI catalysts, their impact on specific tokens, and personal investment recommendations, shedding light on the nuanced strategies required in this volatile segment. In-Depth Look At The AI Crypto Market Prithvir underlines a series of significant events in the AI space that are anticipated to directly impact the crypto markets. He first points to NVIDIA’s earnings announcement scheduled for May 22nd, emphasizing NVIDIA’s pivotal role in AI technology, which could have cascading effects on AI-centric cryptocurrencies. Further stirring the market is the buzz around OpenAI’s GPT-4oT. Moreover, Prithvir discusses the influence of major tech conferences focused on AI advancements, notably Google’s I/O conference and Apple’s emphasis on AI at its upcoming Worldwide Developers Conference (WWDC). He predicts these events are poised to introduce new AI initiatives that could impact crypto markets. Related Reading: This Crypto Expert Called The Bitcoin Top in 2021, Now He’s Calling The Bottom In 2024 In his post, Prithvir also analyzes several tokens that have responded differently to these AI catalysts. He describes WLD, associated with OpenAI through Sam Altman, which experienced a 20% drop in price last week, a typical “sell the news” reaction post the GPT-4o announcement. He expresses concerns about WLD’s “ridiculous tokenomics” and the risks posed by potential coordinated short squeezes, advising traders to approach with caution. Prithvir also touches upon OLAS, which, despite losing some visibility since its peak in 2023, remains active on the Gnosis chain and could be poised for a comeback depending on market conditions and developments within its platform, according to the analyst. The token SPEC, however, has shown significant volatility, skyrocketing from $5 to $15 and then retracting to $8 within two weeks. Prithvir critiques its high fully diluted valuation (FDV) close to $1 billion, warning of the speculative nature and the inherent risks of engaging with such a volatile asset. Related Reading: Is The Crypto Winter Thawing? US Bitcoin ETFs Record First Inflows In Weeks – Coinshares Lastly, he addresses the group of ASI tokens FET, AGIX and OCEAN, representing the Super Intelligence Alliance, noting that their once-leading positions in AI-driven market rallies have dwindled. According to Prithvir, these tokens are currently overvalued, with limited upside potential, indicating a saturated market state for these assets. Prithvir’s Top Altcoin Picks Navigating through the complexities of the AI coin market, Prithvir shares his preferred investment strategies and picks. He highlights Render (RNDR) as a favorable choice, especially leading up to NVIDIA’s earnings and Apple’s WWDC, due to its direct ties to their technologies and expected feature enhancements which might boost its value. “NVIDIA due to comparisons of GPU networks and Apple due to the rendering software they have built that Apple always features at different keynotes. Hence, I think this could be a good swing trade leading up to WWDC Time period – 3 weeks,” the analyst stated. AR is Prithvir’s “biggest AI coin holding currently.” The project is praised by him for its pivot to AI functionalities with the AO Computer and robust team. The presence of AR on Tier-1 exchanges and its substantial backing makes it a “no-brainer” for a medium-term hold. He also mentions NEAR, albeit with a smaller investment footprint due to the perceived limited upside. “Smaller position than AR due to more limited upside. But could become one of the consensus AI trades of this cycle due to its brand value, good liquidity and innovations in other sectors such as Chain Abstraction,” Prithvir wrote via X. At press time, RNDR traded at $10.1089. Featured image from Shutterstock, chart from TradingView.com","publisher":{"name":"NewsBTC","logo":"https://t1.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.newsbtc.com/&size=64"},"creation_date":"2024-05-15T12:00:03Z","categories":["crypto","ai","wld","gnosis","token","fet","agix","render","rndr","ar","near"],"article_link":"https://www.newsbtc.com/news/crypto-analyst-top-ai-altcoin-this-month/","thumbnail_image":"https://www.newsbtc.com/wp-content/uploads/2024/02/iStock-1361008748.jpg?fit=460%2C263"},{"article_title":"The big Bitcoin sell-off? Whales abandon ship as BTC halts at $62K","author":"Abiodun Oladokun","article_detailed_content":"In the last 30 days, there has been a decline in BTC’s network activity amid a hike in profit-taking activity.","article_summary":"In the last 30 days, there has been a decline in BTC’s network activity amid a hike in profit-taking activity.","publisher":{"name":"AMBCrypto","logo":"https://logo.clearbit.com/ambcrypto.com?size=96"},"creation_date":"2024-05-15T12:00:01Z","categories":["bitcoin","btc"],"article_link":"https://ambcrypto.com/the-big-bitcoin-sell-off-whales-abandon-ship-as-btc-halts-at-62k/","thumbnail_image":"https://ambcrypto.com/wp-content/uploads/2024/05/Bitcoin-7.png"},{"article_title":"Tron (TRX) Price Prediction: $140 Million Worth of Profits to Drive DemandÂ Â ","author":"Aaryamann Shrivastava","article_detailed_content":"At this point, Tron’s (TRX) price has been in an uptrend for more than three weeks, signaling a breakout above a key price level. The whales’ minimal but consistent accumulation is pushing the price up, which will boost demand in the market. Tron Whales Could Help Price Increase Tron’s price has shown signs of being influenced by the impact of whale accumulation, and the same is happening now. The whale addresses holding TRX worth more than $100,000 and under $10 million have consistently added TRX to their wallets. These addresses have accumulated over $160 million worth of TRX in the last month, bringing their total holdings close to year-to-date highs. Tron Whale Holdings. Source: IntoTheBlock Additionally, the investors are also awaiting a crucial bullish signal that would increase the demand for the asset. According to the Global In/Out of the Money (GIOM) indicator, about 1.14 billion TRX are awaiting profits. This supply was bought between $0.123 and $0.127 and is worth over $142 million. Although in comparison to Tron’s market capitalization of $11 billion, this supply is minimal, it is still gains that investors are waiting for. Read More: What Is TRON (TRX) and How Does It Work? Tron GIOM. Source: IntoTheBlock When this supply becomes profitable, it will drive the demand for TRX, which will translate to a further increase in price. TRX Price Prediction: Closer to ATH Tron’s price trading at $0.125 is close to breaching the resistance at $0.127. Breaching this resistance would not only enable further rise but also turn the aforementioned supply profitable. This would, in effect, push the price upwards towards $0.130. Flipping $0.130 in support would give Tron’s price the necessary boost to reach its all-time high of $0.144. Read More: TRON (TRX) Price Prediction 2024/2025/2030 Tron Price Analysis. Source: TradingView On the other hand, if the month-long uptrend line that Tron’s price has been above is lost, the altcoin could dip to $0.121. Losing this support level would invalidate the bullish thesis, sending TRX to $0.116. The post Tron (TRX) Price Prediction: $140 Million Worth of Profits to Drive Demand appeared first on BeInCrypto.","article_summary":"Tron's price is at the verge of flipping a crucial resistance into support, with the help of whale and retain investors. The post Tron (TRX) Price Prediction: $140 Million Worth of Profits to Drive Demand appeared first on BeInCrypto.","publisher":{"name":"Be(In)Crypto","logo":"https://t3.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://beincrypto.com/&size=64"},"creation_date":"2024-05-15T12:00:00Z","categories":["tron","trx"],"article_link":"https://beincrypto.com/tron-trx-price-prediction-profits-drive-demand/","thumbnail_image":"https://beincrypto.com/wp-content/uploads/2023/01/bic_TRON_bullish.png"},{"article_title":"War on Crypto Crime: Chinese Police Dismantle $1.9 Billion Underground Banking Ring","author":"Harsh Notariya","article_detailed_content":"On May 15, the Chengdu Public Security Bureau announced the dismantling of a vast underground banking network, arresting 193 suspects across China. These individuals were involved in illegal businesses utilizing crypto, specifically Tether (USDT). The comprehensive crackdown revealed illicit transactions totaling approximately 13.8 billion yuan (~$1.9 billion). How Chinese Authorities Crack Down on Crypto Crimes The investigation started in November 2022 when authorities detected suspicious activities involving underground banks in Chengdu’s Longquanyi District. Consequently, they formed a specialized task force, incorporating experts from various police departments. This also included economic investigation, cyber security, and legal affairs. This group provided unauthorized foreign exchange settlements, effectively bypassing national regulations. Read more: 9 Best Crypto Wallets to Store Tether (USDT) On June 1, 2023, following directives from the Ministry of Public Security, the task force executed coordinated raids across several major cities, including Shanghai and Shenzhen. These efforts led to the capture of key figures in the criminal syndicate, such as Lin, Weng, and Chen, along with 25 others. During these raids, law enforcement seized a plethora of bank cards and digital payment instruments linked to criminal activities. Further investigations uncovered that, since January 2021, the syndicate had exploited its import and export business to facilitate illegal activities. By using USDT as a medium, they circumvented official foreign exchange channels to service clients needing to transfer funds internationally. Moreover, these operations were intricately linked to other illicit activities, including financial fraud and smuggling. Zhong Yu, captain of the Eighth Brigade of the Economic Investigation Detachment at the Chengdu Municipal Public Security Bureau, highlighted the complexity of the network. “The suspect settled funds through underground banks and was suspected of engaging in illegal foreign exchange criminal activities,” Yu said. Also, on May 13, BeInCrypto reported that the Chinese government arrested six people. They are allegedly responsible for illicit crypto transactions worth $295 million. These arrests underline the challenges and risks associated with crypto in unregulated environments. Read more: Crypto Regulation: What Are the Benefits and Drawbacks? Meanwhile, the Hong Kong police recently apprehended three men at a currency exchange shop after a deceptive transaction involving Tether’s USDT. The suspects allegedly showed a customer ceremonial “hell money” before deceitfully persuading him to transfer about $128,073 worth of USDT, only to refuse the agreed-upon cash exchange afterward. “Hell banknotes are a form of ceremonial paper money that is burned as an offering to ancestors or deities in traditional Chinese culture,” SCMP explains. The post War on Crypto Crime: Chinese Police Dismantle $1.9 Billion Underground Banking Ring appeared first on BeInCrypto.","article_summary":"On May 15, the Chengdu Public Security Bureau dismantled a massive underground banking network involved in illegal crypto transactions, arresting 193 suspects across major Chinese cities. The post War on Crypto Crime: Chinese Police Dismantle $1.9 Billion Underground Banking Ring appeared first on BeInCrypto.","publisher":{"name":"Be(In)Crypto","logo":"https://t3.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://beincrypto.com/&size=64"},"creation_date":"2024-05-15T11:57:06Z","categories":["crypto","tether","usdt"],"article_link":"https://beincrypto.com/chinese-authorities-illegal-crypto-ring/","thumbnail_image":"https://beincrypto.com/wp-content/uploads/2023/03/bic_arrest_prison_negative_4.png"},{"article_title":"Bitcoin (BTC) Predicted to Soar to $420,000, Says Founder of $291 Billion Asset Manager","author":"Lucien Renard","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Renowned asset manager and founder of the Digital Assets Council of Financial Professionals, Ric Edelman, has made a bold prediction for Bitcoin’s future. In a recent interview with Yahoo Finance’s “Wealth,” Edelman forecasted that Bitcoin could reach a staggering $420,000. “The […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Renowned asset manager and founder of the Digital Assets Council of Financial Professionals, Ric Edelman, has made a bold prediction for Bitcoin’s future. In a recent interview with Yahoo Finance’s “Wealth,” Edelman forecasted that Bitcoin could reach a staggering $420,000. “The […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T11:56:09Z","categories":["bitcoin","btc","pepe"],"article_link":"https://en.coinotag.com/bitcoin-btc-predicted-to-soar-to-420000-says-founder-of-291-billion-asset-manager/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-14.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Crucial Decision Coming for Bitcoin, Says Crypto Trader MichaÃ«l van de Poppe – Here’s His Outlook","author":"thebittimes@thebitfinance.com (TheBitTimes.Com)","article_detailed_content":"A widely followed crypto strategist and trader says that it’s almost time for Bitcoin (BTC) to reveal its hand. Analyst MichaÃ«l van de Poppe tells his 718,100 followers on the social media platform X that Bitcoin is at a point where it either attacks a new all-time high or sees another big sell-off event. According to the trader, Bitcoin must hold its immediate support at $60,500 to have a shot at igniting a big burst to the upside. Otherwise, he predicts BTC heading close to $50,000. “Crucial decision is approaching for Bitcoin. The range low at $60,500-$61,000 is still holding up for Bitcoin, through which breaking $63,000 is the next barrier for a new run toward the all-time high. If $60,500 is lost, I think we’ll see $52,000-$55,000 as the next support zone.” Source: MichaÃ«l van de Poppe/X At time of writing, Bitcoin is worth $61,514, down nearly 2% in the last 24 hours. The analyst is also keeping a close watch on the TOTAL2 chart, which traders use to track the altcoin markets as it measures the total market cap of crypto excluding Bitcoin and stablecoins. Van de Poppe says TOTAL2 may be a couple of weeks away from kicking off a new uptrend. “One to two weeks of some more consolidation and we’re ready to reverse back upwards on the altcoin market capitalization.” Source: MichaÃ«l van de Poppe/X Based on the trader’s chart, he seems to suggest that TOTAL2 is in the process of carving a bottom after holding support at $900 billion. At time of writing, TOTAL2 is trading at $970 billion. Van de Poppe notes that traders are bearish on altcoins but the charts suggest they may be close to witnessing a trend reversal. “Many altcoins are making double bottoms, where the likelihood of a rally has substantially increased. On the contrary, the sentiment is at a cycle low as people expect further downward momentum to be happening. Things can change quickly.” Source: https://thebittimes.com/crucial-decision-coming-for-bitcoin-says-crypto-trader-micha-l-van-de-poppe-here-s-his-outlook-tbt88389.html","article_summary":"A widely followed crypto strategist and trader says that it’s almost time for Bitcoin (BTC) to reveal its hand.Analyst MichaÃ«l van de Poppe tells his 718,100 followers on the social media platform X that Bitcoin is at a point...","publisher":{"name":"The Bit Times","logo":"https://logo.clearbit.com/thebittimes.com?size=96"},"creation_date":"2024-05-15T11:54:23Z","categories":["bitcoin","crypto","btc"],"article_link":"https://thebittimes.com/crucial-decision-coming-for-bitcoin-says-crypto-trader-micha-l-van-de-poppe-here-s-his-outlook-tbt88389.html","thumbnail_image":"https://cdn.thebittimes.com/vimedia/w800/2024/05/15/ced91944989acddd5e40e67d37a3d589.webp"},{"article_title":"Bitcoin ‘danger zone’ is ‘officially over,’ What’s next for BTC?","author":"thebittimes@thebitfinance.com (TheBitTimes.Com)","article_detailed_content":"Bitcoin (BTC) has navigated through its post-halving ‘danger zone,’ a period marked by heightened volatility and price corrections. Prominent crypto analyst Rekt Capital highlighted in an X (formerly Twitter) post that Bitcoin has now emerged from this challenging phase. According to Rekt Capital‘s Analysis, which considers historical data and recent market trends, Bitcoin is entering a reaccumulation phase. This transition suggests a potential upward trajectory in its market value and marks a significant phase in the cryptocurrency‘s cycle, indicating a shift towards growth and stabilization. Picks for you We asked ChatGPT-4o what will be Silver price at the end of 2024; Here’s what it said 30 mins ago Crypto in peril as court ruling sets a dangerous precedent 1 hour ago Colony Lab launches a “Liquid Vesting” platform to democratize early-stage crypto investments 2 hours ago We asked ChatGPT-4o what will be XRP price at the end of 2024; Here’s what it said 3 hours ago Post halving accumulation phase. Source: RektCapital/X Following the recent Bitcoin halving event, the cryptocurrency experienced a significant price drop, declining 23% from its mid-March high of $65,000 to a low of $56,800 on May 1. This period, known as the ‘danger zone,’ typically sees Bitcoin retreat in price as the market adjusts to the halved block rewards. Rekt Capital noted that Bitcoin has rebounded from these lows, indicating that the asset has moved into a reaccumulation phase. He emphasized that Bitcoin had bounced back strongly from the low support levels of its reaccumulation range, suggesting the potential bottom of this period was reached on May 1. Historical data supports this view, showing that Bitcoin typically experiences a decline around halving events. If $56,000 wasn’t the bottom, this year’s pullback at 63 days would match the longest in the cycle. However, Rekt Capital believes that the pullback concluded at $56,000 after 47 days. Bullish signals and global economic factors Adding to the positive outlook, prominent crypto analyst Ali Martinez highlighted a recent buy signal from the TD Sequential indicator on Bitcoin’s hourly chart, suggesting an impending upswing. The TD Sequential presents a buy signal on the #Bitcoin hourly chart, anticipating a price rebound! pic.twitter.com/BwSwXn2mgU — Ali (@ali_charts) May 14, 2024 The broader economic landscape also plays a crucial role in shaping Bitcoin’s trajectory. A major focus this week will be on the April Consumer Price Index (CPI), set to be released today. Forecasts indicate a CPI of 3.4% and a core CPI of 3.6%, both figures well above the Federal Reserve’s (Fed) target of 2%. This persistent high inflation suggests that interest rates might remain elevated longer than previously expected, potentially impacting investor sentiment and financial markets. Additionally, Raoul Pal, a renowned macro guru and CEO of Real Vision has identified the upcoming months as potentially advantageous for cryptocurrencies, describing a ‘banana zone‘—a period of enhanced global liquidity that historically correlates with strong performance in high-risk assets like Bitcoin. This could mean that external economic conditions may align to further fuel Bitcoin’s ascent in the latter half of the year. What’s next for BTC ? BTC 7 day price chart. Source: Finbold At press time, Bitcoin is trading at $62,709, with a one-day change of 1.8%. As Bitcoin exits the danger zone and indicators turn bullish, the market appears to be entering a phase of cautious optimism. The combination of technical indicators and macroeconomic factors suggests that Bitcoin could be gearing up for a significant rally in the latter part of the year. However, investors are advised to keep an eye on global economic trends and market signals to gauge the potential impact on cryptocurrency prices. Disclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk. Source: https://thebittimes.com/bitcoin-danger-zone-is-officially-over-what-s-next-for-btc-tbt88388.html","article_summary":"Bitcoin (BTC) has navigated through its post-halving ‘danger zone,’ a period marked by heightened volatility and price corrections. Prominent crypto analyst Rekt Capital highlighted in an X (formerly Twitter) post that...","publisher":{"name":"The Bit Times","logo":"https://logo.clearbit.com/thebittimes.com?size=96"},"creation_date":"2024-05-15T11:54:16Z","categories":["bitcoin","btc","crypto","xrp","cryptocurrency","core","optimism"],"article_link":"https://thebittimes.com/bitcoin-danger-zone-is-officially-over-what-s-next-for-btc-tbt88388.html","thumbnail_image":"https://cdn.thebittimes.com/vimedia/w800/2024/05/15/e0cee6e65794163d2f5085c71acd212d.webp"},{"article_title":"Billionaire Reveals Next Big Move for Bitcoin (BTC) and Two Altcoins: Expert Crypto Analysis","author":"Crypto Vira","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Galaxy Digital Holdings CEO, Michael Novogratz, predicts a period of consolidation for the cryptocurrency market, with Bitcoin likely to trade within a specific range in the foreseeable future. This prediction comes after a strong first quarter for the company, bolstered by […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Galaxy Digital Holdings CEO, Michael Novogratz, predicts a period of consolidation for the cryptocurrency market, with Bitcoin likely to trade within a specific range in the foreseeable future. This prediction comes after a strong first quarter for the company, bolstered by […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T11:53:40Z","categories":["bitcoin","btc","crypto","pepe","cryptocurrency"],"article_link":"https://en.coinotag.com/billionaire-reveals-next-big-move-for-bitcoin-btc-and-two-altcoins-expert-crypto-analysis/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-17.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Bitcoin (BTC) Technical Indicators Point Upwards, But Keep an Eye on Macro Data!","author":"Jocelyn Blake","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! According to crypto analysts, certain technical indicators in Bitcoin suggest that the price is ready to move upwards. Crypto analyst Jelle shares that the Moving Average Convergence/Divergence (MACD) indicator is giving a positive signal for Bitcoin. However, macroeconomic data to be […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! According to crypto analysts, certain technical indicators in Bitcoin suggest that the price is ready to move upwards. Crypto analyst Jelle shares that the Moving Average Convergence/Divergence (MACD) indicator is giving a positive signal for Bitcoin. However, macroeconomic data to be […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T11:52:11Z","categories":["bitcoin","btc","pepe","crypto"],"article_link":"https://en.coinotag.com/bitcoin-btc-technical-indicators-point-upwards-but-keep-an-eye-on-macro-data/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-3.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"OKX’s Ethereum Layer -2 Network: A Gamechanger","author":"The Crypto Times Team","article_detailed_content":"As Ethereum continues to face scalability challenges, with high gas fees hindering its mainstream adoption and congesting its network, the need for Layer-2 solutions has become more pressing. In that regard, OKX, a prominent crypto exchange, launched the public mainnet of X layer, its Zero knowledge proof powered network. As per the experts at Bitcoin Decode, the Layer 2 network was built using Polygon’s chain development kit (CDK) that enables shared state and liquidity across multiple blockchain networks using the Ether scaling protocols Aggregation Layer. The experts say that this move addresses Ether’s scalability issues while offering users a more cost-effective and efficient alternative for conducting transactions and interacting with decentralized applications (dApps). The Key Features of OKX’s Layer-2 Network At the core of OKX’s Layer-2 solution is the promise of significantly lower fees and faster transaction processing times compared to Ether’s mainnet. By leveraging Layer-2 technology, OKX aims to reduce the congestion on Ether’s network, thereby minimizing gas fees and enhancing overall transaction. Users can now transfer tokens and execute smart contracts with incredible speed and efficiency while enjoying a more cost-effective experience. A recent report revealed that X Layer provides faster, cheaper transaction capabilities when interacting with on-chain applications. According to Haider Rafique, chief marketing officer from OKX, the ‘X layer’ and other layer-2 networks are set to become integral infrastructure for an interconnected Web3 ecosystem. “We are building a seamless and interoperable ecosystem. We think X Layer has limitless potential thanks to our community and its connectivity with another Ethereum-based network,” said Rafique. Furthermore, OKX’s Layer-2 network is designed to support a wide range of ERC-20 tokens and decentralized finance (DeFi) protocols, providing users with seamless interoperability across various Ether-based applications. This interoperability is crucial for fostering innovation within the Ether ecosystem, as it enables developers to build scalable dApps and deploy innovative solutions without being burdened by high fees and slow transaction speeds. Unlocking New Possibilities: The Impact of OKX’s Layer-2 Solution on DeFi and Beyond The introduction of OKX’s EtherLayer-2 network holds significant implications for the broader DeFi landscape and the cryptocurrency industry as a whole. With lower fees and faster transaction times, DeFi platforms built on OKX’s Layer-2 solution can offer users a more seamless and cost-efficient experience, ultimately driving greater adoption and liquidity within the DeFi space. OKX users can transfer assets, deposit and withdraw cryptocurrencies on OKX and access nearly 200 DApps offering token swaps, staking and smart contract functionality. Polygon CEO Marc Boiron highlighted that the move creates an interconnected liquidity network across blockchain protocols. Boiron said, “X Layer’s connection to the AggLayer solves the fragmentation of liquid and users across chains on the AggLayer so they can all grow together. OKX’s 50 million users now have an easy path to onboarding to X Layer and all the other chains connected to the AggLayer.” Moreover, OKX’s Layer-2 network has the potential to catalyse innovation across various sectors beyond DeFi, including gaming, non-fungible tokens (NFTs) and decentralised exchanges (DEXs). By providing developers with a scalable and cost-effective infrastructure for building decentralised applications, OKX’s Layer-2 solution opens the door to new use cases and opportunities previously hindered by Ether’s scalability limitations.VanEck, an investment management firm, suggested that by 2030, Ether layer-2 networks could exceed $1 trillion in market capitalisation. Additionally, the networks have become integral to helping Ether achieve scale, powering low-fee, secure and decentralised transactions and applications. Conclusion OKX’s Ethereum Layer-2 network represents a significant step forward in addressing Ethereum’s scalability challenges while unlocking new possibilities for decentralised finance and beyond. With lower fees, faster transactions, and enhanced interoperability, OKX’s Layer-2 solution can reshape the Ethereum ecosystem’s future and accelerate the mainstream adoption of blockchain technology.","article_summary":"As Ethereum continues to face scalability challenges, with high gas fees hindering its mainstream adoption and congesting its network, the need for Layer-2 solutions has become more pressing. In that regard, OKX, a prominent crypto exchange, launched the public mainnet of X layer, its Zero knowledge proof powered network. As per the experts at Bitcoin […]","publisher":{"name":"Crypto Times","logo":"https://logo.clearbit.com/www.cryptotimes.io?size=96"},"creation_date":"2024-05-15T11:51:40Z","categories":["ethereum","crypto","bitcoin","blockchain","core","web3","defi","cryptocurrency","token","polygon"],"article_link":"https://www.cryptotimes.io/2024/05/15/okx-ethereum-layer-2-network/","thumbnail_image":"https://www.cryptotimes.io/wp-content/uploads/2024/05/OKXs-Ethereum-Layer-2-Network-A-Gamechanger-1024x576.jpg"},{"article_title":"Interactive Brokers now allows UK clients to trade crypto","author":"Wahid Pessarlay","article_detailed_content":"The British arm of Interactive Brokers, known as Interactive Brokers U.K. Limited (IBUK), has launched cryptocurrency trading for its clients. According to a press release on Businesswire, IBUK’s investors and financial advisors can start trading Bitcoin (BTC), Ethereum (ETH), Litecoin…","article_summary":"The British arm of Interactive Brokers, known as Interactive Brokers U.K. Limited (IBUK), has launched cryptocurrency trading for its clients. According to a press release on Businesswire, IBUK’s investors and financial advisors can start trading Bitcoin (BTC), Ethereum (ETH), Litecoin…","publisher":{"name":"Crypto.news","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://crypto.news/&size=64"},"creation_date":"2024-05-15T11:50:30Z","categories":["crypto","cryptocurrency","bitcoin","btc","ethereum","eth"],"article_link":"https://crypto.news/interactive-brokers-now-allows-uk-clients-to-trade-crypto/","thumbnail_image":"https://crypto.news/app/uploads/2023/09/crypto-news-United-Kingdom-trying-to-safeguard-against-improper-use-of-AI03.png"},{"article_title":"UK FCA Targets Trio in Crypto Scam: CFD Trading Pension Fraud Involving Bitcoin (BTC)","author":"Marisol Navaro","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! UK FCA Charges Three Individuals in CFD Trading Pension Fraud The UK Financial Conduct Authority (FCA) has filed a lawsuit against three individuals for their alleged involvement in a high-risk trading scheme, which targeted people’s pension savings. The total known loss […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! UK FCA Charges Three Individuals in CFD Trading Pension Fraud The UK Financial Conduct Authority (FCA) has filed a lawsuit against three individuals for their alleged involvement in a high-risk trading scheme, which targeted people’s pension savings. The total known loss […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T11:49:08Z","categories":["crypto","bitcoin","btc","pepe"],"article_link":"https://en.coinotag.com/uk-fca-targets-trio-in-crypto-scam-cfd-trading-pension-fraud-involving-bitcoin-btc/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-12.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Ex-BlackRock Bitcoin ETF Lead Appointed New Vanguard CEO","author":"Vivek Sen","article_detailed_content":"Vanguard, one of the world's largest investment firms, has named a new CEO: Salim Ramji, who previously led BlackRock's ETF business and helped launch its spot bitcoin ETF, IBIT in January. JUST IN: Vanguard appoints Salim Ramji as a new CEO, a former Blackrock’s #Bitcoin ETF lead. Earlier, Vanguard refused to offer BTC ETF ðŸ‘€ pic.twitter.com/KEq7KeJ3q7 — Bitcoin Magazine (@BitcoinMagazine) May 15, 2024 Ramji will replace Vanguard's outgoing CEO, Tim Buckley. Buckley has been publicly critical of Bitcoin and opposed offering Bitcoin ETF products to clients. Under Buckley's leadership, Vanguard refused to provide its brokerage customers access to U.S. spot bitcoin ETFs that were approved by the SEC. The appointment of Ramji, set to take effect July 8, signals a potential change in Vanguard's stance. As head of BlackRock's iShares division, Ramji oversaw the launch of the iShares Bitcoin Trust ETF. Ramji has spoken positively about the technology underpinning Bitcoin and its potential to remove friction in financial markets. His experience pioneering Bitcoin ETFs at BlackRock has many wondering if he will now push for similar offerings at Vanguard. Click the image to learn more. According to Bloomberg ETF analyst Eric Balchunas, bringing in the bitcoin-friendly Ramji means the door is \"much more open now\" for Vanguard to embrace Bitcoin. The company offers index funds and ETFs to both retail and institutional investors. As a massive player in the ETF space with over $7 trillion in global AUM, Vanguard launching a spot bitcoin ETF would be an important milestone for further mainstream adoption.","article_summary":"Vanguard names former BlackRock crypto ETF lead as new CEO, sparking speculation of a pivot towards embracing bitcoin products after years of opposition.","publisher":{"name":"Bitcoin Magazine","logo":"https://t3.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://bitcoinmagazine.com/&size=64"},"creation_date":"2024-05-15T11:48:52Z","categories":["bitcoin","btc"],"article_link":"https://bitcoinmagazine.com/business/ex-blackrock-bitcoin-etf-lead-appointed-new-vanguard-ceo","thumbnail_image":"https://bitcoinmagazine.com/.image/c_fit%2Ch_800%2Cw_1200/MTc5Mjk3ODU2NDEwNjkxMjY3/wall-street-blockchain-alliance-launches-educational-platform-for-financial-markets.jpg"},{"article_title":"$BLP Pre-Sale on Blast Blockchain: Surpassing $10 Million and Outperforming $ETH and $OP?","author":"Gideon Wolf","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Will $BLP Pre-Sale on Blast Blockchain Reach $10 Million? Launchpad Token Shows Bigger Potential than $ETH and $OP The pre-sale of BlastUP, the first launchpad on the billion-dollar rollup Blast, is nearing $6 million with 18 days left to buy $BLP. […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Will $BLP Pre-Sale on Blast Blockchain Reach $10 Million? Launchpad Token Shows Bigger Potential than $ETH and $OP The pre-sale of BlastUP, the first launchpad on the billion-dollar rollup Blast, is nearing $6 million with 18 days left to buy $BLP. […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T11:46:40Z","categories":["blockchain","eth","op","pepe","token"],"article_link":"https://en.coinotag.com/blp-pre-sale-on-blast-blockchain-surpassing-10-million-and-outperforming-eth-and-op/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-19.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"XRP Skyrockets 194% Amid Ripple CEO’s Tether Comments & Arrival of Key SEC Date: Ripple (XRP) Now Backed by South Korean Validator","author":"Lucien Renard","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Ripple CEO Brad Garlinghouse clarifies his comments on Tether, emphasizing the importance of stablecoins in the crypto ecosystem. XRP sees a significant surge in trading volume, coinciding with a key date in the ongoing Ripple v. SEC case. South Korean virtual […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Ripple CEO Brad Garlinghouse clarifies his comments on Tether, emphasizing the importance of stablecoins in the crypto ecosystem. XRP sees a significant surge in trading volume, coinciding with a key date in the ongoing Ripple v. SEC case. South Korean virtual […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T11:45:56Z","categories":["xrp","tether","pepe","crypto"],"article_link":"https://en.coinotag.com/xrp-skyrockets-194-amid-ripple-ceos-tether-comments-arrival-of-key-sec-date-ripple-xrp-now-backed-by-south-korean-validator/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies30.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Solana Developer Admits to Misusing Cypher Funds","author":"Ezra Kaimenyi","article_detailed_content":"A core developer of Cypher, a decentralized exchange on the Solana blockchain, admitted to misusing over $300 million designated for compensating hack victims. The developer, known as “Hoak,” publicly confessed on the social platform X to gambling away the funds. My statement on the situation. TLDR: I fucked up way too hard, way too many times. I don’t expect anyone to forgive me or let this go unpunished.https://t.co/CNq8UFKCkc — hoak (@hoakbuilds) May 14, 2024 This confession follows accusations from another core contributor, “Cobra,” who exposed the misappropriation, which had reportedly been occurring for several months. The incident follows a significant breach in August 2023, when hackers exploited a vulnerability in Cypher’s protocol, draining $1 million in cryptocurrencies. The attack exploited weaknesses in smart contracts, enabling the removal of bad loans and resulting in significant financial losses for the platform. The developer Cobra expressed disappointment, highlighting Hoak’s betrayal. Hoak had remained with the project to aid in its recovery post-hack. The statement underscored the breach of trust and integrity within the development team, raising concerns about the security measures in place. In response to the fraud, Cobra announced intentions to pursue legal actions against Hoak, seeking accountability for the financial misconduct. This internal fraud underscores the challenges facing blockchain security and the critical need for robust oversight within cryptocurrency platforms. Also read: North Korean Crypto Hacks Total $3.6 Billion, UN Reports.","article_summary":"Cypher's Cobra will pursue legal action against Hoak for misusing $300M of public funds.","publisher":{"name":"Crypto Times","logo":"https://logo.clearbit.com/www.cryptotimes.io?size=96"},"creation_date":"2024-05-15T11:44:44Z","categories":["solana","core","blockchain","cryptocurrency","crypto"],"article_link":"https://www.cryptotimes.io/2024/05/15/solana-developer-admits-to-misusing-cypher-funds/","thumbnail_image":"https://www.cryptotimes.io/wp-content/uploads/2024/05/Solana_DEX_Developer_Admits_To_Stealing_And_Gambling_Away_300M_Meant_For_Hack_Victims-1024x576.jpg"},{"article_title":"PEPE Coin (PEPE) Skyrockets to New All-Time High, Nearing $5 Billion Market Cap in Crypto Market","author":"Gideon Wolf","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Pepe (PEPE), a popular meme coin, has recently reached an all-time high, with a market capitalization nearing $5 billion. Despite the inherent risks associated with its volatility, PEPE has gained significant support from influential figures in the cryptocurrency industry and major […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Pepe (PEPE), a popular meme coin, has recently reached an all-time high, with a market capitalization nearing $5 billion. Despite the inherent risks associated with its volatility, PEPE has gained significant support from influential figures in the cryptocurrency industry and major […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T11:43:35Z","categories":["pepe","crypto","cryptocurrency"],"article_link":"https://en.coinotag.com/pepe-coin-pepe-skyrockets-to-new-all-time-high-nearing-5-billion-market-cap-in-crypto-market/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies30.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Tornado Cash developer receives 5-Year sentence for facilitating money laundering","author":"Emman Omwanda","article_detailed_content":"A Dutch court has just ruled in the case of Alexey Pertsev, a co-developer of Tornado Cash cryptocurrency mixing platform. Pertsev has been given a sentence of 64 months in jail for his role in the creation and maintenance of the platform, which the court says has been used to conduct crimes and terrorism by hiding the origin, destination, and ownership of the crypto transactions, Court ruling on Tornado Cash Developer case The firm, created by Pertsev and two others, was meant to offer community privacy solutions. Nevertheless, the investigations proved that it was involved in the laundering of roughly $1 billion. The $2 billion amount of Ethereum went through various thefts and hacks. Pertsev’s assertion that Tornado Cash was not made for illegal purposes was insufficient to dismiss the court’s findings that there was proof of this. The court ruled Pertsev responsible for the development and the absence of measures to prevent abuse of Tornado Cash. It declared that the service was created, knowing the possibility of its misuse. To name a few, the North Korean hacking group Lazarus stole about $450 million worth of cryptocurrency. They sent it through Tornado Cash, thus showing that this service is very important for the criminal underworld. Tornado Cash dev ruled liable for all illicit use, despite no ability to prevent it ‼ï¸ We'll break down both the ruling itself and the craziness of the precedent set here by the case against Alex Pertsev, a developer and co-founder of the @TornadoCash project ðŸ§µ pic.twitter.com/wRycZZGiBk — Freedom.Tech (@freedomtech) May 14, 2024 Defense and industry response In his defense, Pertsev’s team stressed the decentralized, open-source nature of Tornado Cash’s smart contracts and stated that blaming Pertsev for the users’ independent and anonymous actions was unreasonable. The court convicted him of money laundering, which reflected the problems of software developers in the decentralized finance (DeFi) sector. This conclusion was made after another case in the US, which involved another Tornado Cash co-founder, Roman Storm, who was arrested on charges of helping criminals launder over a billion dollars in illicit funds. Roman Semenov is being tried for money laundering and is still a fugitive. The US authorities’ position demonstrates that the developers could be responsible for the misuse of their software, even if they were not directly involved.","article_summary":"A Dutch court has just ruled in the case of Alexey Pertsev, a co-developer of Tornado Cash cryptocurrency mixing platform. Pertsev has been given a sentence of 64 months in jail for his role in the creation and maintenance of the platform, which the court says has been used to conduct crimes and terrorism by […]","publisher":{"name":"Cryptopolitan","logo":"https://t0.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.cryptopolitan.com/&size=64"},"creation_date":"2024-05-15T11:42:41Z","categories":["cryptocurrency","crypto","ethereum","defi"],"article_link":"https://www.cryptopolitan.com/tornado-cash-developer-receive-year-sentence/","thumbnail_image":"https://www.cryptopolitan.com/wp-content/uploads/2024/05/Default_Crypto_Company_Receives_5Year_Sentence_for_Money_Laund_1.jpg"},{"article_title":"Tensor Teams Up With NFT Game Backwoods To Launch An NFT Collection On Solana","author":"thebittimes@thebitfinance.com (TheBitTimes.Com)","article_detailed_content":"Tensor, one of the leading non-fungible token market platforms on the Solana NFT ecosystem, has partnered with Backwoods, a blockchain-based game, as an official launchpad partner. To mark this integration, the two firms have launched a new non-fungible token collection on Solana. Tensor X Backwoods Integration In a May 15 blog post, Tensor confirmed partnering with Backwoods as its official launchpad partner. Under the new integration, Tensor and Backwoods have launched a new non-fungible token collection. The Solana blockchain network will power the new NFT collection, which will start minting on May 16, 2024. ðŸƒ @TheBackwoodsSol Mint! ðŸƒ ðŸ—“ï¸ 16th May â° 1PM EST // 5PM UTC ðŸª™ $225 in SOL ðŸƒ 6,666 Total Supply Here's the ALPHA ðŸ‘‡ pic.twitter.com/ncAct08K8v — Tensor âš¡ï¸ (@tensor_hq) May 14, 2024 Launched in July 2022, Tensor is a non-fungible token marketplace and aggregator designed for professional traders to buy, sell, and trade digital collectibles on the Solana blockchain network. The NFT market platform lists NFTs from ten marketplaces, including Magic Eden, Hadeswap, Elixir, and more. Tensor is also the team behind Tensorians, a non-fungible token collection featuring a limited set of 10,000 NFTs hosted on the Solana blockchain network. Launched in August 2023, the Tensorians NFT Collection has gained mainstream adoption and become one of the leading NFT collections on the Solana NFT ecosystem. On the other hand, Backwoods is an exhilarating roguelite slash ’em up and shoot ’em up game meticulously crafted on Solana. The blockchain-based shooting game allows all non-fungible token holders to have an added advantage over other players. Tensor X Backwoods NFT Collection Overview Under the new integration, Tensors and Backwoods anticipate leveraging their capabilities and prowess to create a strong and scalable NFT launchpad. By description, a launchpad is a crypto platform that empowers NFT creators to secure early-stage investments for their crypto projects. Essentially, a non-fungible token launchpad serves as a crowd-funding hub for investing in pre-market NFT projects. It also enables creators to broaden their reach and tokenize their assets, making them available for purchase by investors. Moreover, a launchpad facilitates the minting and storage of NFTs. Backwoods and Tensor have also launched a new non-fungible token collection featuring a fixed set of 6,666 Heroes NFTs hosted on Solana. The new Hero NFT collection will bring a unique in-game experience over non-NFT players. The NFT collection will give holders unique skills and abilities, free VITs to redeem in-game rewards and future ecosystem perks and rewards. The new Heroes NFT collection includes both in-game characters and well-crafted pixel art PFP. Their rarities are determined by race, and each has unique skills and abilities. The Backwoods NFTs will mint in three phases, including the Whitelisted, Tensorians, and Public. Related NFT News: Gary Vee’s NFT Firm, VeeFriends, Launches A Presale For Its Character Cap Collection Ethereum NFT Sales Jump 75% Today, After Another Punk Sold For Nearly $1M NFTs Are Down In Sales, But Alive And Healthy – Here’s The 10 Top Selling NFTs This Week Source: https://thebittimes.com/tensor-teams-up-with-nft-game-backwoods-to-launch-an-nft-collection-on-solana-tbt88387.html","article_summary":"Tensor, one of the leading non-fungible token market platforms on the Solana NFT ecosystem, has partnered with Backwoods, a blockchain-based game, as an official launchpad partner. To mark this integration, the two firms have launched...","publisher":{"name":"The Bit Times","logo":"https://logo.clearbit.com/thebittimes.com?size=96"},"creation_date":"2024-05-15T11:42:20Z","categories":["nft","solana","token","blockchain","sol","crypto","ethereum"],"article_link":"https://thebittimes.com/tensor-teams-up-with-nft-game-backwoods-to-launch-an-nft-collection-on-solana-tbt88387.html","thumbnail_image":"https://cdn.thebittimes.com/vimedia/w800/2024/05/15/533ec614e62d2cb442811ddb3b6a00f3.webp"},{"article_title":"Floki Inu (FLOKI) Dominates as Top Meme Coin in the Explosive Kitty Rally","author":"Merritt Vale","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Floki Inu Soars Amid Meme Coin Frenzy The cryptocurrency market has seen a surge in meme coin interest, with Floki Inu leading the pack with a 17% increase in the last 24 hours. This surge coincides with the return of notorious […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Floki Inu Soars Amid Meme Coin Frenzy The cryptocurrency market has seen a surge in meme coin interest, with Floki Inu leading the pack with a 17% increase in the last 24 hours. This surge coincides with the return of notorious […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T11:40:28Z","categories":["floki","pepe","cryptocurrency"],"article_link":"https://en.coinotag.com/floki-inu-floki-dominates-as-top-meme-coin-in-the-explosive-kitty-rally/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-16.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Binance Exchange Delists Three Altcoins: Major Shake-Up in Spot Trading for BTC, ETH, and BNB!","author":"Jocelyn Blake","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Binance, the world’s leading cryptocurrency exchange, has announced the delisting of certain spot trading pairs to protect users and maintain the integrity of the trading environment. The delisting is due to factors such as low liquidity and trading volume. Despite the […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Binance, the world’s leading cryptocurrency exchange, has announced the delisting of certain spot trading pairs to protect users and maintain the integrity of the trading environment. The delisting is due to factors such as low liquidity and trading volume. Despite the […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T11:38:30Z","categories":["btc","eth","bnb","pepe","cryptocurrency"],"article_link":"https://en.coinotag.com/binance-exchange-delists-three-altcoins-major-shake-up-in-spot-trading-for-btc-eth-and-bnb/","thumbnail_image":""},{"article_title":"Accelerated XRPL Development Activity: What Does it Mean for XRP’s Future?","author":"Gideon Wolf","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Retail holders are increasing XRP holdings, contradicting the actions taken by the larger counterparts. The increase in development activity had little to no effect on XRP’s price. A good buying opportunity might have presented itself, on-chain data revealed. Despite increased development […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Retail holders are increasing XRP holdings, contradicting the actions taken by the larger counterparts. The increase in development activity had little to no effect on XRP’s price. A good buying opportunity might have presented itself, on-chain data revealed. Despite increased development […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T11:37:24Z","categories":["pepe","xrp"],"article_link":"https://en.coinotag.com/accelerated-xrpl-development-activity-what-does-it-mean-for-xrps-future/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies37.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Another OpenAI Exec, Jan Leike Quits","author":"Ibiam Wayas","article_detailed_content":"Two major executives of OpenAI have now resigned from the company just days after the unveiling of GPT-4o, the firm’s latest flagship and more “emotive” model. OpenAI’s Superalignment Team Co-lead Leaves Jan Leike, who co-leads the Superalignment team at OpenAI, posted on X Wednesday, “I resigned.” I resigned — Jan Leike (@janleike) May 15, 2024 Leike has yet to provide any further detail about his decision. However, his post came hours after Ilya Sutskever, the co-founder of OpenAI, announced he was leaving the company and would pursue a “project that is very personally meaningful to me.” Prior to quitting OpenAI, Sutskever had gone silent since December 2023. With his first post since the break being a resignation notice, some people seemed concerned, given Sutskever’s position in the company. Both Leike and Sutskever co-led the Superalignment team at OpenAI. The unit was formed to prevent superintelligent AI models from going rogue. Also read: OpenAI Launches ‘Superalignment’ Team Earlier this month, Sam Altman, the co-founder and CEO of OpenAI, confirmed that the company had plans to make one such supermodel, popularly referred to as artificial general intelligence (AGI). An AGI can perform tasks as humans and possibly beyond. “Whether we burn $500 million a year or $5 billion—or $50 billion a year—I don’t care, I genuinely don’t,” Altman told students at Stanford University. “As long as we can figure out a way to pay the bills, we’re making AGI. It’s going to be expensive.” Sutskever Says He’s Confident OpenAI Will Build Safe AGI There have been varying opinions on the outcome of AGI. OpenAI said it can “elevate humanity.” However, many argue that the substantial progress in AGI could possibly result in human extinction. Consequently, many people are concerned with how companies like OpenAI are building AGI. Sutskever, however, affirmed that OpenAI will build AGI that is safe. “I’m confident that OpenAI will build AGI that is both safe and beneficial under the leadership of” Sam Altman, Greg Brockman, Mira Murati, and Jakub Pachocki. Jakub Pachocki will replace Sutskever as the New Chief Scientist at OpenAI. Pachocki previously worked as the Director of Research.","article_summary":"Two major executives of OpenAI have now resigned from the company just days after the unveiling of GPT-4o, the firm’s latest flagship and more “emotive” model. OpenAI’s Superalignment Team Co-lead Leaves Jan Leike, who co-leads the Superalignment team at OpenAI, posted on X Wednesday, “I resigned.” Leike has yet to provide any further detail about […]","publisher":{"name":"Cryptopolitan","logo":"https://t0.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.cryptopolitan.com/&size=64"},"creation_date":"2024-05-15T11:37:05Z","categories":["ai"],"article_link":"https://www.cryptopolitan.com/another-openai-exec-jan-leike-quits/","thumbnail_image":"https://www.cryptopolitan.com/wp-content/uploads/2024/05/image-2024-05-15T123520.241.jpg"},{"article_title":"The Core Pillars of the XERA Pro Universe","author":"Advertorial","article_detailed_content":"Innovation and progress are constant companions of the blockchain world. As the industry continues to evolve, new projects emerge with the potential to reshape the digital landscape and revolutionize the way we interact with technology. Within the expansive ecosystem of Xera, a community dedicated to empowering individuals and driving meaningful change, several projects stand out for their promise and potential. In this article, we’ll explore three of these projects, each offering unique solutions and opportunities for growth. From decentralized finance to digital identity and beyond, these projects represent the cutting edge of innovation and promise a brighter, more democratized future for all. Redefining Decentralized Finance At the forefront of decentralized finance (DeFi) stands a groundbreaking blockchain project driven by XERA Pro with a vision to transform the economic landscape. This hardware and software solutions provider offers a wide range of applications, including smartphones, servers, laptops, and tokenization platforms. With its innovative features and robust infrastructure, it provides users with unparalleled flexibility and versatility in managing their digital assets and engaging in web3 transactions. Moreover, as a fully regulated organization with 15 licenses, the project ensures compliance, thereby instilling confidence in users and stakeholders alike. Streamlining Cross-Border Transactions Beyond DeFi, XERA Pro is also enabling cross-border transactions though a revolutionary banking project that offers instant local IBAN creation in multiple countries. Whether transacting in GBP, EUR, or both, this project provides users with seamless payment solutions tailored to their individual needs and preferences. By simplifying the complexities of international payments, this platform enhances accessibility and efficiency in the global marketplace, facilitating smoother transactions and fostering economic growth and prosperity. With its user-friendly interface and innovative features, this project is poised to become a leading player in the field of digital payments. Empowering Crypto Traders with Advanced Tools and Insights For cryptocurrency traders seeking to stay ahead of the curve, XERA Pro is supporting the development of an AI crypto trading platform that offers a comprehensive suite of tools and insights designed to empower traders of all levels. From AI-powered trading features to regular market updates and in-depth reports, this platform equips users with the resources needed to make informed decisions and navigate the cryptocurrency market with confidence. With over 200 hours of training content, live expert sessions, and comprehensive learning materials available through its academy, users can enhance their trading skills and stay ahead in the fast-paced world of cryptocurrency trading. As the blockchain industry continues to evolve, it’s essential to stay informed and explore new growth opportunities. These three promising blockchain projects offer unique solutions and growth opportunities within the expanding XERA Pro ecosystem. By staying engaged and exploring new possibilities, referral marketers, enthusiasts, and stakeholders can contribute to the growth and success of these innovative projects and help shape the future of blockchain technology within the XERA community and beyond. About XERA XERA is a global community that seeks to leverage technological advancements in the blockchain industry to empower individuals and transform society to bring about a more sustainable, prosperous, and inclusive future. Check out Xera here. Follow them on social media here: Telegram | YouTube | Twitter | LinkedIn | Instagram Disclaimer: The content provided in this article is for educational and informational purposes only. It is not intended as, and should not be construed as, the promotion or marketing of any digital assets, cryptocurrencies, or investment advisory services. This article does not constitute professional investment advice and should not be used as the basis for any investment decision. Readers are encouraged to conduct their own research and consult with professional advisors before engaging in any investment activities. The post The Core Pillars of the XERA Pro Universe appeared first on BeInCrypto.","article_summary":"Innovation and progress are constant companions of the blockchain world. As the industry continues to evolve, new projects emerge with the potential to reshape the digital landscape and revolutionize the way we interact with technology. Within the expansive ecosystem of Xera, a community dedicated to empowering individuals and driving meaningful change, several projects stand out … Continued The post The Core Pillars of the XERA Pro Universe appeared first on BeInCrypto.","publisher":{"name":"Be(In)Crypto","logo":"https://t3.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://beincrypto.com/&size=64"},"creation_date":"2024-05-15T11:35:54Z","categories":["core","blockchain","defi","web3","crypto","cryptocurrency","ai"],"article_link":"https://beincrypto.com/the-core-pillars-of-the-xera-pro-universe/","thumbnail_image":"https://beincrypto.com/wp-content/uploads/2024/05/Xera.jpg"},{"article_title":"Rising Demand for These 5 Altcoins: Bullish Signs for BTC, ETH, XRP, LTC, and BCH","author":"Jocelyn Blake","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Despite the ongoing decline in Bitcoin (BTC), certain altcoins are showing bullish signals. These altcoins have managed to attract attention with their short-term rises, despite the poor performance of BTC. Among these promising projects are Pepe (PEPE), Wormhole (W), Arweave (AR), […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Despite the ongoing decline in Bitcoin (BTC), certain altcoins are showing bullish signals. These altcoins have managed to attract attention with their short-term rises, despite the poor performance of BTC. Among these promising projects are Pepe (PEPE), Wormhole (W), Arweave (AR), […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T11:35:26Z","categories":["btc","eth","xrp","ltc","bch","pepe","bitcoin","wormhole","w","arweave","ar"],"article_link":"https://en.coinotag.com/rising-demand-for-these-5-altcoins-bullish-signs-for-btc-eth-xrp-ltc-and-bch/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-11.webp?resize=150%2C150&quality=70&ssl=1"}]}