{"count":4688,"totalPages":938,"categories":[{"category":"bitcoin","articles":[{"article_title":"Crypto Trader Says One Large-Cap Memecoin Is ‘About To Rip,’ Updates Outlook on Bitcoin and Solana","author":"thebittimes@thebitfinance.com (TheBitTimes.Com)","article_detailed_content":"A widely followed analyst and trader is expressing bullish sentiment on a leading memecoin while updating his outlook on three other crypto assets. The analyst pseudonymously known as Kaleo tells his 638,400 followers on the social media platform X that Dogecoin (DOGE) is “about to rip”. On the largest memecoin by market cap, the widely followed analyst further says, “DOGE always has been and always will be the king of the memes. All of retail is still familiar with it, and all of crypto Twitter was raised on it. It was the initial meme that made it possible for us to believe that a dog and a community were enough to start a movement. Dogecoin isn’t dead. As soon as it starts to catch a bit of a bid, it will move vertical once again… It’s only a matter of time before it happens, and I refuse to be sidelined when it does.” Dogecoin is trading at $0.152 at time of writing. Turning to Bitcoin (BTC), Kaleo says he has a “feeling that it continues to do well from here.” Source: Kaleo/X Based on Kaleo’s chart, it appears that the pseudonymous analyst is projecting Bitcoin to rise to over $100,000 over the coming months. Bitcoin is trading at $66,003 at time of writing. Next up is Solana (SOL). According to the widely followed analyst, Solana will soar to a fresh all-time high this year. Solana is trading at $173 at time of writing, down about 33% from its record high of $259.96. Source: https://thebittimes.com/crypto-trader-says-one-large-cap-memecoin-is-about-to-rip-updates-outlook-on-bitcoin-and-solana-tbt88724.html","article_summary":"A widely followed analyst and trader is expressing bullish sentiment on a leading memecoin while updating his outlook on three other crypto assets.The analyst pseudonymously known as Kaleo tells his 638,400 followers on the social...","publisher":{"name":"The Bit Times","logo":"https://logo.clearbit.com/thebittimes.com?size=96"},"creation_date":"2024-05-18T09:33:16Z","categories":["crypto","bitcoin","solana","dogecoin","doge","btc","sol"],"article_link":"https://thebittimes.com/crypto-trader-says-one-large-cap-memecoin-is-about-to-rip-updates-outlook-on-bitcoin-and-solana-tbt88724.html","thumbnail_image":"https://cdn.thebittimes.com/vimedia/w800/2024/05/18/da8b9ab6aeeea60d708fc559eb774a0c.webp"},{"article_title":"Expert Crypto Trader Predicts Surge for Memecoin DOGE, Provides Fresh Insights on Bitcoin (BTC) and Solana (SOL) Performance","author":"Gideon Wolf","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! A widely followed analyst and trader is expressing bullish sentiment on a leading memecoin while updating his outlook on three other crypto assets. The analyst, known as Kaleo, shares his insights with over 638,000 followers on social media, predicting significant movements […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! A widely followed analyst and trader is expressing bullish sentiment on a leading memecoin while updating his outlook on three other crypto assets. The analyst, known as Kaleo, shares his insights with over 638,000 followers on social media, predicting significant movements […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-18T09:31:24Z","categories":["crypto","doge","bitcoin","btc","solana","sol","pepe"],"article_link":"https://en.coinotag.com/expert-crypto-trader-predicts-surge-for-memecoin-doge-provides-fresh-insights-on-bitcoin-btc-and-solana-sol-performance/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-1.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Jito Price Prediction 2024-2030: Will JTO Price Hit $10?","author":"Shayan Chowdhury","article_detailed_content":"Key Takeaways Jito price witnesses a buying demand as the price aims for a surge above $5. Our Jito price prediction expects JTO price to record a maximum level of $5.53 in 2024. In 2030, we expect JTO price to achieve $57.27. In December 2023, the Jito (JTO) token airdrop garnered significant attention for the Solana blockchain, which had been facing challenging times. The event also highlighted the importance of liquid staking on Solana while empowering holders to influence platform governance. Based on these developments, we’ve compiled our Jito price prediction, explored the factors behind these forecasts, and provided insights into the role and utility of the JTO token. Overview Cryptocurrency Jito Token JTO Price $4.7 Market Cap $500,964,185 Trading Volume $221,358,332 Circulating Supply 1,000,000,000 JTO All-time High $5.28 All-time Low $1.43 Jito Technical Analysis Metric Value Price Prediction $13.71 (227.71%) Volatility 10.92% 50-Day SMA $3.43 14-Day RSI 59.42 Sentiment Bullish Fear & Greed Index 66 (Greed) Green Days 15/30 (50%) JTO Price Analysis Jito price faces bullish pressure as it aims for $5 JTO price analysis shows a bullish pattern as the price aims for a surge above $5 Resistance for JITO is present at $5.3 Support for JTO/USD is present at $4.2 The JTO price analysis for 18 May confirms that Jito witnessed a bullish pressure as it faced increased buying activity. The price aims to break above $5; however, it is struggling to gain buying demand. JITO price analysis 1-day chart: Bulls struggle in meeting buying goals Analyzing the daily price chart of JTO tokens, JITO’s price witnessed a bearish rally after bulls failed to push the altcoin above $5. Over the last 24 hours, JITO price has been on a bearish path as sellers continue to show confidence around the $5 level. The 24-hour volume surged to $61.4 million, showing an increased interest in trading activity today. JITO price is currently trading at $4.7, increasing by over 3.2% in the last 24 hours. The RSI-14 trend line has surged from its previous level and currently hovers around 68-level, showing that bulls are slowly gaining the momentum of the price. The SMA-14 level suggests upward volatility in the next few hours. JITO/USDT 4-hour price chart: Bears aim for a decline below EMA20 trend line The 4-hour JITO price chart suggests JTO continues to experience bullish activity near EMA lines, creating a positive sentiment on the price chart. As the price continues to surge above EMA lines, bears are aiming for a decline below the EMA20 trend line. The BoP indicator is trading in a bullish region at 0.03, hinting that buyers are trying to build pressure near resistance levels and boost an upward correction. Additionally, the MACD trend line has formed green candles above the signal line and the indicator aims for a positive momentum, strengthening bullish positions. Jito Price Predictions: Levels And Action Daily Simple Moving Average (SMA) Period Value Action SMA 3 $3.62 BUY SMA 5 $3.67 BUY SMA 10 $3.45 BUY SMA 21 $3.38 BUY SMA 50 $3.43 BUY SMA 100 $2.91 BUY Daily Exponential Moving Average (EMA) Period Value Action EMA 3 $3.69 BUY EMA 5 $3.61 BUY EMA 10 $3.49 BUY EMA 21 $3.42 BUY EMA 50 $3.30 BUY EMA 100 $3.05 BUY What to expect from JITO price analysis next? The hourly price chart confirms bears are making efforts to prevent the JITO price from an immediate surge. However, if the JITO price successfully breaks above $5.3, it may surge higher and touch the resistance at $5.7. If bulls cannot initiate a surge, JITO price may drop below the immediate support line at $4.2, resulting in a correction to $3.3. Is Jito A Good Investment? For enthusiasts within the Solana community, the introduction of JTO marks a significant event, as it empowers users to participate in governing one of the network’s largest liquid staking protocols—undoubtedly, those engaged with the protocol will have a keen interest in the token. Another critical factor influencing predictions for Jito’s price in 2024 is the progress of the Jito protocol itself. While there’s no specific roadmap to anticipate upcoming enhancements, the unveiling of a future roadmap or the declaration of forthcoming developments could significantly boost interest in the token. Recent JTO News/Opinions Jito, a liquid staking and MEV infrastructure project, now leads as the top protocol on Solana with $1.4 billion in total value locked. This equals about 10 million SOL, or roughly 38% of the Solana ecosystem’s $3.7 billion TVL, per DeFiLlama. Marinade is second with $1.37 billion, followed by Kamino ($1 billion), Raydium ($613 million), and Marginfi ($424 million). Jito Price Prediction May 2024 Over the last few weeks, JTO coin price has been on an uptrend and it aims to record further gains by breaking above the $4.5 mark. However, sellers might strongly defend a surge in the coming hours due to overbought RSI level. According to technical analysis, we might see JTO price to record the maximum level of $5.3 and minimum price of $2.8, with an average value of $3.5 throughout May. Jito Price Prediction Potential Low Potential Average Potential High Jito Price Prediction May 2024 $2.8 $3.5 $5.3 Jito Price Prediction 2024 The effects of Bitcoin Halving typically appear 12-18 months afterward, but 2024 might see a different trend due to heightened institutional interest and improved macroeconomic factors. During the JTO airdrop, the token was available on major exchanges except Kraken, leaving one significant listing announcement to excite traders. However, this impact is likely minor. A critical factor influencing the 2024 Jito price forecast is progress on the Jito protocol. While there isn’t a clear roadmap, the announcement of future developments could boost interest in the token. Based on technical analysis and forecast data, the projected minimum price of Jito in 2024 is $4.86. The price could potentially climb to a maximum of $5.53, with an expected average around $5.05. Jito Price Prediction Potential Low Potential Average Potential High Jito Price Prediction 2024 $4.86 $5.05 $5.53 Jito Price Prediction 2025-2030 Year Minimum Price ($) Average Price ($) Maximum Price ($) 2025 7.14 7.34 8.56 2026 10.72 11.08 12.61 2027 14.94 15.49 18.79 2028 22.55 23.17 26.05 2029 33.51 34.67 39.75 2030 46.60 47.99 57.27 Jito Price Prediction 2025 According to the JTO tokenomics, additional Jito tokens will be released at the close of 2024 and the start of 2025, continuing throughout the year. This increase is likely to exert downward pressure on the value of Jito crypto. However, 2025 is also expected to showcase the significant impact of the Bitcoin Halving, which could propel crypto markets and tokens to new all-time highs, potentially boosting the Jito token price. A comprehensive technical analysis of past pricing trends suggests that in 2025, Jito is anticipated to have a minimum price of $7.14. Its maximum price could reach $8.56, with an expected average trading value of $7.34. JTO Price Forecast for 2026 If the crypto market continues to witness increased institutional adoption, we might see a milestone in the total market cap, resulting in an upward pressure for JTO price. In 2026, the forecasted minimum price for Jito is $10.72. The coin may reach a high of $12.61, with an estimated average value of $11.08 throughout the year. Jito (JTO) Price Prediction 2027 Technical analysis indicates that by 2027, Jito is likely to have a minimum price of $14.94. The projected maximum price could reach $18.79, while the average trading price is estimated to be $15.49. Jito Price Prediction 2028 Projections for 2028 indicate that the lowest expected price for Jito is $22.55. The coin may achieve a maximum value of $26.05, with an average forecast value of $23.17. Jito Price Prediction 2029 In 2029, Jito is expected to have a minimum price of $33.51. The coin’s value could potentially rise to a maximum of $39.75, with an average price of $34.67 throughout the year. Jito (JTO) Price Prediction 2030 Looking ahead to 2030, Jito is expected to reach a minimum price of $46.60. Its maximum value could be as high as $57.27, with an anticipated average price of $47.99 throughout the year. Jito Market Price Prediction: Analysts’ JTO Price Forecast Firm Name 2024 2025 Coincodex $8.5 $19.74 DigitalCoinPrice $8.8 $24.37 Changelly $4.25 $6.45 Cryptopolitan’s Jito Price Prediction At Cryptopolitan, we are bullish on the Jito price movements as the coin is expected to surge to new highs by the end of this year. Based on technical analysis and forecast data, the projected minimum price of Jito in 2024 is $4.86. The price could potentially climb to a maximum of $5.53, with an expected average around $5.05. Jito Historic Price Sentiment December 2023: Launched at a value of $2.0608. Early January 2024: Dropped below $1.5127. April 3, 2024: Reached an all-time high of $4.87. However, JTO dropped steeply toward $2.5 by 17 April. In recent weeks, the price has recovered and now holds above $4.","article_summary":"Will Jito price hit $10? Check out the latest price analysis, future prices, and background of JTO in Jito Price Prediction and make that portfolio decision.","publisher":{"name":"Cryptopolitan","logo":"https://t0.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.cryptopolitan.com/&size=64"},"creation_date":"2024-05-18T09:31:09Z","categories":["token","solana","blockchain","cryptocurrency","near","sol","bitcoin","crypto"],"article_link":"https://www.cryptopolitan.com/jito-price-prediction/","thumbnail_image":"https://www.cryptopolitan.com/wp-content/uploads/2024/02/Jito-pp.jpg"},{"article_title":"Pendle Token Theft Surges, $5.62M Lost From Recent Permit Phishing","author":"Coingape Staff","article_detailed_content":"In recent months, the Pendle token ecosystem has experienced a significant surge in thefts, with over $10 million worth of Pendle yield tokens stolen due to security breaches. This alarming trend underscores the pressing need for heightened vigilance among cryptocurrency users. The majority of these thefts have been facilitated through fraudulent means, where users unintentionally grant permissions to malicious entities. These incidents highlight the critical importance of meticulously scrutinizing any approval requests related to yield tokens. Escalating Theft Incidents Highlight Security Vulnerabilities The most recent incident in this troubling series of thefts involved a victim who lost $5.62 million worth of Pendle yield tokens. This loss occurred when the user, identified by the address 0xe..f05, inadvertently signed a phishing signature disguised as a legitimate permit. This deceptive act enabled the scammer, identified by the address 0xa…a6f, to gain unauthorized access to the victim’s tokens. This particular case is part of a broader pattern of thefts that has intensified over the past week, with four significant phishing incidents each resulting in losses exceeding $1 million. These events have collectively led to a staggering total loss of $9.04 million. Most of these thefts involved Pendle yield tokens, and the predominant method of attack has been through fraudulent permit phishing signatures. This disturbing trend underscores the urgent need for robust security measures and increased user awareness within the cryptocurrency community to combat these sophisticated phishing schemes. Also Read: US Leads Global Bitcoin ETF Inflow Of $10B In Q1 Market Resilience and Influential Endorsements Despite the ongoing security challenges, Pendle (PENDLE) has shown remarkable resilience in the market. As of today, Pendle is priced at $4.99, reflecting an 8.15% increase in the last 24 hours and an 11.26% increase over the past week. The token boasts a 24-hour trading volume of $124,016,558.79 and a circulating supply of 150 million PENDLE, resulting in a market cap of $768,389,937. This positive market performance indicates strong investor confidence, which has been further bolstered by high-profile endorsements and strategic investments. One such influential figure is Arthur Hayes, co-founder of BitMEX, who has recently drawn significant attention with his strategic investment in Pendle. In his article titled “Mayday,” Hayes outlined his cryptocurrency investment strategy for May, revealing his purchase of $500,000 worth of PENDLE tokens. Hayes’ bold move has sparked widespread discussion within the crypto community, as he is renowned for his market insights and accurate predictions. His investment in Pendle is perceived as a strong vote of confidence, contributing to the recent price surge and reinforcing the token’s potential in the market. Investors and market analysts are closely monitoring Hayes’ actions, which continue to shape market perceptions and trends. His involvement not only highlights the potential of Pendle but also serves as a barometer for broader market sentiment, attracting both scrutiny and admiration from the crypto community. Also Read: Ethereum (ETH) Price Jumps 5%, This Breakout Can Trigger Bull Run The post Pendle Token Theft Surges, $5.62M Lost From Recent Permit Phishing appeared first on CoinGape.","article_summary":"In recent months, the Pendle token ecosystem has experienced a significant surge in thefts, with over $10 million worth of Pendle yield tokens stolen due to security breaches. This alarming trend underscores the pressing need for heightened vigilance among cryptocurrency users. The majority of these thefts have been facilitated through fraudulent means, where users unintentionally The post Pendle Token Theft Surges, $5.62M Lost From Recent Permit Phishing appeared first on CoinGape.","publisher":{"name":"CoinGape","logo":"https://logo.clearbit.com/coingape.com?size=96"},"creation_date":"2024-05-18T09:25:33Z","categories":["pendle","token","cryptocurrency","bitcoin","crypto","ethereum","eth"],"article_link":"https://coingape.com/pendle-token-theft-surges-5-62m-lost-from-recent-permit-phishing/","thumbnail_image":"https://coingape.com/wp-content/uploads/2024/04/Pendle-crypto.jpg"},{"article_title":"Bitcoin (BTC) Faces Record Drop in Value Following Massive ETF Outflows","author":"Gideon Wolf","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Bitcoin’s recent surge marks a significant rebound as it crosses the $50,000 threshold. This rally is driven by increased adoption by mainstream financial entities and positive market sentiment. “This uptick is a clear indicator of cryptocurrency’s growing acceptance in traditional finance,” […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Bitcoin’s recent surge marks a significant rebound as it crosses the $50,000 threshold. This rally is driven by increased adoption by mainstream financial entities and positive market sentiment. “This uptick is a clear indicator of cryptocurrency’s growing acceptance in traditional finance,” […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-18T09:22:32Z","categories":["bitcoin","btc","pepe"],"article_link":"https://en.coinotag.com/bitcoin-btc-faces-record-drop-in-value-following-massive-etf-outflows-3/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-6.webp?resize=150%2C150&quality=70&ssl=1"}]}],"currentPage":2}