{"count":9690,"totalPages":323,"currentPage":7,"articles":[{"article_title":"Former FTX Executive Ryan Salame Battles for Leniency in Crypto Fraud Case Involving Bitcoin (BTC)","author":"Gideon Wolf","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Ryan Salame, a key figure in a high-profile FTX fraud case, is set to face sentencing. The defense team is pleading for leniency, citing Salame’s cooperation with the investigation. “Mr. Salame has shown remorse and has taken significant steps to make […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Ryan Salame, a key figure in a high-profile FTX fraud case, is set to face sentencing. The defense team is pleading for leniency, citing Salame’s cooperation with the investigation. “Mr. Salame has shown remorse and has taken significant steps to make […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T11:31:28Z","categories":["crypto","bitcoin","btc","pepe"],"article_link":"https://en.coinotag.com/former-ftx-executive-ryan-salame-battles-for-leniency-in-crypto-fraud-case-involving-bitcoin-btc/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-6.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Floki Inu Leads the Pack as Meme Coins Ride the Roaring Kitty Rally","author":"Ryan Gladwin","article_detailed_content":"But there's another explanation: A recently approved DAO proposal authorized the burning of $3.3 million worth of FLOKI tokens.","article_summary":"But there's another explanation: A recently approved DAO proposal authorized the burning of $3.3 million worth of FLOKI tokens.","publisher":{"name":"Decrypt","logo":"https://t3.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://decrypt.co/&size=64"},"creation_date":"2024-05-15T11:31:06Z","categories":["floki"],"article_link":"https://decrypt.co/230801/floki-inu-roaring-kitty-meme-coin-rally","thumbnail_image":"https://cdn.decrypt.co/wp-content/uploads/2024/03/floki-inu-meme-coin-gID_7.jpg"},{"article_title":"You Can Now Invest in a Bitcoin Fund and Earn Yield—In Nordic Countries","author":"Ryan Kawailani Ozawa","article_detailed_content":"The new yield-bearing Bitcoin fund offers a more than 5% return through secure staking via the BTC-powered Core Chain.","article_summary":"The new yield-bearing Bitcoin fund offers a more than 5% return through secure staking via the BTC-powered Core Chain.","publisher":{"name":"Decrypt","logo":"https://t3.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://decrypt.co/&size=64"},"creation_date":"2024-05-15T11:31:02Z","categories":["bitcoin","core"],"article_link":"https://decrypt.co/230766/you-can-invest-bitcoin-etp-earn-yield-nordic-countries","thumbnail_image":"https://cdn.decrypt.co/wp-content/uploads/2024/05/Bitcoin-Nordic-Countries_shutterstock_1896598609-scaled-gID_7.jpg"},{"article_title":"MicroStrategy’s Chairman Predicts Bitcoin (BTC) as Key Asset for Pension Funds: A Game-Changer in Crypto Investment","author":"Gideon Wolf","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! MicroStrategy Chairman Forecasts Bitcoin’s Role in U.S. Pension Funds MicroStrategy Chairman Michael Saylor predicts a significant shift in the investment strategies of U.S. pension funds, with Bitcoin playing a pivotal role. This prediction comes amid a rising institutional interest in cryptocurrencies. […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! MicroStrategy Chairman Forecasts Bitcoin’s Role in U.S. Pension Funds MicroStrategy Chairman Michael Saylor predicts a significant shift in the investment strategies of U.S. pension funds, with Bitcoin playing a pivotal role. This prediction comes amid a rising institutional interest in cryptocurrencies. […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T11:30:40Z","categories":["bitcoin","btc","crypto","pepe"],"article_link":"https://en.coinotag.com/microstrategys-chairman-predicts-bitcoin-btc-as-key-asset-for-pension-funds-a-game-changer-in-crypto-investment/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-4.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Sonne Finance Suffers $20M Exploit, Hacker Flees","author":"Harvey Hunter","article_detailed_content":"Lending protocol Sonne Finance halted operations after a hack drained $20 million in cryptocurrencies, including WETH and USDC. On May 14, around 10:30 pm UTC, Web3 security firm Cyvers detected an ongoing attack on Sonne Finance’s USD and Wrapped Ether (WETH) contracts, at the time they had only stolen $3 in cryptocurrency. ALERTWe have detected an attack on @SonneFinance, $3 million have been stolen from their USDC and WETH contracts. Please contact us for more information. pic.twitter.com/tA4Heigfj7 — Cyvers Alerts (@CyversAlerts) May 14, 2024 However, Sonne Finance only Became aware of the issue 25 minutes later. By that time, they had already been drained of $20 million of WETH, Velo (VELO), soVELO, and Wrapped USDC (USDC.e). On May 15 at 12:11 a.m. UTC, Sonne Finance made a vague announcement on X. They said, “All markets on Optimism have been paused” and that “Markets on Base are safe.” They also told users that more information would be provided “with time.” All markets on Optimism have been paused. Markets on Base are safe. We'll provide more information with time. — Sonne Finance (@SonneFinance) May 15, 2024 Soon after, the protocol partnered with Cyvers to investigate the situation further. How Sonne Finance Was Exploited 3 hours after their initial announcement, Sonne explained the situation further in a press release. The Optimism chain of Sonne Finance was exploited through a known donation attack on Compound v2 forks. Previously, measures were in place to combat the issue with 0% collateral factors, adding collateral, and burning them, before gradually increasing the collateral factors based on proposals. However, a recent proposal was approved to integrate VELO markets into Sonne. Transactions were scheduled on a multi-sig wallet with a 2-day timelock. The exploit occurred as the timelock ended, allowing the hacker to execute transactions for market creation and adding collateral factors. After executing the markets undetected, the attacker was able to exploit the protocol for $20 million. However, the remaining $6.5M was saved by adding $100 worth of VELO to the markets. Sonne Finance is working to recover the stolen funds, considering a bug bounty for their return. Usually, a 10% reward would be given to an exploiter for discovering a security flaw. They said: “We are ready to give bounty to exploiter as well as not to commit pursuing the issue further, in case of returning the funds.” However, it seems unlikely the hacker will comply. According to blockchain investigator PeckShield, the exploiter has already moved $7.8 million to a new wallet address. #PeckShieldAlert @SonneFinance exploiter-labeled address has transferred $7.8M worth of cryptos, including 100 $WBTC & 556.1 $ETH, to a new address 0x6277…4c07 #Optimism pic.twitter.com/g4oiP5akr4 — PeckShieldAlert (@PeckShieldAlert) May 15, 2024 The exploiter then swapped 59 WBTC for roughly 1,185 Ether and 183,000 Dai. The move suggests an intent to launder the stolen funds through a privacy protocol like Tornado Cash. Tornado Cash in Crypto Crime Tornado Cash is an open-source cryptocurrency tumbler, also known as a “crypto mixer.” This tool obscures the path of crypto transactions, making it extremely difficult to determine the original source of the funds. Although created as a privacy tool, hackers often use these mixing services to launder stolen funds via decentralized exchange platforms. Crypto mixers have seen significant adoption in recent years. In October 2023 over $77 million in assets were processed through Tornado Cash contracts. However, the majority of this adoption has been with illicit assets. Over the years, hackers have chosen crypto-mixing services over centralized exchanges as once they are identified, addresses are blocked by exchanges. Tornado Cash bypasses this, as a way to legitimize their source of funds by removing connections to a hacked wallet or illicit crypto activity. Recently, the United Nations sanctions monitors noted that North Korea was involved in laundering $147.5 million in stolen cryptocurrency using Tornado Cash. Almost all the top multi-million dollar crypto hacks have utilized Tornado Cash to launder the proceeds, as per an Arkham Intelligence report. Something that prompted the US Treasury to impose sanctions on Tornado Cash in August 2022. As a result, its founders were charged with money laundering and sanctions violations a year later. While opinions within the crypto community vary regarding the adoption of privacy tools, there is a consensus against the persecution of developers solely for creating an application. Although crypto related frauds and scams are on the decline, it is important that users are educated on how to protect themselves from crypto crime. The post Sonne Finance Suffers $20M Exploit, Hacker Flees appeared first on Cryptonews.","article_summary":"Lending protocol Sonne Finance halted operations after a hack drained $20 million in cryptocurrencies, including WETH and USDC, and flees. The post Sonne Finance Suffers $20M Exploit, Hacker Flees appeared first on Cryptonews.","publisher":{"name":"Crypto News","logo":"https://t1.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://cryptonews.com/&size=64"},"creation_date":"2024-05-15T11:30:36Z","categories":["usdc","web3","cryptocurrency","optimism","blockchain","eth","dai","crypto"],"article_link":"https://cryptonews.com/news/sonne-finance-suffers-20m-exploit.htm","thumbnail_image":"https://cimg.co/wp-content/uploads/2024/05/15110908/1715771348-1715771328755_processed.jpg"},{"article_title":"Shiba Inu’s K9 Finance To Burn 410 Million Tokens – Why This Is Significant","author":"Godspower Owie","article_detailed_content":"In a significant move to commemorate Ethereum co-founder Vitalik Buterin’s historic SHIB token burn, Shiba Inu partner K9 Finance, the project’s official liquid staking productm has announced its plans to burn 410 million KNINE tokens, which has garnered widespread attention and appreciation within the cryptocurrency community. Vitalik Buterin’s Shiba Inu Burn Inspires K9 Finance to Burn 410 Million KNINE About 3 years ago, particularly on May 17, 2021, the founder of Ethereum, Vitalik Buterin, carried out a massive burn of 410 trillion Shiba Inu tokens from the project’s overall circulation, which sent shockwaves around the cryptocurrency space. During the early days of the project, Buterin was offered half of SHIB’s overall supply, and the Ethereum co-founder decided to incinerate over 90% of his holdings. Meanwhile, the outstanding percent of his SHIB holdings were set aside for charity, particularly the India Crypto Relief Fund (COVID-19), in keeping with his ideals of long-term saving initiatives. At the time, this audacious action was a turning point for both SHIB and the market as a whole, and the burn was valued at about $6.7 billion. It is believed that the burn contributed significantly to Shiba Inu’s rise to prominence since many investors hoarded the token, which caused it to soar to an all-time high of $0.00008845 in October 2021. According to Buterin, he made the move to burn the aforementioned SHIB because he did not want to be that kind of center power. In addition, he was not confident in the tokens as he believed Shiba Inu would have underperformed by possibly 100x in the near future. Reiterating the act, K9 Finance DAO has made a proposal to burn 410 million KNINE tokens valued at $12,127 from its total supply of 1 trillion. However, out of the 1 trillion overall supply, about 115.53 billion KNINE are currently in circulation. K9 Finance believes Buterin’s burn was a major driving force behind SHIB’s growth and transition into an enormous project within the cryptocurrency landscape, and the platform plans to do the same for KNINE. Generation Of The 410 Million KNINE K9 Finance has noted that the 410 KNINE will be generated from the treasury’s marketing allocation, and it will not affect operations in the long term. Meanwhile, members must cast their votes on whether or not to approve the burn. Presently, most of the K9 Finance community members, specifically about 81%, have voted in support of the incineration to honor Buterin’s SHIB burn, while about 18% have voted against the proposal. The proposal, which was created on Monday, May 13, is expected to end on Saturday, May 18. It is noteworthy that K9 Finance partnered with Shiba Inu in February, with the aim of facilitating seamless BONE staking on the project’s layer 2 solution Shibarium. Since the partnership, K9 Finance has displayed efforts to contribute to Shiba Inu’s security.","article_summary":"In a significant move to commemorate Ethereum co-founder Vitalik Buterin’s historic SHIB token burn, Shiba Inu partner K9 Finance, the project’s official liquid staking productm has announced its plans to burn 410 million KNINE tokens, which has garnered widespread attention and appreciation within the cryptocurrency community. Vitalik Buterin’s Shiba Inu Burn Inspires K9 Finance to […]","publisher":{"name":"Bitcoinist","logo":"https://t3.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://bitcoinist.com/&size=64"},"creation_date":"2024-05-15T11:30:30Z","categories":["ethereum","shib","token","cryptocurrency","crypto","near"],"article_link":"https://bitcoinist.com/shiba-inus-k9-finance-to-burn-410-million-tokens/","thumbnail_image":"https://bitcoinist.com/wp-content/uploads/2023/11/shutterstock_2063026553.jpg?fit=640%2C360"},{"article_title":"Liquid Restaking Protocol YieldNest Launches ynETH on Mainnet!","author":"AMBCrypto Team","article_detailed_content":"YieldNest, an innovative liquid restaking protocol, proudly announces the official launch of ynETH on Mainnet […]","article_summary":"YieldNest, an innovative liquid restaking protocol, proudly announces the official launch of ynETH on Mainnet […]","publisher":{"name":"AMBCrypto","logo":"https://logo.clearbit.com/ambcrypto.com?size=96"},"creation_date":"2024-05-15T11:30:07Z","categories":["general"],"article_link":"https://ambcrypto.com/liquid-restaking-protocol-yieldnest-launches-yneth-on-mainnet/","thumbnail_image":"https://ambcrypto.com/wp-content/uploads/2024/05/Screenshot-2024-05-15-at-4.45.42 PM.png"},{"article_title":"Binance Launches Funding Arbitrage Bot and Spot Copy Trading","author":"Dishita Malvania","article_detailed_content":"Binance, the renowned blockchain ecosystem powering the world’s largest cryptocurrency exchange by trading volume, has unveiled two significant updates: the launch of the Funding Rate Arbitrage Bot and the full rollout of Spot Copy Trading to all eligible users. With nearly 120,000 active trading strategies available on its Trading Bots Marketplace, Binance continues to enrich its array of automated trading tools. Among the popular bots are Grid Trading for Spot and Futures, Rebalancing Bots, Auto-Invest, and Dollar-Cost Averaging (DCA). The Funding Rate Arbitrage Bot marks Binance’s pioneering venture into automating a delta-neutral spot and futures arbitrage strategy. By eliminating the need for manual execution of separate spot and perpetual futures trades, this bot allows traders to earn funding fees effortlessly. These fees are accrued by opening a perpetual futures position and hedging it with an opposite of equal size on the same symbol in the spot market. Unlike manual arbitrage strategies, the Arbitrage Bot executes both spot and futures trades simultaneously upon setting the user’s strategy parameters. This integrated approach simplifies trading management, as users no longer need to oversee two separate trade orders across different interfaces. Additionally, the bot’s strategies are independently managed within users’ trading bot wallet, facilitating easy performance monitoring. Funding fees play a crucial role in crypto markets, aiding in the alignment of spot and perpetual prices. The Arbitrage Bot offers two deployable strategies: Positive Carry: Buying assets on the spot market while shorting the corresponding perpetual futures contract to collect funding fees from a positive funding rate. Reverse Carry: Buying assets on the spot market and going long on perpetual contracts to collect funding fees from a negative funding rate. As per the press release shared with The Crypto Times, the Arbitrage Bot is accessible on the Binance website and is scheduled for release on the Binance App on May 30. The Chief Technology Officer of Binance, Rohit Wad said, “We believe in giving users more choices and we constantly review community feedback to understand what users want. Our Funding Rate Arbitrage Bot is a simple and effective tool to automate for users who already manually deploy arbitrage strategies.” He added, “Its user-friendly interface means more users can try new strategies. We continue to build trading tools for our users and we are pleased that the community’s reception to our Spot Copy Trading launch has been very positive with over 700 Lead Traders registrations so far.” Spot Copy Trading, introduced in response to user demand, was initially launched for Lead Traders in late April. Following its successful implementation, the feature will now be fully available to all eligible users starting May 15, enabling them to follow Lead Traders and replicate their portfolios. Over 70% of active Lead Traders have achieved positive P&L since joining Spot Copy Trading, despite a highly volatile market where the overall crypto market capitalization fell by 11% in April. As with any investment, users are reminded of the inherent volatility of digital asset prices and the associated risks. Binance encourages users to exercise caution, conduct thorough research, and seek independent financial advice before making investment decisions. Also Read: Binance to End XRP Support with USDT Conversion","article_summary":"Users manage bot strategies independently within their trading bot wallet for easy performance monitoring.","publisher":{"name":"Crypto Times","logo":"https://logo.clearbit.com/www.cryptotimes.io?size=96"},"creation_date":"2024-05-15T11:30:00Z","categories":["blockchain","cryptocurrency","crypto","xrp","usdt"],"article_link":"https://www.cryptotimes.io/2024/05/15/binance-launches-funding-arbitrage-bot-and-spot-copy-trading/","thumbnail_image":"https://www.cryptotimes.io/wp-content/uploads/2024/05/imgpsh_fullsize_anim-39-1024x576.jpg"},{"article_title":"CNBC’s Jim Cramer Endorses Bitcoin (BTC): A Must-Have Investment in Crypto Portfolio","author":"Gideon Wolf","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Jim Cramer, a renowned financial commentator, has suggested that investors should opt for direct Bitcoin investment over purchasing MicroStrategy shares. Despite MicroStrategy’s significant Bitcoin holdings, Cramer believes Bitcoin itself offers more lucrative returns. Cramer’s comments come amidst Bitcoin’s impressive year-to-date performance, […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Jim Cramer, a renowned financial commentator, has suggested that investors should opt for direct Bitcoin investment over purchasing MicroStrategy shares. Despite MicroStrategy’s significant Bitcoin holdings, Cramer believes Bitcoin itself offers more lucrative returns. Cramer’s comments come amidst Bitcoin’s impressive year-to-date performance, […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T11:29:24Z","categories":["bitcoin","btc","crypto","pepe"],"article_link":"https://en.coinotag.com/cnbcs-jim-cramer-endorses-bitcoin-btc-a-must-have-investment-in-crypto-portfolio/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-11.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"All Roads Lead to NFT Rome 2024: A Showcase of Digital Art and Web3 Innovation","author":"Advertorial","article_detailed_content":"BeInCrypto is thrilled to announce its partnership with NFT Rome, the premier event dedicated to the exploration of digital art and Web3 innovations, set to take place on June 7-8, 2024, at La Lanterna in Rome. This event promises to gather the brightest minds in the Web3 economy, including sectors like gaming, arts, luxury, fashion, and finance. As one of the main media partners, BeInCrypto will provide comprehensive coverage of the event, offering insights from sessions, exclusive interviews with top digital artists and pioneers, and live updates from the event. NFT Rome 2024 will feature an array of sessions, panels, and exclusive rooftop parties, promising an immersive experience in digital culture against the backdrop of Rome’s iconic skyline. Attendees will have the opportunity to engage with leading brands and creators, explore advancements in digital arts, and participate in networking with like-minded enthusiasts and industry leaders. Tickets are now available, with early access to registration open to those who join the waiting list.For more information on NFT Rome and to purchase tickets, please visit NFT Rome’s official website. The post All Roads Lead to NFT Rome 2024: A Showcase of Digital Art and Web3 Innovation appeared first on BeInCrypto.","article_summary":"BeInCrypto is thrilled to announce its partnership with NFT Rome, the premier event dedicated to the exploration of digital art and Web3 innovations, set to take place on June 7-8, 2024, at La Lanterna in Rome. This event promises to gather the brightest minds in the Web3 economy, including sectors like gaming, arts, luxury, fashion, … Continued The post All Roads Lead to NFT Rome 2024: A Showcase of Digital Art and Web3 Innovation appeared first on BeInCrypto.","publisher":{"name":"Be(In)Crypto","logo":"https://t3.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://beincrypto.com/&size=64"},"creation_date":"2024-05-15T11:28:38Z","categories":["nft","web3"],"article_link":"https://beincrypto.com/all-roads-lead-to-nft-rome-2024/","thumbnail_image":"https://beincrypto.com/wp-content/uploads/2024/05/Снимок-экрана-2024-05-15-в-14.26.43.png"},{"article_title":"Motilal Oswal’s Top 3 Stock Recommendations for the Week: A Must-Buy for Savvy Investors","author":"Gideon Wolf","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! The Indian stock market indices, Sensex and the Nifty 50, closed higher for the third consecutive session on Tuesday, May 14, despite varying signals from global markets. Following a nearly 2 percent decline last week, market benchmarks rebounded this week, buoyed […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! The Indian stock market indices, Sensex and the Nifty 50, closed higher for the third consecutive session on Tuesday, May 14, despite varying signals from global markets. Following a nearly 2 percent decline last week, market benchmarks rebounded this week, buoyed […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T11:27:25Z","categories":["pepe"],"article_link":"https://en.coinotag.com/motilal-oswals-top-3-stock-recommendations-for-the-week-a-must-buy-for-savvy-investors/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-19.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Blockstream CEO Forecasts Record-Breaking Bitcoin (BTC) Price Surge This Weekend","author":"Gideon Wolf","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Bitcoin, the world’s leading cryptocurrency, achieved a new all-time high (ATH) over the weekend. Blockstream CEO, Adam Back, predicts that this is just the beginning of a significant bullish trend. “Bitcoin’s potential is far from exhausted,” Back stated in a recent […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Bitcoin, the world’s leading cryptocurrency, achieved a new all-time high (ATH) over the weekend. Blockstream CEO, Adam Back, predicts that this is just the beginning of a significant bullish trend. “Bitcoin’s potential is far from exhausted,” Back stated in a recent […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T11:25:34Z","categories":["bitcoin","btc","pepe","cryptocurrency"],"article_link":"https://en.coinotag.com/blockstream-ceo-forecasts-record-breaking-bitcoin-btc-price-surge-this-weekend/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-9.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Galaxy Digital Founder Michael Novogratz Expects Bitcoin to Trade in Narrow Range for Now","author":"Ruholamin Haqshanas","article_detailed_content":"Michael Novogratz, the founder of Galaxy Digital Holdings, a prominent digital-asset financial services firm, expects Bitcoin to remain in a relatively narrow trading range in the current quarter. During a conference call following the release of Galaxy Digital’s first-quarter results, Novogratz expressed his belief that the crypto market is currently in a consolidation phase. He mentioned that Bitcoin, Ethereum, and other cryptocurrencies like Solana are likely to consolidate as the adoption of cryptocurrencies in traditional finance continues to unfold. Michael Novogratz Expects Bitcoin to Remain in $55,000 to $75,000 Range Specifically, he expects Bitcoin to remain within the range of approximately $55,000 to $75,000 until specific market events or circumstances push the prices higher. The cryptocurrency market has experienced a period of stagnation following the historic bull run observed in the last two quarters. This surge was primarily driven by the launch of spot US Bitcoin exchange-traded funds and the Bitcoin halving event, which reduced the supply of new tokens. However, the optimism surrounding interest rate cuts by the Federal Reserve diminished due to consistently strong economic indicators, leading to a downward trend in Bitcoin’s price. The current base case shows 2 interest rate cuts in 2024 beginning in September. There's currently a 10% chance of no interest rate cuts this year at all. We're watching to see how these odds change tomorrow. Follow us @KobeissiLetter for real time analysis as this develops. pic.twitter.com/vsLA02d7pA — The Kobeissi Letter (@KobeissiLetter) May 15, 2024 Novogratz mentioned the tailwinds experienced in the fourth quarter of the previous year and the first quarter of this year. “I think that is probably where we are certainly for this quarter, maybe next quarter until either A, the Fed starts cutting rates because the economy finally slows or B, we get through the election and I think the election will bring clarity one way or the other to the crypto regulatory landscape.” Bitcoin saw a 2.7% decline on Tuesday, with its price dropping to $61,389. Since reaching its all-time high of $73,797 on March 14, the cryptocurrency has experienced a 16% decrease. Galaxy Digital Reports Impressive Results for Q1 Galaxy Digital, based in New York, reported impressive results for the first quarter, with net income more than tripling to $421.7 million due to the strong rally in digital assets earlier this year. Novogratz highlighted the growing adoption of cryptocurrencies in traditional finance, pointing out increased interest and activities such as lending. He mentioned that lenders are now willing to provide unsecured loans of cryptocurrencies for longer durations, which was not the case just six months ago. Novogratz emphasized that engagement in the crypto space has reached a new level compared to previous times. Following Novogratz’s remarks, shares of Galaxy Digital rose around 1% to $9.28 as of 10:15 a.m. in New York. The stock has gained approximately 23% so far this year, reflecting the positive sentiment surrounding the company. On the other hand, technical analyst Rekt Capital believes that Bitcoin has emerged from the post-halving “danger zone” and entered an accumulation phase, as indicated by weakening selling pressure. “The Post-Halving Bitcoin “Danger Zone” (purple) is officially over,” the popular crypto trader wrote in a recent post on X. “And Bitcoin is celebrating with a good bounce from the Re-Accumulation Range Low support.” #BTC The Bitcoin \"Danger Zone\" The Bitcoin Pre-Halving \"Danger Zone\" (orange) is where historical Pre-Halving Retraces have begun Historically, Bitcoin has performed Pre-Halving Retraces 14-28 days before the Halving This cycle was no different and here's why: Because… pic.twitter.com/Zb1mk1Cn5E — Rekt Capital (@rektcapital) April 25, 2024 The post Galaxy Digital Founder Michael Novogratz Expects Bitcoin to Trade in Narrow Range for Now appeared first on Cryptonews.","article_summary":"Michael Novogratz, the founder of Galaxy Digital Holdings, expects Bitcoin to remain in a relatively narrow trading range in the current quarter. The post Galaxy Digital Founder Michael Novogratz Expects Bitcoin to Trade in Narrow Range for Now appeared first on Cryptonews.","publisher":{"name":"Crypto News","logo":"https://t1.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://cryptonews.com/&size=64"},"creation_date":"2024-05-15T11:24:55Z","categories":["bitcoin","crypto","ethereum","solana","cryptocurrency","optimism","btc"],"article_link":"https://cryptonews.com/news/galaxy-digital-founder-michael-novogratz-expects-bitcoin-to-trade-in-narrow-range-for-now.htm","thumbnail_image":"https://cimg.co/wp-content/uploads/2024/05/15094343/1715766223-1713766554-1713766521817_processed.jpg"},{"article_title":"Dogecoin (DOGE), Shiba Inu (SHIB) & Dogeverse: Unraveling the Best Meme Cryptocurrency Investment","author":"Jocelyn Blake","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Shiba Inu and Dogecoin, the biggest and most famous meme coins, have been market leaders for a while now. However, their massive supply and lack of utility have caused analysts’ doubt. Both projects have volatile prices, leading to many questions about […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Shiba Inu and Dogecoin, the biggest and most famous meme coins, have been market leaders for a while now. However, their massive supply and lack of utility have caused analysts’ doubt. Both projects have volatile prices, leading to many questions about […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T11:24:28Z","categories":["dogecoin","doge","shib","cryptocurrency","pepe"],"article_link":"https://en.coinotag.com/dogecoin-doge-shiba-inu-shib-dogeverse-unraveling-the-best-meme-cryptocurrency-investment/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-11.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Mastercard executes first tokenized deposit transactions with StanChart subsidiaries","author":"Ledger Insights","article_detailed_content":"Mastercard has executed its first live test of the Mastercard Multi-Token Network (MTN) involving tokenized deposits and tokenized assets with Standard Chartered Bank Hong Kong (SCBHK) and subsidiaries. Mastercard unveiled MTN in the middle of last year. This proof of concept was completed as part of the Hong Kong Fintech Supervisory Sandbox. It involved a client of Standard Chartered’s Hong […] The post Mastercard executes first tokenized deposit transactions with StanChart subsidiaries appeared first on Ledger Insights - blockchain for enterprise.","article_summary":"Mastercard has executed its first live test of the Mastercard Multi-Token Network (MTN) involving tokenized deposits and tokenized assets with Standard Chartered Bank Hong Kong (SCBHK) and subsidiaries. Mastercard unveiled MTN in the middle of last year. This proof of concept was completed as part of the Hong Kong Fintech Supervisory Sandbox. It involved a client of Standard Chartered’s Hong […] The post Mastercard executes first tokenized deposit transactions with StanChart subsidiaries appeared first on Ledger Insights - blockchain for enterprise.","publisher":{"name":"Ledger Insights","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.ledgerinsights.com/&size=64"},"creation_date":"2024-05-15T11:23:00Z","categories":["blockchain"],"article_link":"https://www.ledgerinsights.com/mastercard-executes-first-tokenized-deposit-transactions-with-stanchart-subsidiaries/","thumbnail_image":""},{"article_title":"Whale Activity Alert: Intense Buying and Selling of WIF Coin (WIF) and Other Top 4 Cryptocurrencies","author":"Crypto Vira","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! The crypto market, featuring WIF coin and PEPE, witnessed significant activity on May 15 due to notable transfers and trades by large investors or “whales”. These movements, tracked by blockchain analysis platforms, shed light on potential investment strategies and trends in […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! The crypto market, featuring WIF coin and PEPE, witnessed significant activity on May 15 due to notable transfers and trades by large investors or “whales”. These movements, tracked by blockchain analysis platforms, shed light on potential investment strategies and trends in […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T11:19:43Z","categories":["wif","pepe","crypto","blockchain"],"article_link":"https://en.coinotag.com/whale-activity-alert-intense-buying-and-selling-of-wif-coin-wif-and-other-top-4-cryptocurrencies/","thumbnail_image":""},{"article_title":"Solana Staking Comes to Europe Through Robinhood’s New Crypto Offering","author":"Shalini Nagarajan","article_detailed_content":"Robinhood Crypto’s customers in Europe can now stake their Solana holdings and earn rewards, thanks to a new program launched Wednesday. The platform also introduced a rewards program to attract new customers. “Robinhood Crypto customers can now stake their Solana (SOL) holdings directly through the app, allowing them to earn rewards with the flexibility to unstake at any time,” the platform said in a statement. Solana staking enables individuals to earn rewards by retaining Solana cryptocurrency in their digital wallet. By staking Solana, individuals contribute to securing and upholding the Solana blockchain network. In exchange, they are rewarded with extra Solana tokens. Robinhood Woos European Users with Staking, Local Apps Additionally, the platform rolled out a suite of new features for European users, including staking, localized apps, crypto rewards for signing up, and revamped educational modules. To sweeten the deal, Robinhood Crypto is offering a 10% bonus in USDC on new users’ first month of crypto purchases. New rewards are capped at 500 euros. This perk aims to attract new customers and guide them on their crypto investment journey. Johann Kerbrat, vice president and general manager at Robinhood Crypto, said that the platform’s European customers wanted a localized app with staking features. Robinhood Crypto also revealed that the top traded coins in Europe are Bitcoin, Dogwifhat, Solana, and Ethereum. Interestingly, Bitcoin remains the most popular holding despite high trading volume in other options. SEC Scrutiny Looms Over Robinhood’s Booming Crypto Business Last week, Robinhood said its crypto trading boomed in the first quarter, with a 224% surge that drove its transaction-based revenue up 59% year-over-year to $329m. Crypto revenue itself surged 232% to $126m. The company also surpassed analyst expectations, reporting $618m in revenue, which beat estimates of $552.7m. However, Robinhood recently received a Wells Notice from the SEC, raising concerns about its crypto business. CFO Jason Warnick downplayed the impact, assuring users that customer accounts and crypto operations would continue as usual. The post Solana Staking Comes to Europe Through Robinhood’s New Crypto Offering appeared first on Cryptonews.","article_summary":"Robinhood Crypto’s customers in Europe can now stake their Solana holdings and earn rewards, thanks to a new program launched Wednesday. The platform also introduced a rewards program to attract new customers. The post Solana Staking Comes to Europe Through Robinhood’s New Crypto Offering appeared first on Cryptonews.","publisher":{"name":"Crypto News","logo":"https://t1.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://cryptonews.com/&size=64"},"creation_date":"2024-05-15T11:19:30Z","categories":["solana","crypto","sol","cryptocurrency","blockchain","usdc","bitcoin","dogwifhat","ethereum"],"article_link":"https://cryptonews.com/news/robinhood-crypto-solana-staking-europe-customers.htm","thumbnail_image":"https://cimg.co/wp-content/uploads/2024/05/15101708/1715768228-1715768145291_processed.jpg"},{"article_title":"Ripple (XRP) Fuels Crypto Education with Significant Investment in Morgan State University","author":"Lucien Renard","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Morgan State University has received a $1.05 million grant from Ripple, a leading player in the cryptocurrency industry. The funding will be used to support research projects at the university’s National FinTech Center, focusing on the intersection of blockchain, machine learning, […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Morgan State University has received a $1.05 million grant from Ripple, a leading player in the cryptocurrency industry. The funding will be used to support research projects at the university’s National FinTech Center, focusing on the intersection of blockchain, machine learning, […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T11:18:04Z","categories":["xrp","crypto","pepe","cryptocurrency","blockchain"],"article_link":"https://en.coinotag.com/ripple-xrp-fuels-crypto-education-with-significant-investment-in-morgan-state-university/","thumbnail_image":""},{"article_title":"Spot Ethereum ETFs at Risk: SEC Filing Points to Security Concerns","author":"Shota Oba","article_detailed_content":"A recent SEC filing has sparked concerns about the future of spot Ethereum ETFs, potentially shaking the crypto industry’s foundation. On May 13, Scott Johnsson from Davis Polk and Wardwell highlighted the SEC’s call for public input on classifying BlackRock’s proposed spot Ethereum ETF as a commodity-based trust. SEC’s Review on Ethereum ETFs Johnsson suggested that denying the ETFs could be a strategic move, as they might be misfiled as commodity-based trust shares. “The obvious purpose is to potentially deny on the basis that these spot filings are improperly filed as commodity-based trust shares and do not qualify if they are holding a security,” Johnsson explained. On the other hand, a recent BlackRock filing pointed to a possible SEC move to label ETH as a security. Such a classification could block the approval of spot Ethereum ETFs. A Bloomberg ETF analyst, Eric Balchunas, remarked that although riddled with legal terms, the filing signals a low chance for SEC approval of a spot Ethereum ETF. Balchunas emphasized, focusing on the classification issue: “The likelihood remains very low—slim to none,” he noted. Anticipation and Concerns Over ETF Approvals The SEC’s decision on the VanEck spot Ether ETF, due by May 23, is critical. It will likely influence other firms like ARK 21Shares and Hashdex. Grayscale’s recent withdrawal of its ETF application has added to the market’s uncertainty. VanEck’s CEO, Jan van Eck, has expressed concerns about regulatory challenges. Amid these events, SEC Chair Gary Gensler’s previous comments that ETH is not a security are under review. The commission is scrutinizing the altcoin’s status more closely. Gensler’s upcoming speech at the Investment Company Institute summit in Washington, D.C., could provide further clarity. Johnsson highlighted the SEC’s obligation under 15 U.S.C. 78s(b)(2)(B) to explain any potential rejections. The frequent issues in filings regarding Ethereum ETFs not being correctly classified as commodities indicate a shift in regulatory focus. Reactions vary within the industry. Standard Chartered has shown pessimism regarding the instrument’s approval, calling for more dialogue between the SEC and ETF applicants. Conversely, JPMorgan is optimistic but remains cautious about potential legal issues similar to those Grayscale encountered. Read more: Ethereum ETF Explained: What It Is and How It Works An April report revealed the SEC’s investigation into the Ethereum Foundation. The focus is on whether ETH should be considered a security. This inquiry could significantly affect the SEC’s final decision on Ethereum ETFs. As the VanEck application deadline approaches, the crypto community is on edge, eagerly awaiting the SEC’s verdict. This decision will not only affect the future of spot Ether ETFs but also set a precedent for the crypto market’s regulatory framework, highlighting the substantial stakes and potential for major changes. The post Spot Ethereum ETFs at Risk: SEC Filing Points to Security Concerns appeared first on BeInCrypto.","article_summary":"A recent SEC filing could classify Ether as a security, potentially blocking the approval of spot Ether ETFs, shaking the crypto industry's foundation, with a decision due by May 23. The post Spot Ethereum ETFs at Risk: SEC Filing Points to Security Concerns appeared first on BeInCrypto.","publisher":{"name":"Be(In)Crypto","logo":"https://t3.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://beincrypto.com/&size=64"},"creation_date":"2024-05-15T11:17:53Z","categories":["ethereum","crypto","eth"],"article_link":"https://beincrypto.com/sec-possible-denial-of-spot-ethereum-etfs/","thumbnail_image":"https://beincrypto.com/wp-content/uploads/2023/12/bic_Ethereum_ETH_3-covers_neutral.jpg"},{"article_title":"Ark ARKB’s $133.1 million surge leads Bitcoin ETFs to inflows","author":"James Van Straten","article_detailed_content":"Quick Take According to data from Farside, Bitcoin (BTC) exchange-traded funds (ETFs) witnessed an inflow of $100.5 million. This marks the largest inflow into these ETFs since May 6 and represents a consecutive day of inflows. Out of the 11 ETFs analyzed, six experienced positive inflows. The day belonged to Ark ARKB, which saw an impressive $133.1 million inflow, the largest since March 27, bringing its total inflows to $2.4 billion. Fidelity FBTC also recorded an $8.1 million inflow, taking its total net inflow to $8.2 billion. BlackRock IBIT, however, saw neither inflows nor outflows, according to Farside data. Farside reports that the Invesco Galaxy Bitcoin ETF (BTCO), Valkyrie Bitcoin Fund (BRRR), VanEck (HODL), and Franklin Templeton (EZBC) ETF all experienced inflows. On the other hand, Grayscale GBTC resumed outflows, witnessing a $50.9 million outflow, bringing its total net outflows to $17.7 billion. Overall, ETFs have now seen a total inflow of $11.8 billion. This development coincides with the recent investments by the State of Wisconsin Investment Board and Titan Global in spot Bitcoin ETFs. BTC ETF Flow Table: (Source: Farside) The post Ark ARKB’s $133.1 million surge leads Bitcoin ETFs to inflows appeared first on CryptoSlate.","article_summary":"Quick Take According to data from Farside, Bitcoin (BTC) exchange-traded funds (ETFs) witnessed an inflow of $100.5 million. This marks the largest inflow into these ETFs since May 6 and represents a consecutive day of inflows. Out of the 11 ETFs analyzed, six experienced positive inflows. The day belonged to Ark ARKB, which saw an […] The post Ark ARKB’s $133.1 million surge leads Bitcoin ETFs to inflows appeared first on CryptoSlate.","publisher":{"name":"Crypto Slate","logo":"https://t0.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://cryptoslate.com/&size=64"},"creation_date":"2024-05-15T11:15:45Z","categories":["bitcoin","btc","flow"],"article_link":"https://cryptoslate.com/insights/ark-arkbs-133-1-million-surge-leads-bitcoin-etfs-to-inflows/","thumbnail_image":"https://cryptoslate.com/wp-content/uploads/2024/05/ark-invest-etf.jpg"},{"article_title":"Pepe Coin Price Prediction as Trader Makes 15,718x Profit – Time to Buy PEPE?","author":"Simon Chandler","article_detailed_content":"The Pepe Coin price has risen by 3.5% today, reaching $0.00001114 on a day when the crypto market as a whole has dipped by a very slight 0.3%. PEPE is now up an impressive 41% in a week and by 102% in the last 30 days, with the meme coin’s movements enabling an early whale (or insider) to sell 255 billion tokens yesterday and earn themselves $2.3 million. Yet this same whale sits on a total haul of around 3.5 trillion PEPE, having posted an incredible 15,718x profit overall. And with PEPE hitting not only a new all-time high yesterday but also a new ATH of $0.00001151 earlier this morning, its momentum looks like it will continue in the short—and medium-term. Pepe Coin Price Prediction as Trader Makes 15,718x Profit – Time to Buy PEPE? PEPE’s price continues to look incredibly bullish, and while this may ordinarily suggest an incoming fall, we said something similar yesterday. Yet it still looks very strong, with its 30-day average (orange) racing steeply beyond its 200-day average (blue), a sign that it remains in a bullish expansionary phase. Source: TradingView PEPE’s relative strength index (purple) also remains very positive, having neared 90 a couple of days ago but still holding above 60 up until now. And what’s unique about PEPE is that, unlike most other top-100 coins, it has actually surpassed its highs from early March. There are a couple of interrelated reasons for this, with the first being that whales have been accumulating – and pumping – PEPE in recent weeks. In addition, this week saw the return of legendary meme-stock trader ‘Roaring Kitty’ to X, creating an expectation that we may have a meme season on our hands. pic.twitter.com/YgjVqtgcNS — Roaring Kitty (@TheRoaringKitty) May 13, 2024 Such a season is also something we saw in the wake of the infamous GameStop rally of 2021, and while there’s no real indication that Roaring Kitty – real name Keith Gill – is going to do something similar very soon, it seems as though the market is preparing for such a possibility. And PEPE has been one of the biggest beneficiaries so far, although it has long been one of the more popular vehicles for whales and larger traders. As noted above, one big whale is still sitting on a trove of 3.5 trillion PEPE, implying that they expect it to continue rising over the medium and long term. Earned more than $46M on $PEPE with only $3K, a gain of 15,718x! This super big winner sold 255B $PEPE($2.3M) for profits again after the price of $PEPE increased. He spent only $3K to buy 4.9T $PEPE($56M currently) on Apr 15, 2023, and sold 1.41T $PEPE for $7.4M, with 3.5T… pic.twitter.com/VKGxmK9gCt — Lookonchain (@lookonchain) May 15, 2024 It should continue its ascent for the foreseeable future, with the Pepe Coin price likely to reach a new ATH by the end of the week. Newer Meme Coins May Take Lead PEPE is certainly one of the alts to watch right now, but it isn’t the only promising coin in the market today, with various newer meme tokens looking set to rally in the near future. In fact, there are a handful of new meme coins which are currently holding their presales, with some raising substantial sums of money and generating plenty of hype. Possibly the most exciting right now is Dogeverse (DOGEVERSE), a multi-chain token that has raised over $15 million in its token offering. Source: Dogeverse There are two main ways in which DOGEVERSE separates itself from the original Dogecoin, with the first being that it will run on Ethereum, Polygon, BNB Chain, Solana, Avalanche and Base. This existence on several chains means that it could gain much more traction than it would have otherwise, with the coin potentially seeing use on a wider pool of apps and trading platforms. On top of this, DOGEVERSE is a deflationary meme coin, with a fixed supply of only 120 million tokens. In combination with the potentially greater demand, this fixed supply could squeeze the coin’s price upwards over time. This could particularly be the case in conjunction with the ability to stake the token, something which could see a huge chink of its overall supply leave circulation. As such, DOGEVERSE is really shaping up to be one of the biggest meme coin listings of the year, as indicated by its big raise. Newcomers still have the chance to get involved by going to the official Dogeverse website, where 1 DOGEVERSE is $0.00031. Buy DOGEVERSE Today The post Pepe Coin Price Prediction as Trader Makes 15,718x Profit – Time to Buy PEPE? appeared first on Cryptonews.","article_summary":"The Pepe Coin price has risen by 3.5% today, reaching $0.00001114 on a day when the crypto market as a whole has dipped by a very slight 0.3%. The post Pepe Coin Price Prediction as Trader Makes 15,718x Profit – Time to Buy PEPE? appeared first on Cryptonews.","publisher":{"name":"Crypto News","logo":"https://t1.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://cryptonews.com/&size=64"},"creation_date":"2024-05-15T11:15:13Z","categories":["pepe","crypto","near","token","dogecoin","ethereum","polygon","bnb","solana","avalanche"],"article_link":"https://cryptonews.com/news/pepe-coin-price-prediction-as-trader-makes-15718x-profit-time-to-buy-pepe.htm","thumbnail_image":"https://cimg.co/wp-content/uploads/2024/05/15101603/1715768163-pepe-coin-price-prediction-as-trader-makes-15718x-profit-time-to-buy-pepe.jpg"},{"article_title":"Ripple’s CLO optimistic about SEC case, CryptoJack predicts Solana high, new memecoin shakes the crypto world","author":"Guest Post","article_detailed_content":"Ripple's CLO expresses confidence about the outcome of the SEC case; CryptoJack expects Solana to reach a new peak, while KangaMoon raises excitement in the crypto community. #sponsoredcontent","article_summary":"Ripple's CLO expresses confidence about the outcome of the SEC case; CryptoJack expects Solana to reach a new peak, while KangaMoon raises excitement in the crypto community. #sponsoredcontent","publisher":{"name":"Crypto.news","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://crypto.news/&size=64"},"creation_date":"2024-05-15T11:13:21Z","categories":["solana","crypto"],"article_link":"https://crypto.news/ripples-clo-optimistic-about-sec-case-cryptojack-predicts-solana-high-new-memecoin-shakes-the-crypto-world/","thumbnail_image":"https://crypto.news/app/uploads/2023/11/crypto-news-The-US-Securities-and-Exchange-Commission-SEC06.webp"},{"article_title":"Stablecoin Issuer Circle Files to Shift Legal Home to U.S. From Ireland Ahead of Planned IPO: Bloomberg","author":"Jamie Crawley","article_detailed_content":"Circle recently filed court paperwork to make the move, according to a company spokesperson.","article_summary":"Circle recently filed court paperwork to make the move, according to a company spokesperson.","publisher":{"name":"CoinDesk","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.coindesk.com/&size=64"},"creation_date":"2024-05-15T11:12:36Z","categories":["general"],"article_link":"https://www.coindesk.com/business/2024/05/15/stablecoin-issuer-circle-files-to-shift-legal-home-to-us-from-ireland-ahead-of-planned-ipo-bloomberg/?utm_medium=referral&utm_source=rss&utm_campaign=headlines","thumbnail_image":"https://www.coindesk.com/resizer/3M-dGxSFn7Txle4fBrBerTi5K4k=/800x600/cloudfront-us-east-1.images.arcpublishing.com/coindesk/4DGGUGUWR5CNFPFPRFSUF2TK7Q.jpg"},{"article_title":"The Sandbox Vietnam Partners with AI.Society to Propel the Web3 Frontier and Enrich the Metaverse Experience","author":"Advertorial","article_detailed_content":"The Sandbox, a leading platform in the virtual world and blockchain-based metaverse, is excited to announce an exclusive partnership with AI.Society, an innovative AI platform that combines the metaverse and AI offering users customized digital experience where AI NPCs assist users in various services. This strategic alliance is set to redefine the boundaries of the metaverse by merging cutting-edge AI and blockchain technologies to create unique user experiences and sustainable digital environments. This partnership will unleash a series of collaborative initiatives aimed at expanding both brands’ presence and engagement within the digital landscape. Members of both communities can look forward to exclusive community events, and tailored NFT drops for AI.Society token ($AIS) holders, and additional unique NFT, staking programs, and reward opportunities for users invested in both ecosystems with $SAND and $AIS tokens. Furthermore, AI.Society plans to enhance the virtual realm by acquiring LAND in The Sandbox to develop bespoke and innovative experiences, emphasizing the seamless integration of AI enhancements. These initiatives are not only focused on enriching the user’s digital asset experience but also aimed at fostering sustainable practices and promoting educational endeavors within the metaverse. This future-looking partnership is committed to setting new standards in the integration of technology and user engagement. “The Sandbox Vietnam’s partnership with AI.Society marks a significant milestone in our journey to enrich the metaverse ecosystem,” said Cris D. Tran, Head of Growth for The Sandbox Vietnam. “Together, we are set to deliver unprecedented experiences that harness the potential of AI and blockchain technologies.” William Nguyen, founder of AI.Society, added, “This collaboration with The Sandbox Vietnam aligns perfectly with our vision to integrate AI innovations in everyday digital interactions. We are excited to embark on this journey that promises not only to enhance our platform’s offerings but also to pioneer new standards in the digital world.” About AI.Society AI.Society is an innovative AI platform that combines the metaverse, AI NPCs, and user-operated nodes. It offers a customized digital experience where AI NPCs assist users in various services. Users can create their virtual spaces and decentralized nodes to power AI Engine. About The Sandbox The Sandbox is a metaverse where players can create, own, and monetize their virtual assets and experiences using non-fungible tokens (NFTs) and blockchain technology. Empowering users with intuitive creative tools,The Sandbox enables users to build their own immersive gaming experiences, socialize with other players, and participate in a vibrant digital economy. To find out more about AI.Society: Website | Twitter | Telegram To find out more about The Sandbox Vietnam: Facebook | Telegram | Twitter | Medium The post The Sandbox Vietnam Partners with AI.Society to Propel the Web3 Frontier and Enrich the Metaverse Experience appeared first on BeInCrypto.","article_summary":"The Sandbox, a leading platform in the virtual world and blockchain-based metaverse, is excited to announce an exclusive partnership with AI.Society, an innovative AI platform that combines the metaverse and AI offering users customized digital experience where AI NPCs assist users in various services. This strategic alliance is set to redefine the boundaries of the … Continued The post The Sandbox Vietnam Partners with AI.Society to Propel the Web3 Frontier and Enrich the Metaverse Experience appeared first on BeInCrypto.","publisher":{"name":"Be(In)Crypto","logo":"https://t3.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://beincrypto.com/&size=64"},"creation_date":"2024-05-15T11:11:43Z","categories":["web3","metaverse","ai","blockchain","nft","token","sand"],"article_link":"https://beincrypto.com/the-sandbox-vietnam-partners-with-ai-society/","thumbnail_image":"https://beincrypto.com/wp-content/uploads/2024/05/image-116.png"},{"article_title":"PayRetailers Expands into Africa, Boosting Market Presence and Potential for Crypto Transactions with Bitcoin (BTC)","author":"Marisol Navaro","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! PayRetailers Announces Expansion into Africa to Enhance Its Market Presence PayRetailers, a leading payment processor, is expanding its operations into Africa. The company is now operational in Rwanda, Zambia, Uganda, and Tanzania, offering advanced payment solutions to businesses. This move is […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! PayRetailers Announces Expansion into Africa to Enhance Its Market Presence PayRetailers, a leading payment processor, is expanding its operations into Africa. The company is now operational in Rwanda, Zambia, Uganda, and Tanzania, offering advanced payment solutions to businesses. This move is […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T11:05:13Z","categories":["crypto","bitcoin","btc","pepe"],"article_link":"https://en.coinotag.com/payretailers-expands-into-africa-boosting-market-presence-and-potential-for-crypto-transactions-with-bitcoin-btc/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-4.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Interactive Brokers Brings Crypto Trading to UK Customers","author":"Arnab Shome","article_detailed_content":"Interactive Brokers (Nasdaq: IBKR) has expanded its offerings on its platform in the United Kingdom by launching cryptocurrency trading. Investors, both individuals and institutional, onboarded under the brokerage's UK entity can now trade four cryptocurrencies: Bitcoin, Ethereum, Litecoin, and Bitcoin Cash. Expansion of Crypto Trading Announced today (Wednesday), the US-headquartered broker has introduced crypto services in partnership with Paxos, similar to its services in its home country. Although offered in partnership with a third-party crypto exchange, Interactive Brokers highlighted that its users can trade cryptocurrencies along with instruments of other asset classes from the same brokerage account. “Introducing cryptocurrency trading gives UK clients enhanced flexibility to invest across markets and asset classes while also adding exposure to digital assets,” said Gerald Perez, CEO of Interactive Brokers' UK entity. Interactive Brokers is not the only broker to expanse its crypto services. Recently Robinhood also launched staking services under its crypto platfrom for its customers in Europe. Low Fees For the cryptocurrency trades, Interactive Brokers promises a commission between 0.12 percent and 0.18 percent of the trade value, with a minimum of $1.75 per order. It also clarified that there will not be added spreads, custody fees, or markups. It further highlighted that cryptocurrencies are denominated in USD on its platforms. However, it will allow its UK clients to convert GBP to USD with tight spreads of up to 1/10 of a pip. Interactive Brokers is a popular brokerage brand with a global presence. The platform first offered cryptocurrency trading in September 2021, a service it launched with its Paxos partnership. Last year, it teamed up with Zero Hash, a crypto infrastructure platform, to offer crypto trading and custody services. The Hong Kong-registered entity of Interactive Brokers also obtained a local licence in the autonomous region to offer retail crypto trading. Apart from its offerings with third-party crypto partners, the broker is allowing its customers to take exposure to Bitcoin, investing in the Bitcoin exchange-traded funds (ETFs) approved by the US Securities and Exchange Commission. Meanwhile, total revenue at Interactive Brokers was up 42 percent to $4.3 billion in 2023, which compares very favourably with the 5 percent rise recorded by IG in its last fiscal year, Saxo’s 11 percent, and Fidelity’s 12 percent increase. This article was written by Arnab Shome at www.financemagnates.com.","article_summary":"Interactive Brokers (Nasdaq: IBKR) has expanded its offerings on its platform in the United Kingdom by launching cryptocurrency trading. Investors, both individuals and institutional, onboarded under the brokerage's UK entity can now trade four cryptocurrencies: Bitcoin, Ethereum, Litecoin, and Bitcoin Cash. Expansion of Crypto Trading Announced today (Wednesday), the US-headquartered broker has introduced crypto services in partnership with Paxos, similar to its services in its home country. Although offered in partnership with a third-party crypto exchange, Interactive Brokers highlighted that its users can trade cryptocurrencies along with instruments of other asset classes from the same brokerage account. “Introducing cryptocurrency trading gives UK clients enhanced flexibility to invest across markets and asset classes while also adding exposure to digital assets,” said Gerald Perez, CEO of Interactive Brokers' UK entity. Interactive Brokers is not the only broker to expanse its crypto services. Recently Robinhood also launched staking services under its crypto platfrom for its customers in Europe. Low Fees For the cryptocurrency trades, Interactive Brokers promises a commission between 0.12 percent and 0.18 percent of the trade value, with a minimum of $1.75 per order. It also clarified that there will not be added spreads, custody fees, or markups. It further highlighted that cryptocurrencies are denominated in USD on its platforms. However, it will allow its UK clients to convert GBP to USD with tight spreads of up to 1/10 of a pip. Interactive Brokers is a popular brokerage brand with a global presence. The platform first offered cryptocurrency trading in September 2021, a service it launched with its Paxos partnership. Last year, it teamed up with Zero Hash, a crypto infrastructure platform, to offer crypto trading and custody services. The Hong Kong-registered entity of Interactive Brokers also obtained a local licence in the autonomous region to offer retail crypto trading. Apart from its offerings with third-party crypto partners, the broker is allowing its customers to take exposure to Bitcoin, investing in the Bitcoin exchange-traded funds (ETFs) approved by the US Securities and Exchange Commission. Meanwhile, total revenue at Interactive Brokers was up 42 percent to $4.3 billion in 2023, which compares very favourably with the 5 percent rise recorded by IG in its last fiscal year, Saxo’s 11 percent, and Fidelity’s 12 percent increase. This article was written by Arnab Shome at www.financemagnates.com.","publisher":{"name":"Finance Magnates","logo":"https://t1.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.financemagnates.com/&size=64"},"creation_date":"2024-05-15T11:03:56Z","categories":["crypto","cryptocurrency","bitcoin","ethereum","litecoin"],"article_link":"https://www.financemagnates.com//cryptocurrency/interactive-brokers-brings-crypto-trading-to-uk-customers/","thumbnail_image":""},{"article_title":"Crypto is Donald Trump’s New Found Love ahead of US elections","author":"Rajpalsinh","article_detailed_content":"Donald J. Trump, former president of the United States and arguably the most contentious politician on the internet, has turned to the crypto community to seek support for the 2024 US presidential elections. Once known to be a fierce crypto critic, Trump has now turned into a supporter of cryptocurrencies and has attacked the Biden administration for the “crackdown” on the industry. Earlier, Trump had termed Crypto as a “scam” when compared to US dollar but today, as he seeks mass support for elections, he asked the crypto enthusiasts in the US to “better vote for him.” While politicians are known to flip on their erstwhile policies or ideological stances, critics of Trump have been left wondering what could be the reasons behind him expressing his love for crypto openly. Is it just a poll plank or Trump has other plans for the crypto ecosystem if he comes back to power in 2024. So far, the current Democratic government has been slow to embrace crypto innovation and has also taken stringent action against various crypto related exchanges and businesses. Trump is the presumptive nominee for the Republican Party who is slated to contest against incumbent president Joe Biden from the Democratic party. As the poll fever rises in the US, it will be interesting to see whether Trump will be able to form a connection with the crypto community that is majorly upset with the current government’s stringent policies. In this article, we will delve deep into the politics of crypto and understand the intricacies of the Trump campaign and why crypto matters in this US election. Donald Trump Is Ready To Embrace Crypto Innovations During an NFT event hosted by former U.S. President Donald Trump on May 8, he asked the cryptocurrency users to support his candidacy. The event took place at a dinner gala commemorating Trump’s Mugshot Edition NFT collection. In response to inquiries about accepting cryptocurrency for campaign contributions, Trump expressed his stance in facilitating such crypto transactions. “If you can’t, I’ll make sure you can,” Trump addressed the attendees. He was informed that many crypto businesses were moving out offshore due to stringent regulations. Trump stated, “We’ll stop it. We don’t want that… we’re going to embrace it.” i asked donald trump how he’s going to keep crypto businesses in america. sounds bullish 🇺🇸 pic.twitter.com/rvuztPmQ8P — Malcolm (33.3%) (@macdegods) May 9, 2024 Donald Trump has been actively appealing to cryptocurrency enthusiasts in his recent speeches, highlighting a significant pivot from his previous critical stance on digital currencies. The new approach of Trump contrasts with his earlier statements, such as when he referred to Bitcoin as a “scam” competing against the dollar. Moreover, Trump has also been vocal about embracing cryptocurrencies more broadly if re-elected, signalling a more crypto-friendly administration. He has mentioned accepting campaign donations in cryptocurrencies. This signature shift in Trump’s stance will help him attract tech-savvy voters. The approach also aligns with the broader Republican push for lighter regulations on digital assets. This change in Trump’s view is viewed as an attempt to attract voters who lean towards libertarian views and those who are unhappy with how the current Biden’s administration is handling cryptocurrency rules. However, Donald Trump has made clear his opposition to the creation of a U.S. Central Bank Digital Currency (CBDC). He has vocally declared that he would “never allow” the Federal Reserve to create a CBDC, arguing that it would lead to governmental overreach into people’s personal financial privacy and freedom. Trump’s stance is that such a digital currency would grant the federal government too much control over individual financial transactions, which he views as a direct threat to personal liberties. Support from Other Republican Members for Cryptocurrency Over the years, various Republican members have shown support for cryptocurrencies. The Republican stance tends to favor less government interference and more privacy for individuals, aligning well with the decentralized nature of cryptocurrencies. For instance, Tom Emmer, a popular Republican congressman, has actively opposed the CBDC. This reflects a sentiment within the party that also highlights Trump’s concerns about privacy. Emmer has even introduced legislation aimed at preventing the government from establishing a CBDC that would infringe on financial privacy. In the broader Republican arena, there’s a growing endorsement of blockchain and cryptocurrencies as tools that could ensure financial privacy and reduce governmental oversight. This aligns with the traditional conservative emphasis on personal freedom and minimal government intervention. Republican leaders have been vocal about their stances on cryptocurrency. Here are the some of their statement summary: Rep. Tom Emmer (R-Minnesota) As a co-chair of the Congressional Blockchain Caucus, Emmer has been a strong advocate for cryptocurrencies, highlighting the potential for crypto to decentralize control. He has expressed support for fostering innovation in the financial technology sector, particularly around blockchain and cryptocurrencies. Rep. French Hill (R-Arkansas) Hill has shown interest in ensuring that the fintech sector remains robust in the U.S., advocating for the country to be a leader in blockchain and financial technology without over-regulating the industry. Sen. Ted Cruz (R-Texas) Cruz has been outspoken about his positive view of Bitcoin, seeing it as a vehicle for investment and financial independence. He also highlighted the benefits of bitcoin mining for the electrical grid’s resilience in Texas. Sen. J.D. Vance (R-Ohio) Vance has pointed out the freedom that the crypto sector offers, particularly as a space where conservatives and free thinkers can operate without facing undue pressure from progressive social movements. Support from Crypto Community, Joining ‘Stand With Crypto’ Campaign David Bailey, the CEO of Bitcoin Magazine, has disclosed his involvement in Donald Trump’s campaign efforts. He and his team advised Trump on developing a pro-Bitcoin and cryptocurrency platform, including the suggestion to sign a crypto-focused executive order on his first day as president. Bailey explained that the crypto community’s support is driven more by their opposition to Biden’s cryptocurrency policies in the upcoming elections rather than direct support for Trump. MoonPay has also recently endorsed Coinbase’s “Stand With Crypto” campaign, which includes a political action committee (PAC) launched to support pro-crypto candidates in the upcoming 2024 U.S. elections. Ivan Soto-Wright, CEO of MoonPay, emphasized the importance of this election for the cryptocurrency industry and announced a significant contribution aimed at developing a regulatory framework that encourages innovation while protecting consumers. The “Stand With Crypto” PAC, powered by Coinbase, has already made notable strides, raising over $86 million to support candidates favorable to cryptocurrency. This effort is part of a broader strategy to shape a favorable political and regulatory environment for the crypto industry, particularly in light of Coinbase and Binance’s ongoing regulatory challenges. Despite facing legal battles with the SEC and new lawsuits alleging investor fraud, Coinbase continues its efforts to support crypto-friendly political candidates. Through its backing of Coinbase’s campaign, MoonPay demonstrates its commitment to advancing the cryptocurrency industry by fostering a regulatory landscape that can nurture innovation and consumer protection. Donald Trump’s Opposition to CBDCs Trump’s opposition to CBDCs is part of a larger narrative among conservatives who fear that such technologies could enhance governmental control over personal finances and threaten privacy. He has consistently accused his opposition as a stand to protect American freedoms. This perspective is not only his but is shared by other leading figures in the Republican Party who have proposed alternative methods to address financial issues without the need to introduce a CBDC. Conclusion Overall, Trump’s and the Republican Party’s approach to cryptocurrency reflects a complex interplay of promoting technological innovations that enhance privacy while opposing governmental initiatives that could impose on personal freedoms. Their support for cryptocurrencies contrasts sharply with their strong opposition to government-controlled digital currencies. This highlights a big difference in beliefs about the future of financial technologies in American politics.","article_summary":"Donald J. Trump, former president of the United States and arguably the most contentious politician on the internet, has turned to the crypto community to seek support for the 2024 US presidential elections. Once known to be a fierce crypto critic, Trump has now turned into a supporter of cryptocurrencies and has attacked the Biden […]","publisher":{"name":"Crypto Times","logo":"https://logo.clearbit.com/www.cryptotimes.io?size=96"},"creation_date":"2024-05-15T11:00:31Z","categories":["crypto","nft","cryptocurrency","gala","bitcoin","blockchain"],"article_link":"https://www.cryptotimes.io/2024/05/15/crypto-is-donald-trump-new-found-love-ahead-of-us-elections/","thumbnail_image":"https://www.cryptotimes.io/wp-content/uploads/2024/05/DT-1024x576.jpg"}]}