{"count":9690,"totalPages":323,"currentPage":10,"articles":[{"article_title":"Degen Chain Back Online After Two-Day Hiatus","author":"Sam Reynolds","article_detailed_content":"The layer-3 blockchain for meme coins was offline for over 50 hours.","article_summary":"The layer-3 blockchain for meme coins was offline for over 50 hours.","publisher":{"name":"CoinDesk","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.coindesk.com/&size=64"},"creation_date":"2024-05-15T09:47:46Z","categories":["blockchain"],"article_link":"https://www.coindesk.com/business/2024/05/15/degen-chain-back-online-after-two-day-hiatus/?utm_medium=referral&utm_source=rss&utm_campaign=headlines","thumbnail_image":"https://www.coindesk.com/resizer/hSfj7enGimoe0JCusqtiC6hw5Rw=/800x600/cloudfront-us-east-1.images.arcpublishing.com/coindesk/OOD7XWUB2BFZDOFOXH4M6SH2HA.jpg"},{"article_title":"Google I/O 2024 Unveils Gemini 1.5 Pro Enhanced Features","author":"Dishita Malvania","article_detailed_content":"Gemini, Google’s artificial intelligence model, is being integrated into various technologies across the tech giant’s ecosystem, including Gmail, YouTube, and its smartphones. During his keynote speech at Google’s I/O 2024 developer conference on May 14, CEO Sundar Pichai highlighted several upcoming deployments of the AI model, emphasizing the importance of AI, he mentioned AI 121 times during his 110-minute presentation, with Gemini taking the spotlight. Launched in December, Gemini is set to become a central component of Google’s services. Google is integrating this large language model (LLM) into nearly all of its products, including Android, Search, and Gmail. Users can expect the following in the future. Gemini A year ago, at the I/O stage, plans for Gemini were unveiled — a frontier model designed to be natively multimodal, capable of reasoning across various inputs. Since then, Gemini models have been introduced, showcasing top-notch performance on multimodal benchmarks. Gemini 1.5 Pro followed, offering a significant advancement in processing long context. With over 1.5 million developers now using Gemini across various tools, its capabilities are being utilized for debugging, gaining insights, and creating the next generation of AI applications. Product Progress and App Interactions Gemini’s functionality is expanding to include seamless interaction with applications. In the upcoming update, users will enjoy the convenience of asking Gemini to perform tasks like effortlessly dragging and dropping AI-generated images into messages. Additionally, YouTube users will have the ability to prompt Gemini to extract specific information directly from videos by selecting the “Ask this video” option. Gemini Live and Gemini in Gmail Gmail is incorporating AI integration through a new feature called Gemini. With Gemini, users will have the ability to search, summarize, and compose emails using advanced AI assistance. Moreover, the AI assistant will handle more intricate tasks like aiding in e-commerce returns by searching for relevant emails, locating receipts, and completing online forms. Google recently introduced an innovative feature named Gemini Live, offering users the opportunity to engage in extensive voice conversations with AI directly on their smartphones. This chatbot is designed to seamlessly accommodate interruptions for further clarification during responses, while also dynamically adjusting to users’ speech nuances in real-time. Moreover, Gemini possesses the capability to interpret and respond to the physical environment by analyzing photos or videos captured by the device. Multimodality Developments Google is currently engaged in the development of advanced AI agents capable of sophisticated reasoning, planning, and execution of complex tasks with user oversight. These agents are designed to handle various input modalities such as text, images, audio, and video, expanding their capabilities beyond traditional text-based interactions. Sundar Pichai, CEO of Google & Alphabet stated, “The power of Gemini — with multimodality, long context, and agents — brings us closer to our ultimate goal: making AI helpful for everyone.” A notable addition is the “Ask Photos” feature, enabling users to search their photo libraries using natural language queries. Powered by Gemini, this feature leverages contextual understanding, object and facial recognition, and summarization capabilities to provide relevant responses to user inquiries about their photo memories. Additionally, Google Maps is set to benefit from AI-generated summaries of places and regions, leveraging insights derived from the platform’s extensive mapping data. These summaries aim to provide users with concise and informative overviews, enriching their navigation experiences. Also Read: Elon Musk’s xAI Nearing $10B Oracle Cloud Server Lease Deal","article_summary":"Introduced Gemini models excel in multimodal benchmarks; Gemini 1.5 Pro advances long-context processing.","publisher":{"name":"Crypto Times","logo":"https://logo.clearbit.com/www.cryptotimes.io?size=96"},"creation_date":"2024-05-15T09:46:48Z","categories":["ai"],"article_link":"https://www.cryptotimes.io/2024/05/15/google-i-o-2024-unveils-gemini-1-5-pro-enhanced-features/","thumbnail_image":"https://www.cryptotimes.io/wp-content/uploads/2024/05/Four_things_Google_Gemini_users_will_be_able_to_do_soon-1024x576.jpg"},{"article_title":"Coinbase Director Reveals 1 Million New Tokens Were Created in April","author":"Harsh Notariya","article_detailed_content":"Coinbase Director Conor Grogan announced that nearly 1 million new cryptocurrency tokens emerged last month. This number is twice the total created on the Ethereum blockchain from 2015 to 2023. These developments underscore the volatile and often precarious nature of investing in new crypto ventures. New Meme Coins Take Over Crypto Market Grogan highlighted these figures through the Dune dashboard chat, indicating a significant expansion in the crypto sector. The bulk of this surge in token creation occurred on the Ethereum and Solana blockchains. Specifically, Ethereum saw 376,642 new tokens, while Solana experienced an average daily creation of over 20,000 tokens. Notably, 886% of the new tokens on the Ethereum blockchain, amounting to 327,553, debuted on Coinbase’s layer-2 network, Base. This platform has attracted many developers, especially those focusing on meme coins, due to its reduced operational costs. Read more: 7 Best Base Chain Meme Coins to Watch in 2024 New Tokens by Blockchain. Source: Dune Furthermore, the total value locked (TVL) on Base has soared by 627% since the beginning of the year, now reaching a remarkable $5.4 billion, according to L2beat. Meme coins are the primary reason for this increase. However, the crypto community has also criticized the rapid proliferation of meme coins. Many in the community view these tokens as high-risk, pointing out that they are often scams to exploit trading bots and inexperienced investors. “Most of them are just spam to farm sniper bots. I saw a guy launching tokens with gibberish names on base just to rug-pull bots that auto-bought,” an X user commented on Grogan’s post. Moreover, the regulatory environment has been less stringent for meme coins compared to more traditional or innovative crypto projects. Chris Dixon of Andreessen Horowitz has criticized this regulatory approach, arguing that it fosters an ecosystem rife with trivial projects at the expense of more meaningful, blockchain-based solutions. Investing in this market involves substantial risks. Crypto Koryo, a data scientist, emphasizes the high-risk, low-reward nature of meme coin investments. The barrier to creating new coins has significantly lowered, leading to market saturation. “Back then, deploying an ERC-20 token wasn’t something the average Joe could easily do. But today, anybody can do it,” Koryo states. Koryo advises investors to diversify substantially if they choose to engage with meme coins. He warns that without adequate diversification, an investor’s portfolio could drop to zero. Read more: Crypto Scam Projects: How To Spot Fake Tokens Moreover, on-chain sleuth ZachXBT recently reported that developers abandoned several meme coin projects on the Solana blockchain. This led to a staggering $26.7 million loss for investors. The post Coinbase Director Reveals 1 Million New Tokens Were Created in April appeared first on BeInCrypto.","article_summary":"Coinbase Director Conor Grogan announces nearly 1 million new cryptocurrency tokens, emphasizing the volatile investment nature and the significant role of meme coins. The post Coinbase Director Reveals 1 Million New Tokens Were Created in April appeared first on BeInCrypto.","publisher":{"name":"Be(In)Crypto","logo":"https://t3.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://beincrypto.com/&size=64"},"creation_date":"2024-05-15T09:43:21Z","categories":["cryptocurrency","ethereum","blockchain","crypto","token","solana"],"article_link":"https://beincrypto.com/1-million-new-crypto-tokens-april/","thumbnail_image":"https://beincrypto.com/wp-content/uploads/2024/01/bic_Altcoin_Season-covers_grow_up.png"},{"article_title":"Notcoin: A Deep Dive into the Community Token and Staking Opportunities","author":"Alex Orguno","article_detailed_content":"Notcoin started as a viral Telegram game that introduced millions to the world of web3 through a unique tap-to-earn mining mechanic. As a community token, $NOT aims to foster engagement, play, and contribution within its ecosystem. With the upcoming launch on Binance Launchpool, users can stake BNB and FDUSD to farm Notcoin tokens, making it an exciting opportunity for crypto enthusiasts. This article will explore the origins, mechanics, and future prospects of Notcoin, as well as the specifics of the staking process on Binance. Origins of Notcoin Notcoin emerged as a simple yet addictive game within the Telegram messaging app. Developed by Open Builders, the game invited users to tap a golden coin displayed on their screens to earn an in-game currency called Notcoin. This tap-to-earn mechanism quickly gained traction, attracting 35 million total players and peaking at six million daily active users. The game’s success can be attributed to its straightforward gameplay, community engagement, and the promise of future crypto rewards. Gameplay Mechanics Players begin by opening the Telegram app and tapping the Notcoin bot. A golden coin appears on the screen, which players tap to earn Notcoin. Energy depletes with each tap and refills slowly over time, preventing endless clicking. Players can boost their earnings through daily “Full Energy” and “Turbo” boosts or by purchasing permanent boosts with Notcoin. Additionally, players climb a global leaderboard divided into tiers, from Silver to Diamond league. Completing quests, such as following a Twitter account or joining a Telegram community, also earns extra tokens. Cosmetic upgrades, like changing the game’s background or the appearance of the coin, can be purchased with Notcoin, enhancing the user experience. Transition to $NOT Token The culmination of Notcoin’s in-game efforts is the transition to the $NOT token, set to launch on The Open Network (TON). Unlike many crypto projects with early whales, Notcoin aims for fair distribution by airdropping 100% of the $NOT tokens to the community. The total supply of $NOT is 102,719,221,714, with an equal circulating supply upon listing. However, this does not mean all tokens will immediately enter trading; unclaimed airdrops and other allocations will gradually enter the secondary market. Staking BNB and FDUSD to Farm Notcoin Tokens As part of the Binance Launchpool, users can stake BNB and FDUSD to farm $NOT tokens. The staking process is simple and rewards participants with a significant portion of the total token supply. Here are the details: Staking Period and Rewards Farming Period: May 13, 2024, 00:00 (UTC) to May 15, 2024, 23:59 (UTC). Total Rewards: 3,081,576,650 NOT tokens. Stake BNB: 2,619,340,153 NOT (85% of rewards). Stake FDUSD: 462,236,497 NOT (15% of rewards). How to Participate Register on Binance: Create an account on Binance using the referral link: Binance Registration. Stake BNB or FDUSD: Visit the Launchpool webpage (available 24 hours before the farming starts) and stake your BNB or FDUSD. Earn Rewards: Tokens will be distributed daily based on the amount of BNB or FDUSD staked. Listing on Binance After the farming period, $NOT will be listed on Binance on May 16, 2024, at 12:00 (UTC). Trading pairs will include NOT/BTC, NOT/USDT, NOT/BNB, NOT/FDUSD, and NOT/TRY. The Seed Tag will be applied to $NOT, indicating its potential for significant growth. The Broader Ecosystem and Future Prospects Explore, Play, Contribute, and Offer Notcoin’s ecosystem revolves around four key pillars: Explore: Users earn rewards by discovering new web3 products. Play: Participation in games yields additional rewards. Contribute: Adding value to the ecosystem through various means also earns rewards. Offer: Web3 builders can promote their products through Notcoin campaigns. Integration with Other Projects Notcoin plans to integrate with other web3 projects, allowing users to earn rewards by engaging with different content. These projects will need to purchase NOT tokens on the open market and deposit them into a smart contract to activate these features. Pre-Market Vouchers Before the $NOT token launch, Notcoin introduced NFT vouchers. Players with over 10 million Notcoin could convert their coins into vouchers, which can be traded before the token launch. This system allows high-level players to speculate on the future value of $NOT. Future Developments Post-launch, Notcoin’s gameplay will resume with some changes. While no new tokens will be minted, companies can sponsor in-game rewards to gain exposure to Notcoin’s vast audience. Additionally, Open Builders plans to introduce trading bot functionality, enabling users to buy and sell crypto tokens directly within Telegram. Personal Opinions and Price Predictions Given Notcoin’s massive user base and the fair distribution model, the $NOT token has significant growth potential. The token’s price could initially range between $0.002 to $0.003, with an all-time high (ATH) around $0.004. With a market cap potentially between $400 million to $500 million, $NOT presents an exciting investment opportunity. Conclusion Notcoin’s journey from a viral Telegram game to a community-driven token on Binance Launchpool exemplifies the innovative potential of web3 projects. By staking BNB and FDUSD, users can farm $NOT tokens and participate in a dynamic ecosystem that rewards exploration, play, and contribution. With its upcoming listing on Binance and plans for future integrations, Notcoin is poised to become a significant player in the crypto space. For more information on how to participate in the airdrop, visit the official Binance announcement and research pages: Binance Research on Notcoin Binance Support Announcement Join the Notcoin community and start your journey into the exciting world of web3 today!","article_summary":"Notcoin started as a viral Telegram game that introduced millions to the world of web3 through a unique tap-to-earn mining mechanic. As a community token, $NOT aims to foster engagement, play, and contribution within its ecosystem. With the upcoming launch on Binance Launchpool, users can stake BNB and FDUSD to farm Notcoin tokens, making it […]","publisher":{"name":"Bitcoinist","logo":"https://t3.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://bitcoinist.com/&size=64"},"creation_date":"2024-05-15T09:41:48Z","categories":["token","web3","bnb","fdusd","crypto","ton","link","nft"],"article_link":"https://bitcoinist.com/notcoin-a-deep-dive-into-the-community-token-and-staking-opportunities/","thumbnail_image":"https://bitcoinist.com/wp-content/uploads/2024/05/binance-launchpool-notcoin.jpeg?fit=640%2C360"},{"article_title":"Comparing the growth prospects of KangaMoon and Shiba Inu ","author":"Guest Post","article_detailed_content":"SHIB gains traction with Nexo exchange listing and Shibarium hard fork, while KangaMoon rises in the P2E sector, showcasing strong presale performance and social-fi features. #sponsored","article_summary":"SHIB gains traction with Nexo exchange listing and Shibarium hard fork, while KangaMoon rises in the P2E sector, showcasing strong presale performance and social-fi features. #sponsored","publisher":{"name":"Crypto.news","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://crypto.news/&size=64"},"creation_date":"2024-05-15T09:40:19Z","categories":["shib"],"article_link":"https://crypto.news/comparing-the-growth-prospects-of-kangamoon-and-shiba-inu/","thumbnail_image":"https://crypto.news/app/uploads/2024/04/crypto-news-Kanga-Moon-option1.webp"},{"article_title":"MicroStrategy (MSTR) Boosts Crypto Market Presence with Major Equity Index Inclusion","author":"Lucien Renard","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! MicroStrategy (MSTR) stock has been added to the MSCI World Index, outperforming Bitcoin with a 105.44% increase since the start of the year. Despite its impressive performance, CNBC host Jim Cramer advises investors to opt for Bitcoin instead of MicroStrategy. Bitcoin […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! MicroStrategy (MSTR) stock has been added to the MSCI World Index, outperforming Bitcoin with a 105.44% increase since the start of the year. Despite its impressive performance, CNBC host Jim Cramer advises investors to opt for Bitcoin instead of MicroStrategy. Bitcoin […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T09:37:57Z","categories":["crypto","pepe","bitcoin"],"article_link":"https://en.coinotag.com/microstrategy-mstr-boosts-crypto-market-presence-with-major-equity-index-inclusion/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-15.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Bitcoin (BTC) and Ethereum (ETH) Lead Nominations for UF AWARDS Global 2024: Crypto Enthusiasts Invited to Participate!","author":"Marisol Navaro","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! UF AWARDS Global 2024: Nominations Now Open! UF AWARDS Global 2024 nominations are now open, offering brands a chance to stand out in the financial services and fintech sectors. The awards celebrate both B2C and B2B brands across various attributes, including […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! UF AWARDS Global 2024: Nominations Now Open! UF AWARDS Global 2024 nominations are now open, offering brands a chance to stand out in the financial services and fintech sectors. The awards celebrate both B2C and B2B brands across various attributes, including […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T09:36:29Z","categories":["bitcoin","btc","ethereum","eth","crypto","pepe"],"article_link":"https://en.coinotag.com/bitcoin-btc-and-ethereum-eth-lead-nominations-for-uf-awards-global-2024-crypto-enthusiasts-invited-to-participate/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-8.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Breaking News: Two More Crypto Platforms Hacked, 7 Altcoins Stolen – A Rising Concern for Coin Security","author":"Crypto Vira","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! The cryptocurrency industry has been shaken by hacking attacks on two major DeFi protocols, ALEX Lab and Sonne Finance, resulting in the theft of millions of dollars worth of cryptocurrency. On May 15, Bitcoin DeFi application ALEX Lab reported a hacking […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! The cryptocurrency industry has been shaken by hacking attacks on two major DeFi protocols, ALEX Lab and Sonne Finance, resulting in the theft of millions of dollars worth of cryptocurrency. On May 15, Bitcoin DeFi application ALEX Lab reported a hacking […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T09:34:37Z","categories":["crypto","pepe","cryptocurrency","defi","bitcoin"],"article_link":"https://en.coinotag.com/breaking-news-two-more-crypto-platforms-hacked-7-altcoins-stolen-a-rising-concern-for-coin-security/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-18.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Smart Wallet Brillion Hires New CEO, CPO & CMO To Accelerate Web3 Adoption","author":"CryptoDaily","article_detailed_content":"Source: Depositphotos The smart wallet startup Brillion had some brilliant news to share today, welcoming three new, high-profile executives to its team, including a new CEO in the shape of Nibras Stiebar-Bang, who previously oversaw the development of the Concordium Layer-1 blockchain. Prior to holding a dual role as Concordium’s Chief Technology Officer and Chief Product Officer, Stiebar-Bang worked at Spotify, where she was in charge of managing its cross-functional teams. It’s clear then that she brings a wealth of experience to Brillion, which is one of the most ambitious smart wallet projects around. What Is Brillion? For the uninitiated, Brillion is the official crypto wallet for the Nexera ecosystem, and it provides unfettered access to that project’s extensive range of Web3 tools, including a decentralized identity service known as Nexera ID and Arkefi, which is an investment platform centered on real-world assets or RWAs, such as tokenized art, real estate and luxury goods. While focused on AllianceBlock’s ecosystem, Brillion is an extremely capable smart crypto wallet in its own right, with support for multiple DeFi protocols and hundreds of crypto tokens, enabling activities such as trading, gaming and more from directly within its app. As a smart wallet, it also supports next-generation features such as social login and recovery, doing away with the need to remember a seed phrase, plus verifiable credentials to enhance user security and give them more control over their identity-related information. Perhaps the most intriguing feature of Brillion is its ability to integrate directly with users’ traditional bank accounts to simplify crypto onboarding. With this unique capability, it supports seamless fiat-to-crypto and crypto-to-fiat exchanges, giving users the ability to easily move funds between their bank account and Web3 with some of the lowest fees in the business. The integrated bank accounts also makes Brillion the perfect platform for sending remittances, with its fees said to be six-times cheaper than traditional services. Users can send fiat to any country in the world, exchanging their money for crypto to perform the swap instantly, before exchanging it back to fiat again in the recipient’s favored currency. From Web2 To Web3 With Stiebar-Bang at the helm, Brillion is now looking to strengthen its already comprehensive smart wallet offering and further tighten the integration between traditional finance and digital assets. The new CEO will oversee every aspect of Brillion’s growth strategy, keeping a watchful eye on innovation, product development and day-to-day operations, while heading up talent management. Stiebar-Bang said Brillon is committed to simplifying the transition of users from Web2 to Web3 by making it more accessible and intuitive. “Our focus on extending into RWAs, DePIN and Autonomous Agents signifies our dedication to innovation and user-centric design,” she said. “Our goal is to seamlessly connect the digital world with the real world by providing billions of users with the UX standards they now expect from online financial services.” Joining her in this mission will be the company’s new Chief Product Officer Gantavya Sharma and Chief Marketing Officer Sunny Sian. Sharma has accumulated experience working in both Web3 and traditional finance, having previously held leading roles at Bitstamp, Fiserv and Barclays Bank, with a focus on the development of crypto, banking and payments products. At Brillion, he’ll help to pioneer yet more innovations that extend its usefulness as a portal for digital, real-world assets. “Our vision at Brillion is to be the platform that allows our partners to develop experiences that shape this future,” he said. Meanwhile, Brillion’s marketing team will be bolstered by its new leader Sian, who previously worked at Polkadot and ConsenSys on Web3 products and services such as MetaMask, Diligence, Infura and Linea. In his new role, he will head up Brillion’s marketing strategy in order to grow its customer base and accelerate brand engagement. Sian said what attracted him to Brillion is its smart capabilities that dramatically simplify the Web3 experience for users, making modern finance accessible without barriers. \"Web3 Wallets are here to stay, but they often feel unnecessarily complex, almost to a fault,” he pointed out. “With the rise of smart wallets and this category's exciting use cases coupled with improved automation, security and UX, we should embrace these innovations alongside today's behavioral patterns. Stiebar-Bang, Sharma and Sian were given a warm reception by Brillion’s board members Rachid Ajaja and Matthjis De Vries. “We’re confident that under their leadership Brillion will bring the next billion users to web3 by bridging the gap between its digital and real world applications,” they said in a statement. The executive trio’s immediate focus will be on transforming Brillion into a smart wallet that brings digital assets closer to real-world use cases in areas such as compliance, ease of use, security and integration with traditional banking services. Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice","article_summary":"The smart wallet startup Brillion had some brilliant news to share today, welcoming three new, high-profile executives to its team, including a new CEO in the shape of Nibras Stiebar-Bang, who previously oversaw the development of the Concordium Layer-1 blockchain.","publisher":{"name":"Crypto Daily","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://cryptodaily.co.uk/&size=64"},"creation_date":"2024-05-15T09:32:53Z","categories":["web3","blockchain","crypto","defi","polkadot"],"article_link":"https://cryptodaily.co.uk/2024/05/smart-wallet-brillion-hires-new-ceo-cpo-cmo-to-accelerate-web3-adoption","thumbnail_image":"https://cryptodaily.blob.core.windows.net/space/CryptoDaily-Secondary-Image54645545jh%2Ckgh%2C..jpg"},{"article_title":"StanChart confirms Euro transactions on the Partior interbank tokenized deposit network","author":"Ledger Insights","article_detailed_content":"In November 2022 Standard Chartered invested in Partior, the blockchain-based interbank payment network founded by DBS Bank, JP Morgan and Temasek. Today Standard Chartered announced it is the first settlement bank on the tokenized deposit network to support Euro transfers, with Siemens and iFast Financial participating in transactions earlier this week. On Monday we reported that all three founding banks are now in production. Several other currencies are planned […] The post StanChart confirms Euro transactions on the Partior interbank tokenized deposit network appeared first on Ledger Insights - blockchain for enterprise.","article_summary":"In November 2022 Standard Chartered invested in Partior, the blockchain-based interbank payment network founded by DBS Bank, JP Morgan and Temasek. Today Standard Chartered announced it is the first settlement bank on the tokenized deposit network to support Euro transfers, with Siemens and iFast Financial participating in transactions earlier this week. On Monday we reported that all three founding banks are now in production. Several other currencies are planned […] The post StanChart confirms Euro transactions on the Partior interbank tokenized deposit network appeared first on Ledger Insights - blockchain for enterprise.","publisher":{"name":"Ledger Insights","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.ledgerinsights.com/&size=64"},"creation_date":"2024-05-15T09:30:59Z","categories":["blockchain"],"article_link":"https://www.ledgerinsights.com/standard-chartered-partior-interbank-tokenized-deposit-network/","thumbnail_image":""},{"article_title":"Busted! North Korea Caught Laundering Millions Via Shady Crypto Mixer","author":"Christian Encila","article_detailed_content":"Once more, North Korea has demonstrated its cyber prowess, possibly undermining international sanctions by using cryptocurrencies. According to a recent assessment by UN sanctions monitors, North Korea is suspected of using the Tornado Cash platform to launder a whopping $148 million that was taken from a cryptocurrency exchange in March. This event highlights how difficult it is becoming to enforce sanctions in the digital era, when illegal actors can hide their identities behind cryptocurrencies. Mixing Up The Rules: How Tornado Cash Facilitated Money Laundering According to the UN report, the stolen funds, believed to be from the HTX exchange hacked in late 2023, were funneled through Tornado Cash, a crypto mixer. These platforms obfuscate the origin of transactions by essentially pooling funds together and then distributing them to new addresses. This makes it extremely difficult, if not impossible, to track the original source of the money. NORTH KOREA LAUNDERED $147.5 MILLION IN STOLEN CRYPTO IN MARCH, SAY UN EXPERTS North Korea laundered $147.5 million through virtual currency platform Tornado Cash in March after stealing it last year from a cryptocurrency exchange, according to confidential work by United… — *Walter Bloomberg (@DeItaone) May 14, 2024 North Korea Making Big Bucks On Cyberattacks The UN monitors, citing data from blockchain research firms, further revealed that North Korea has likely conducted a total of 97 cyberattacks on cryptocurrency companies since 2017, netting an estimated $4 billion. This year alone, North Korean hackers are suspected to be behind a dozen crypto thefts worth around $55 million. Experts believe these attacks are often carried out by skilled DPRK (Democratic People’s Republic of Korea) IT workers employed by unsuspecting small crypto firms, granting them insider access to exploit vulnerabilities. Global Crackdown On Tornado Cash: A Step In The Right Direction? The international community has not turned a blind eye to these illicit activities. The US government sanctioned Tornado Cash in 2022, labeling it a money-laundering tool frequently used by North Korean cybercriminals. This action complemented broader efforts to regulate digital platforms susceptible to financial fraud. The recent sentencing of Tornado Cash developer Alexey Pertsev to 64 months in prison by a Dutch court further highlights the tightening grip on such platforms. However, the case also exposes the complexities of regulating cryptocurrencies, a decentralized technology that transcends national borders. International cooperation and coordinated efforts are crucial to tackle this challenge effectively. Looking Ahead: Securing The Future Of Crypto The North Korean cryptocurrency laundering case serves as a wake-up call. It underscores the urgent need for a multi-pronged approach to tackle the issue. Governments, regulatory bodies, and the cryptocurrency industry itself must collaborate to address vulnerabilities, enhance transaction transparency, and establish robust anti-money laundering (AML) frameworks. Featured image from @GameStopPepe) / X, chart from TradingView","article_summary":"Once more, North Korea has demonstrated its cyber prowess, possibly undermining international sanctions by using cryptocurrencies. According to a recent assessment by UN sanctions monitors, North Korea is suspected of using the Tornado Cash platform to launder a whopping $148 million that was taken from a cryptocurrency exchange in March. This event highlights how difficult […]","publisher":{"name":"Bitcoinist","logo":"https://t3.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://bitcoinist.com/&size=64"},"creation_date":"2024-05-15T09:30:11Z","categories":["crypto","cryptocurrency","blockchain"],"article_link":"https://bitcoinist.com/north-korea-caught-laundering-millions-via-shady-crypto-mixer/","thumbnail_image":"https://bitcoinist.com/wp-content/uploads/2024/05/Tornado.webp?fit=630%2C420"},{"article_title":"Indian crime officials being probed in major Bitcoin scam","author":"Rony Roy","article_detailed_content":"Several officers from the Indian Crime Branch, including an Inspector General of Police (IGP), are being probed by a Special Investigation Team (SIT) in connection with a Bitcoin scam. The SIT has issued a notice to Inspector General of Police…","article_summary":"Several officers from the Indian Crime Branch, including an Inspector General of Police (IGP), are being probed by a Special Investigation Team (SIT) in connection with a Bitcoin scam. The SIT has issued a notice to Inspector General of Police…","publisher":{"name":"Crypto.news","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://crypto.news/&size=64"},"creation_date":"2024-05-15T09:29:33Z","categories":["bitcoin"],"article_link":"https://crypto.news/indian-crime-officials-being-probed-in-major-bitcoin-scam/","thumbnail_image":"https://crypto.news/app/uploads/2023/12/crypto-news-biggest-crypto-hacks-option02.webp"},{"article_title":"Circle to Relocate to the U.S. Before Going Public","author":"Ezra Kaimenyi","article_detailed_content":"Circle Internet Financial Ltd is set to move its legal headquarters from the Republic of Ireland to the United States. A company spokesperson confirmed that this move aligns with its plans to launch an initial public offering (IPO) in the U.S., which were submitted in January. The transition may lead Circle to face higher corporate taxes in the U.S., a shift from Ireland’s lower rates that have attracted global corporations like Apple Inc. and Pfizer Inc. However, recent OECD tax reforms have introduced a minimum 15% tax rate on multinational profits. Circle’s core business is USDC, which has a market capitalization of $33 billion. Issuance reached a high of around $56 billion in June 2022 but later fell following a banking crisis in the U.S., notably the collapse of Silicon Valley Bank. USDC circulation resumed this year, setting a high of $24 billion, mainly supported by the rebound in the broad cryptocurrency market. Stablecoins are intended to be pegged 1:1 to fiat currencies, and they are always backed by cash and bond reserves. In this connection, profitability for stablecoin issuers has been on the rise, with Tether Holdings Ltd reporting a record profit of $4.5 billion in the first quarter, underlined by rising post-pandemic interest rates. Also read: CeDeFiAi Partners with Leading Crypto Projects.","article_summary":"Circle shifts to the U.S., faces tax hike; USDC rebounds with $24B in circulation.","publisher":{"name":"Crypto Times","logo":"https://logo.clearbit.com/www.cryptotimes.io?size=96"},"creation_date":"2024-05-15T09:28:45Z","categories":["core","usdc","cryptocurrency","tether","crypto"],"article_link":"https://www.cryptotimes.io/2024/05/15/circle-to-relocate-to-the-u-s-before-going-public/","thumbnail_image":"https://www.cryptotimes.io/wp-content/uploads/2024/05/Stablecoin-Issuer-Circle-to-Make-US-Legal-Home-Ahead-of-Listing-1024x576.jpg"},{"article_title":"Iris-Scanning Worldcoin Token Gets Malaysian Regulator’s Nod","author":"Sujha Sundararajan","article_detailed_content":"The Securities Commission Malaysia (SC), the country’s regulator, has approved the trading of the Worldcoin (WLD) token on digital asset exchanges recognized by the SC. Malaysia-based digital business solutions provider Cuscapi announced the move that its associate company MX Global received the approval on May 9, to facilitate trading of WLD token. In March 2022, MX Global had obtained an unspecified equity investment from cryptocurrency exchange Binance. The token joins as the 14th among the list of permitted digital assets to be traded in the country. Some of the permitted cryptos include Bitcoin (BTC), Ethereum (ETH), Litecoin (LTC), Ripple (XRP), Polygon (MATIC) and Solana (SOL). The news arrives a month after Worldcoin executives met with top Malaysian officials, discussing the token’s strategic expansion. Alex Blania, the lead developer of Worldcoin and the co-founder and CEO of Tools of Humanity attended the meeting with key Malaysian government leaders. Before the physical meeting, both Blania and OpenAI CEO Sam Altman had a 30-minute virtual discussion via video conference with the Malaysian government. They touched on several aspects related to the rapid development of technology. According to post by the Malaysian President Anwar Ibrahim, Altman and Blania elaborated on the development of the Worldcoin project. They discussed its focus on creating a global and inclusive financial network, prioritizing confidentiality Regulatory Uncertainty and Privacy Concerns Still Loom on Worldcoin The Worldcoin initiative sparked privacy apprehensions across various nations. In March, CNPD, Portugal’s data oversight authority, issued a directive, instructing WLD to pause biometric data collection for 90 days. The CNPD cited that WLD involved a significant risk to citizens’ data protection rights, demanding immediate action to avert harm. However, Ethereum co-founder Vitalik Buterin has a different view on this eye-ball scanning digital token. Recently, he acknowledged Worldcoin’s efforts to secure user data privacy. He said that Sam Altman has performed “quite a good job” in implementing cryptographic measures to ensure data confidentiality. “In my opinion they actually have been doing quite a good job of taking the privacy critiques seriously,” Buterin noted. The post Iris-Scanning Worldcoin Token Gets Malaysian Regulator’s Nod appeared first on Cryptonews.","article_summary":"Malaysia-based Cuscapi's associate company MX Global received the approval from Malaysia regulator, to facilitate trading of WLD token. The post Iris-Scanning Worldcoin Token Gets Malaysian Regulator’s Nod appeared first on Cryptonews.","publisher":{"name":"Crypto News","logo":"https://t1.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://cryptonews.com/&size=64"},"creation_date":"2024-05-15T09:27:20Z","categories":["worldcoin","token","wld","cryptocurrency","bitcoin","btc","ethereum","eth","litecoin","ltc","xrp","polygon","matic","solana","sol"],"article_link":"https://cryptonews.com/news/iris-scanning-worldcoin-token-gets-malaysian-regulators-nod.htm","thumbnail_image":"https://cimg.co/wp-content/uploads/2024/05/15085955/1715763595-1715761360515_processed.jpg"},{"article_title":"ARKB ETF records $133 million in inflows as BTC surged","author":"Wahid Pessarlay","article_detailed_content":"Data shows that ARK 21Shares Bitcoin exchange-traded fund (ETF), also known as ARKB, recorded the highest amount of inflows after reaching a crucial level. According to data provided by Farside Investors, the US Bitcoin (BTC) ETFs registered $100.5 million in…","article_summary":"Data shows that ARK 21Shares Bitcoin exchange-traded fund (ETF), also known as ARKB, recorded the highest amount of inflows after reaching a crucial level. According to data provided by Farside Investors, the US Bitcoin (BTC) ETFs registered $100.5 million in…","publisher":{"name":"Crypto.news","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://crypto.news/&size=64"},"creation_date":"2024-05-15T09:27:03Z","categories":["btc","bitcoin"],"article_link":"https://crypto.news/arkb-etf-records-133-million-in-inflows-as-btc-surged/","thumbnail_image":"https://crypto.news/app/uploads/2024/04/crypto-news-Bitcoin-Runes-option04.webp"},{"article_title":"BlockTower Capital with $1.7b in AUM reportedly ‘partially drained’","author":"Denis Omelchenko","article_detailed_content":"Crypto investment firm BlockTower Capital has reportedly been targeted by fraudsters, resulting in a partial loss of funds from the firm’s main hedge fund. BlockTower Capital, a crypto investment firm founded by Matthew Goetz and Ari Paul, has allegedly fallen…","article_summary":"Crypto investment firm BlockTower Capital has reportedly been targeted by fraudsters, resulting in a partial loss of funds from the firm’s main hedge fund. BlockTower Capital, a crypto investment firm founded by Matthew Goetz and Ari Paul, has allegedly fallen…","publisher":{"name":"Crypto.news","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://crypto.news/&size=64"},"creation_date":"2024-05-15T09:24:43Z","categories":["crypto"],"article_link":"https://crypto.news/blocktower-capital-with-1-7b-in-aum-reportedly-partially-drained/","thumbnail_image":"https://crypto.news/app/uploads/2024/03/crypto-news-hacker-option02.webp"},{"article_title":"Telegram Wallet Offers One billion NOT tokens to Toncoin holders","author":"Collins J. Okoth","article_detailed_content":"Telegram Wallet just announced its partnership with Notcoin. The partnership has allocated one billion NOT tokens to Toncoin holders. Crypto users can take advantage of this opportunity by depositing up to 100 Toncoin into their bonus accounts to receive 5 $NOT for every TON daily. Telegram Wallet lets crypto users purchase cryptocurrencies using bank cards and crypto exchange platforms. They can also transfer their coins to other wallets whenever they like. ⚡️ In partnership with @thenotcoin, we're allocating one billion NOT tokens to Toncoin holders! Deposit up to 100 Toncoin into your bonus account, and you'll receive 5 $NOT for every TON daily. Get NOT: https://t.co/vOoCJU8qSg pic.twitter.com/QJYSWaj8Ws — Wallet in Telegram (@wallet_tg) May 12, 2024 Telegram’s recent involvement in the crypto space has taken the industry by storm, bringing together large industry players like Tether. Also Read: Notcoin Launch Telegram Wallet Advances Crypto Adoption Telegram Wallet, primarily built on The Open Network (TON) blockchain, has led to mass penetration of cryptocurrencies by its users. With close to 1 billion users, the Telegram platform opened up the TON blockchain to many users, promoting its ecosystem development and Toncoin adoption. Telegram announced its revolutionary revenue-sharing plan, which will reward channel owners on the platform using Toncoin tokens. As a result, the platform has also allowed its users to make in-app purchases—like in-platform ads—using TON. The rewards system seeks to improve Toncoin adoption and usage, strengthening the TON blockchain ecosystem. The motive to continue promoting activities on The Open Network continues with Telegram Wallet’s new collaboration with Notcoin. The partnership sets aside 1 billion NOT tokens to be distributed accordingly to all Toncoin holders. Such an arrangement will ensure the mutual growth of Notcoin and Tocoin. Binance issues update on Notcoin Notcoin is the 54th project on Binance Launchpool, and its ability to incorporate social gaming and cryptocurrency functionalities has made it an instant hit in the market. Just recently, Telegram Wallet announced Notcoin as a partner in a program that will ensure Toncoin holders receive NOT token rewards. Also Read: How The Binance Beef Could Ruin Nigeria In a bid to promote Notcoin, Binance has also provided an avenue for users to stake BNB and FUSD to farm NOT tokens. These collaborations boost the adoption of these tokens, increasing their overall market approval and benefiting their native blockchain ecosystems. Crypto enthusiasts can take advantage of the Telegram Wallet and Notcoin reward program by depositing 100 Tocoin into their bonus accounts. Crypto users with 100 TON in their bonus accounts will receive 5 NOT tokens for every TON on a daily basis. Cryptopolitan reporting by Collins J Okoth.","article_summary":"Telegram Wallet just announced its partnership with Notcoin. The partnership has allocated one billion NOT tokens to Toncoin holders. Crypto users can take advantage of this opportunity by depositing up to 100 Toncoin into their bonus accounts to receive 5 $NOT for every TON daily. Telegram Wallet lets crypto users purchase cryptocurrencies using bank cards […]","publisher":{"name":"Cryptopolitan","logo":"https://t0.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.cryptopolitan.com/&size=64"},"creation_date":"2024-05-15T09:21:17Z","categories":["toncoin","crypto","ton","tether","blockchain","cryptocurrency","token","bnb"],"article_link":"https://www.cryptopolitan.com/telegram-wallet-1-billion-not/","thumbnail_image":"https://www.cryptopolitan.com/wp-content/uploads/2024/05/Default_Enter_the_world_of_Telegram_Wallet_and_experience_the_0.jpg"},{"article_title":"Round Two of Crypto Bull Market Coming Up, With One Memecoin Ready To Lead the Pack: Analyst","author":"thebittimes@thebitfinance.com (TheBitTimes.Com)","article_detailed_content":"A widely followed crypto analyst is predicting that Bitcoin (BTC) is about to take off on another bull run after chopping around for weeks. Pseudonymous crypto trader Inmortal tells his 213,800 followers on the social media platform X that Bitcoin appears to be mirroring a 2020 pattern of trading around the prior cycle’s all-time high (ATH) before a massive bull run. “It is not hope. It is not a dream. Round two of the bull market is almost here. Grab your balls and ride the trend.” Source: Inmortal/X The trader says that the current market structure may appear bearish, but Bitcoin remains within a trading range and predicts it is only a matter of time before a breakout. “The bad news? Not a single higher high since all-time high. The good news? We are still in the range and above market order. What to do? In my opinion, doing nothing is the best thing you can do now.” Source: Inmortal/X Bitcoin is trading for $61,765 at time of writing, down 1.5% in the last 24 hours. He also re-confirms his prediction that memecoin dog-themed crypto asset Floki (FLOKI) will outperform the broader crypto market after financial giant VanEck’s MarketVector’s Meme Coin Index, which trades under the symbol MEMECOIN, just added Floki to its portfolio. “VanEck added FLOKI to its Memecoin Index. The suits are gearing up for round two of the bull market and it shows. I’ve been saying it for quite some time, but I think FLOKI will lead this cycle.” FLOKI is trading for $0.0001965 at time of writing, up more than 6% in the last 24 hours. Source: https://thebittimes.com/round-two-of-crypto-bull-market-coming-up-with-one-memecoin-ready-to-lead-the-pack-analyst-tbt88377.html","article_summary":"A widely followed crypto analyst is predicting that Bitcoin (BTC) is about to take off on another bull run after chopping around for weeks.Pseudonymous crypto trader Inmortal tells his 213,800 followers on the social media platform...","publisher":{"name":"The Bit Times","logo":"https://logo.clearbit.com/thebittimes.com?size=96"},"creation_date":"2024-05-15T09:18:21Z","categories":["crypto","bitcoin","btc","floki"],"article_link":"https://thebittimes.com/round-two-of-crypto-bull-market-coming-up-with-one-memecoin-ready-to-lead-the-pack-analyst-tbt88377.html","thumbnail_image":"https://cdn.thebittimes.com/vimedia/w800/2024/05/15/f08a40aa0f5cdfc96352b8e13f415db5.webp"},{"article_title":"We asked ChatGPT-4o what will be XRP price at the end of 2024; Here’s what it said","author":"thebittimes@thebitfinance.com (TheBitTimes.Com)","article_detailed_content":"Though XRP has not been a particularly active participant in the crypto market rally of the first quarter of 2024, things have been far from quiet for the cryptocurrency. Indeed, much activity has emerged from Ripple Labs – XRP’s issuer – and has included significant monthly token unlocks, a reported entry into the stablecoin game, and perhaps most consequentially, the continuation of the long-standing legal battle with the Securities and Exchange Commission. The courtroom fight is also, after many years, seemingly entering its final chapter, with Ripple recently filing a motion to seal certain sensitive business data. The outcome of the case is bound to be consequential and could help XRP, in particular, surge toward its previous all-time highs (ATH) near $3. Picks for you Silver vs inflation: Is silver a hedge against inflation? 32 mins ago Crypto expert PlanB reveals when Bitcoin will ‘go vertical’ 46 mins ago Short squeeze alert for two cryptocurrencies this week 15 hours ago Price prediction for PEPE amid new all-time high 16 hours ago With the promise of pending regulatory clarity and the still-persistent uncertainty in mind, Finbold decided to consult the most advanced version of OpenAI’s flagship artificial intelligence (AI) platform – ChatGPT-4o – on where XPR might stand at the very end of 2024. ChatGPT sets XRP price for late December 2024 Upon analyzing the recent crypto market trends and XRP-related happenings, ChatGPT concluded that the token is likely to see a significant rise in value through the rest of 2024. According to the AI, the facts that a victory for Ripple is in the cards and that the company has actively been working on developing its ecosystem and partnerships are likely to help drive positive market action. ChatGPT, however, also reflected on mixed results of technical Analysis (TA) assessing XRP’s recent performance and thus concluded that, between the likely positive developments and the current struggles, the token is likely to rise to $0.80 by the end of the year. ChatGPT summarizes its assessment of XRP. Source: Finbold and ChatGPT When challenged that its Analysis appears low given that the AI assumed a legal victory for Ripple, ChatGPT pushed back, stating that the current market conditions – while allowing for a greater long-term surge – would still limit how much XRP can rise before 2024 is out and described its target of $0.80 as a ‘conservative but realistic estimate.’ ChatGPT defends its original estimate. Source: Finbold and ChatGPT ChatGPT presents a bullish scenario ChatGPT was also willing to indulge in a more bullish sequence of events. In this scenario, a legal victory against the SEC would have a ripple effect that would cause wider user and institutional adoption across the globe, facilitate an unprecedented pace of innovation, and turn the market highly bullish. Should such regulatory clarity be achieved, and should the stars align – a scenario the AI considers plausible, if not the most likely – XRP could soar to $3 per token by the end of 2024. ChatGPT outlines its bullish case for XRP. Source: Finbold and ChatGPT ChatGPT presents a bearish scenario ChatGPT, however, also estimates a bearish scenario in which Ripple suffers a major legal defeat against the SEC is plausible. Under these circumstances, the AI assesses, regulators across the world would feel emboldened to besiege the crypto industry and investors could, spooked by the developments, turn sour on cryptocurrencies. ChatGPT outlines its bearish case for XRP. Source: Finbold and ChatGPT These factors would, combined, also stifle further technological developments and ultimately lead to a crash to $0.15 for XRP by the end of 2024. Disclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk. Source: https://thebittimes.com/we-asked-chatgpt-4o-what-will-be-xrp-price-at-the-end-of-2024-here-s-what-it-said-tbt88376.html","article_summary":"Though XRP has not been a particularly active participant in the crypto market rally of the first quarter of 2024, things have been far from quiet for the cryptocurrency.Indeed, much activity has emerged from Ripple Labs – XRP’s...","publisher":{"name":"The Bit Times","logo":"https://logo.clearbit.com/thebittimes.com?size=96"},"creation_date":"2024-05-15T09:18:15Z","categories":["xrp","crypto","cryptocurrency","token","near","bitcoin","pepe","ai"],"article_link":"https://thebittimes.com/we-asked-chatgpt-4o-what-will-be-xrp-price-at-the-end-of-2024-here-s-what-it-said-tbt88376.html","thumbnail_image":"https://cdn.thebittimes.com/vimedia/w800/2024/05/15/783ec182660a1860648c2475217c8864.webp"},{"article_title":"ABT token surges 26% to hit new all-time high","author":"Rony Roy","article_detailed_content":"ArcBlock’s native token, ABT, has seen a significant surge in its market value, with a 26% rise over the last 24 hours, pushing the token to a new all-time high of $3.92. The latest surge in trading volume, which reached $31.8…","article_summary":"ArcBlock’s native token, ABT, has seen a significant surge in its market value, with a 26% rise over the last 24 hours, pushing the token to a new all-time high of $3.92. The latest surge in trading volume, which reached $31.8…","publisher":{"name":"Crypto.news","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://crypto.news/&size=64"},"creation_date":"2024-05-15T09:15:14Z","categories":["token"],"article_link":"https://crypto.news/abt-token-surges-26-to-hit-new-all-time-high/","thumbnail_image":"https://crypto.news/app/uploads/2024/01/crypto-news-trading-chart-front-side-view-Exchange-building-background-bright-neon-colors-option09.webp"},{"article_title":"Sonne Finance Token Drops 60% After $20M Exploit on Optimism","author":"Shaurya Malwa","article_detailed_content":"Attackers stole ether, velo and stablecoins before developers mitigated the hack and paused operations. Sonne’s markets on the Base blockchain were not affected.","article_summary":"Attackers stole ether, velo and stablecoins before developers mitigated the hack and paused operations. Sonne’s markets on the Base blockchain were not affected.","publisher":{"name":"CoinDesk","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.coindesk.com/&size=64"},"creation_date":"2024-05-15T09:11:16Z","categories":["token","optimism","blockchain"],"article_link":"https://www.coindesk.com/tech/2024/05/15/sonne-finance-token-drops-60-after-20m-exploit-on-optimism/?utm_medium=referral&utm_source=rss&utm_campaign=headlines","thumbnail_image":"https://www.coindesk.com/resizer/b4xDuNuizaV3gj3FfFrk0Cv4lT4=/800x600/cloudfront-us-east-1.images.arcpublishing.com/coindesk/EQIWBBPUXVFFLIN4TV4NPCO3UM.jpg"},{"article_title":"Dogecoin Price Prediction: DOGE Drops 3% As Roaring Kitty Rally Fades And This Red Hot Meme Coin Offers Last Chance To Buy","author":"thebittimes@thebitfinance.com (TheBitTimes.Com)","article_detailed_content":"The Dogecoin price dropped over 3% in the last 24 hours to trade at $0.1455 as of 12:30 a.m. EST as investors dump some of their holdings in the meme coin. The DOGE price drop comes after a meme coin market surge ignited by the reappearance of Roaring Kitty, a personality at the center of the meme stock craze and GameStop short squeeze back in 2021. pic.twitter.com/YgjVqtgcNS — Roaring Kitty (@TheRoaringKitty) May 13, 2024 After an almost 3-year hiatus, he reappeared online and posted a cryptic tweet yesterday. Many believe the post signaled the analyst’s return and led to speculation of a possible GameStop 2.0. The Dogecoin Price Loses Key Support 4-hour chart for DOGE/USD (Source: GeckoTerminal) The Dogecoin price lost the key support at $0.1470 over the past 24 hours. As such, bulls are trying their best to push the meme coin’s price back above this key point. Should DOGE close a 4-hour candle above $0.1470 within the next 8 hours, traders might enter into a long position for the crypto. The crypto could subsequently climb to the major $0.1575 resistance level. Traders and investors will want to keep an eye on how the Dogecoin price behaves should it reach the $0.1575 barrier. In the last couple of days, the meme coin has been rejected by this technical obstacle twice already, and history could repeat itself. However, a break above $0.1575 could lead to DOGE climbing in the short term, with bulls potentially looking to capitalize on the break above this threshold. On the other hand, the Dogecoin price failing to close a 4-hour candle above $0.1470 within the next 8 hours might invalidate the bullish thesis. In this alternative scenario, the altcoin could test the immediate $0.1344 support. It might even drop below this technical crutch to $0.1224 if the sell pressure persists. Technicals Point To A Continued Drop For The Dogecoin Price Technical indicators on DOGE’s 4-hour chart warn that the Dogecoin price might enter a negative cycle in the next 24 hours. There is also a major bearish technical flag that is on the verge of being triggered by the Moving Average Convergence Divergence (MACD) indicator. With the MACD line collapsing towards the MACD Signal line, it seems DOGE’s positive momentum during the past 24 hours has hit a peak. Should the MACD cross below the Signal line, it will most likely indicate that the meme coin’s bullish phase has ended and DOGE has started a new bearish cycle. In addition to this, the Relative Strength Index (RSI) indicator shows that bulls’ strength against sellers has dropped substantially. In the last 24 hours, the RSI line has fallen from 59 to just above 50. Although this signals that DOGE can still go either way, this coupled with the MACD suggests the Dogecoin price might drop in the next 24 hours. As DOGE’s momentum seems to be fizzling out, investors are shifting focus to Dogeverse, one of the best performing ICOs this year that’s already raised more than $15 million. Now it’s giving investors one last chance to buy before launch. Modernizing The Meme Coin Sector There is a big push in the blockchain space to find a way to make networks seamlessly communicate with each other and share information with other blockchains regardless of their differing protocols. Dogeverse (DOGEVERSE) is the first meme coin to reside on multiple blockchains. This aligns the crypto perfectly with the broader industry’s aim to increase interoperability within the Web3 sector. By holding Dogeverse, investors can shift value across the most liquid and active networks with ease, allowing them to participate in high yield generating opportunities as soon as they appear. What’s more, Dogeverse holders won’t even have to swap out their tokens to start earning passive rewards on-chain, because the project is offering ICO investors a lucrative staking program with a 57% APY. Given Dogeverse’s unprecedented levels of utility, it’s easy to see why an analyst from the CryptoNews YouTube channel recently said the meme coin has 100X potential on launch. One small step for man, one giant leap for multi-chain. 🌕#Memecoins #Solana #Altcoins #Ethereum #Crypto #MemeCoinSeason2024 #Web3 pic.twitter.com/bbKMU5qtA4 — DogeVerse (@The_DogeVerse) May 14, 2024 To acquire the token before it’s too late, investors can navigate to the project’s website and make use of the simple buy widget embedded on the page. Due to its multi-chain nature, investors can purchase DOGEVERSE using either ETH, BNB, MATIC, AVAX, SOL, or BASE. USDT and bank cards can also be used. But anyone that wants to stake their tokens for the 57% APY will need to use ETH to buy the crypto, since the staking contract is on the Ethereum blockchain. Purchase and stake DOGEVERSE here for up to 57% in annual staking rewards. Related Articles: Best Altcoins to Invest In: Unveiling Top Picks for Maximum Returns! Joe Biden Orders Ousting Of China-Backed Crypto Mining Firm Near US Missile Base This Be The Next WIF? Compound Price Prediction for Today, May 14 – COMP Technical Analysis Source: https://thebittimes.com/dogecoin-price-prediction-doge-drops-3-as-roaring-kitty-rally-fades-and-this-red-hot-meme-coin-offers-last-chance-to-buy-tbt88374.html","article_summary":"The Dogecoin price dropped over 3% in the last 24 hours to trade at $0.1455 as of 12:30 a.m. EST as investors dump some of their holdings in the meme coin.The DOGE price drop comes after a meme coin market surge ignited by the reappearance...","publisher":{"name":"The Bit Times","logo":"https://logo.clearbit.com/thebittimes.com?size=96"},"creation_date":"2024-05-15T09:06:15Z","categories":["dogecoin","doge","crypto","blockchain","web3","solana","ethereum","token","eth","bnb","matic","avax","sol","usdt","near","wif"],"article_link":"https://thebittimes.com/dogecoin-price-prediction-doge-drops-3-as-roaring-kitty-rally-fades-and-this-red-hot-meme-coin-offers-last-chance-to-buy-tbt88374.html","thumbnail_image":"https://cdn.thebittimes.com/vimedia/w800/2024/05/15/4679cac0d3eb26c44ee74288fef71409.webp"},{"article_title":"Robinhood launches Solana (SOL) staking in Europe","author":"thebittimes@thebitfinance.com (TheBitTimes.Com)","article_detailed_content":"Robinhood Crypto has announced launch of Solana (SOL) staking for its customers in Europe. New customers will also enjoy a 10% bonus on net buys. Robinhood is expanding its services and products for users in Europe. On Wednesday, the trading platform announced it was launching new features that include Solana (SOL) staking, localized apps and crypto rewards among others. The new features will target new customers, Robinhood Crypto said in an update. Robinhood launches SOL staking in Europe As part of its growth efforts, Robinhood Crypto now offers its “first-ever crypto staking product”. The platform said Solana (SOL) staking is now available directly via its app, which means users can earn rewards from their staked SOL tokens. The product will offer the flexibility of users being able to unstake at any time. “Robinhood Crypto is already one of the lowest cost places to trade on average with an easy-to-use interface that prioritizes education. Today’s news is a significant step forward in our mission to offer customers a more tailored in-app experience that meets their specific needs and helps them on their financial journey,” Johann Kerbrat, VP and GM of Robinhood Crypto said in a statement. Staking rewards, bonuses Other than the staking rewards, new customers have a chance to unlock a 10% bonus on net buys accrued over the user’s first 30 days of trading. Payouts for the bonuses will be in USDC. New customers will also benefit from the Learn & Earn modules the platform has launched, with initial focus on Bitcoin (BTC), Avalanche (AVAX) and the USDC stablecoin. The products are tailor-made to bolster customers’ knowledge and understanding of different cryptocurrencies. The new Features also include localized apps, with local language versions of the app launched in Italy, Poland and Lithuania. Robinhood Crypto will be unveiling these localized app versions in coming weeks, the company announced. Source: https://thebittimes.com/robinhood-launches-solana-sol-staking-in-europe-tbt88373.html","article_summary":"Robinhood Crypto has announced launch of Solana (SOL) staking for its customers in Europe.New customers will also enjoy a 10% bonus on net buys.Robinhood is expanding its services and products for users in Europe.On Wednesday, the...","publisher":{"name":"The Bit Times","logo":"https://logo.clearbit.com/thebittimes.com?size=96"},"creation_date":"2024-05-15T09:06:07Z","categories":["solana","sol","crypto","usdc","bitcoin","btc","avalanche","avax"],"article_link":"https://thebittimes.com/robinhood-launches-solana-sol-staking-in-europe-tbt88373.html","thumbnail_image":"https://cdn.thebittimes.com/vimedia/w800/2024/05/15/de09602eaf0e9f903248a914ad7a2cc4.webp"},{"article_title":"Google Unveils Veo:Advanced in AI Video Generation","author":"Emman Omwanda","article_detailed_content":"Google has announced its latest breakthrough in artificial intelligence: See, a new, innovative text-to-video generator that is about to change the video generator industry. When Veo was unveiled at the Google I/O developer conference, it was recognized as a strong rival to OpenAI’s Sora, the advantages of which include the expansion of creative control and the generation of stunning visual output. Veo creativity in video generation Unlike past AI video generators, Veo has an unbeatable feature, creative control; the users can make a video with finer details and the effect of the movie. With the use of its sophisticated natural language understanding, Veo can easily understand longer prompts and the meaning of cinematic terms, including “timelapse” and “aerial shots. This deeper understanding of the concept helps users to describe their ideas in a way that is accurate and precise; thus, the videos created have a better chance of being more impressive than their counterparts. One of the most remarkable elements of Veo’s is the guarantee of the continuity and the authenticity of the scenes being generated. In video generation, the problem of the inconsistency of the shots is being tackled by Veo, and it manages to produce the shots with natural movements, be it of people, animals, or objects. This note-worthy skill improves the total viewing experience, and thus, the audience feels that they are in the reality that is completely and authentically rendered scenes. Google’s continuous innovation in AI video generation The Veo, Google’s video generation, results from the past years of research and development in the field. The basics of the project are already being developed by the projects before Veo, such as Imagen-Video, VideoPoet, and Lumiere. Veo will go further than previously possible with AI’s help in visual storytelling. By combining the lessons learned and the new ideas from these projects, Veo will become an example of Google’s dedication to the best AI technology. Although the Veo presentation has already been done, it is not yet presented to the public. On the contrary, Google is providing the Veo video assistant to a limited number of VideoFX creators in VideoFX, its video editing platform. Those who are really into this can sign up for the waitlist and get a chance to be a part of the Veo experience and use its revolutionary potential. Next to Veo, Google has also presented Imagen 3, its newest text-to-image model known for its excellent image quality and fewer visual artifacts.,. The creators who are keen to know the possibilities of Imagen 3 can register for the waitlist and thus get access to this latest technology.","article_summary":"Google has announced its latest breakthrough in artificial intelligence: See, a new, innovative text-to-video generator that is about to change the video generator industry. When Veo was unveiled at the Google I/O developer conference, it was recognized as a strong rival to OpenAI’s Sora, the advantages of which include the expansion of creative control and […]","publisher":{"name":"Cryptopolitan","logo":"https://t0.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.cryptopolitan.com/&size=64"},"creation_date":"2024-05-15T09:04:40Z","categories":["ai"],"article_link":"https://www.cryptopolitan.com/google-unveils-veo-ai-video-generation/","thumbnail_image":"https://www.cryptopolitan.com/wp-content/uploads/2024/05/Default_Google_Unveils_Veo_Advanced_in_AI_Video_Generation_0-1.jpg"},{"article_title":"From Tulip Mania to crypto ETFs: a journey through herd mentality","author":"Ankish Jain","article_detailed_content":"How does the psychology of herd mentality influence regulators’ decisions on crypto, and what does it mean for the market’s future? In January 2024, the U.S. Securities and Exchange Commission (SEC) made a landmark decision, approving the first-ever spot Bitcoin…","article_summary":"How does the psychology of herd mentality influence regulators’ decisions on crypto, and what does it mean for the market’s future? In January 2024, the U.S. Securities and Exchange Commission (SEC) made a landmark decision, approving the first-ever spot Bitcoin…","publisher":{"name":"Crypto.news","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://crypto.news/&size=64"},"creation_date":"2024-05-15T09:01:44Z","categories":["crypto"],"article_link":"https://crypto.news/from-tulip-mania-to-crypto-etfs-a-journey-through-herd-mentality/","thumbnail_image":"https://crypto.news/app/uploads/2024/05/crypto-news-From-Tulip-Mania-to-crypto-ETFs-option04.webp"},{"article_title":"Shibarium Sees Transaction Fees Surge by 267% Amid Rising Interest in Shiba Inu Tokens","author":"Mark Travers","article_detailed_content":"Shibarium, the Layer-2 blockchain designed for the Shiba Inu community, has seen a dramatic increase in transaction fees, with a recorded 267% rise in the last 24 hours. According to Shibariumscan, the gas fees, paid using BONE—the native token of the Shiba Inu ecosystem—escalated from 11.57 to 30.98 BONE. This increase is primarily due to a surge in network activity, likely driven by a growing interest in Shiba Inu tokens following recent market shifts. The Shiba Inu ecosystem, which uses BONE for transaction fees, is experiencing heightened transaction volumes. As a result, the cost for users has significantly increased. BONE not only facilitates transaction payments on Shibarium but also plays a key role in the ecosystem’s tokenomics. READ MORE: SEC Denies Coinbase’s Appeal in Ongoing Securities Lawsuit, Citing Manipulation of Legal Queries Each transaction using BONE helps in burning SHIB tokens, as a portion of the BONE fee is converted into SHIB and sent to a dead wallet. This process reduces the total SHIB supply, potentially enhancing its scarcity and value. This notable increase in fees raises several questions about the future of the Shiba Inu network and its tokens. Stakeholders are now contemplating whether the spike is indicative of a long-term trend of increased activity or if it’s a temporary surge. The sustainability of such high fees is also in question, as is Shibarium’s strategy to manage demand while maintaining network efficiency and scalability. Additionally, the broader context includes recent integrations that have enabled Shiba Inu (SHIB) payments with major brands like Airbnb and Nike, expanding the token’s utility and exposure. However, the overall market sentiment remains bearish, creating an uncertain environment for SHIB and BONE investors. These developments suggest critical times ahead for Shibarium, as it must navigate through market fluctuations and user expectations to sustain growth and retain user engagement. To submit a crypto press release (PR), send an email to sales@cryptointelligence.co.uk.","article_summary":"Shibarium, the Layer-2 blockchain designed for the Shiba Inu community, has seen a dramatic increase in transaction fees, with a recorded 267% rise in the last 24 hours. According to Shibariumscan, the gas fees, paid using BONE—the native token of the Shiba Inu ecosystem—escalated from 11.57 to 30.98 BONE. This increase is primarily due to a surge in network activity, likely driven by a growing interest in Shiba Inu tokens following recent market shifts. The Shiba Inu ecosystem, which uses BONE for transaction fees, is experiencing heightened transaction volumes. As a result, the cost for users has significantly increased. BONE","publisher":{"name":"Crypto Intelligence News","logo":"https://logo.clearbit.com/cryptointelligence.co.uk?size=96"},"creation_date":"2024-05-15T09:01:14Z","categories":["blockchain","token","shib","crypto"],"article_link":"https://www.cryptointelligence.co.uk/shibarium-sees-transaction-fees-surge-by-267-amid-rising-interest-in-shiba-inu-tokens/","thumbnail_image":""},{"article_title":"Dogecoin Price Prediction: DOGE Drops 3% As Roaring Kitty Rally Fades And This Red Hot Meme Coin Offers Last Chance To Buy","author":"Steven Walgenbach","article_detailed_content":"The Dogecoin price dropped over 3% in the last 24 hours to trade at $0.1455 as of 12:30 a.m. EST as investors dump some of [...]","article_summary":"The Dogecoin price dropped over 3% in the last 24 hours to trade at $0.1455 as of 12:30 a.m. EST as investors dump some of [...]","publisher":{"name":"Inside Bitcoins","logo":"https://logo.clearbit.com/insidebitcoins.com?size=512"},"creation_date":"2024-05-15T08:58:30Z","categories":["dogecoin","doge"],"article_link":"https://insidebitcoins.com/news/dogecoin-price-prediction-doge-drops-3-as-roaring-kitty-rally-fades-and-this-red-hot-meme-coin-offers-last-chance-to-buy","thumbnail_image":"https://insidebitcoins.com/wp-content/uploads/2023/10/Dogecoin-logo.jpeg"},{"article_title":"Polkadot Price Analysis: DOT Drops Perilously Close To Support Level","author":"Amara Khatri","article_detailed_content":"The Polkadot (DOT) price has witnessed a dramatic downturn primarily due to intense selling activity at the 200-day SMA and 20-day SMA, pushing it to the lower end of its trading range. If sellers manage to breach the lower end of DOT’s trading range, the bearish trend could persist for the foreseeable future, a scenario that investors should be cautious about. Polkadot (DOT) Continues To See Red Looking at the Polkadot (DOT) price chart, we observe a bullish trend at the beginning of the month that saw the price rise to $7.27 and sit above the 20 and 200-day SMAs. However, the price faced consistent rejections at this level and dropped below the 200-day SMA on May 6. A further drop on May 7 saw the DOT price drop to $6.99, a level where the 20-day SMA acted as support. After a brief recovery that saw DOT climb back above $7, before bearish sentiment saw the price tumble by 4.43% on May 10, and drop below the 20-day SMA. While DOT’s lateral movement was indicative of an ongoing consolidation, the recent drop (May 10) indicates a strengthening of the bearish sentiment. Since this drop, DOT has remained in the red on May 11 and 12, settling at $6.62. The current week began with a volatile day, which saw DOT drop to a low of $6.41 before recovering and rising to $6.67. Tuesday saw a significant drop as sellers pushed DOT to its support level but were unable to push the price any lower. The current session has seen DOT rebound from its support level, with buyers entering the market at this point. Currently, the price is up by 1.70% and sits at $6.59. Looking Ahead Looking at the chart, we can see that DOT has strong support at $6.40, a level from where the price has shown resilience during the ongoing session. The 20-day SMA is currently acting as resistance at the $6.90 level. Despite being trapped between the $6.40 and $7 levels for over a week, there is still potential for a significant bullish movement. If DOT manages to break past the 20-day SMA, we could see the price surge to the $7.50 mark, offering a glimmer of hope for a potential recovery. However, if sellers are able to push the price below DOT’s current support levels, it could unleash a cascading effect and see the price drop to $6 or even $5.5. Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.","article_summary":"The Polkadot (DOT) price has witnessed a dramatic downturn primarily due to intense selling activity at the 200-day SMA and 20-day SMA, pushing it to the lower end of its trading range.","publisher":{"name":"Crypto Daily","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://cryptodaily.co.uk/&size=64"},"creation_date":"2024-05-15T08:51:00Z","categories":["polkadot","dot"],"article_link":"https://cryptodaily.co.uk/2024/05/polkadot-price-analysis-dot-drops-perilously-close-to-support-level","thumbnail_image":"https://cryptodaily.blob.core.windows.net/space/photo_2024-05-15%2014.17.01.jpeg"},{"article_title":"Bloomberg Says Odds Of SEC Approving Ethereum ETFs ”Slim To None” As New Filing Details Emerge","author":"thebittimes@thebitfinance.com (TheBitTimes.Com)","article_detailed_content":"Bloomberg says the chances of the US Securities and Exchange Commission (SEC) approving spot Ethereum ETFs (exchange-traded funds) this month are “slim to none” as new filing details emerge. This view comes after analysts uncovered details from a March filing with the SEC that seem to suggest the regulator is considering labeling the largest altcoin by market cap a security. SEC Asks Public If BlackRock’s Ethereum ETF Can Be Filed As A Commodity Davis Polk and Wardwell Associate Scott Johnsson analyzed a March 4 filing from leading asset manager BlackRock to list its spot ETH ETF on Nasdaq. In addition to delaying the deadline for the SEC to deliver a decision on BlackRock’s application until June, it also called for public feedback on whether the fund could be filed as a commodity. I'm aware this is widely considered a possibility, but this is your official notice that the SEC is considering the security question for ETH in this upcoming spot ETF order. Note that this question was never (afaict) asked regarding a spot/futures BTC ETF product. pic.twitter.com/TwhqmTnJfC — Scott Johnsson (@SGJohnsson) May 14, 2024 The question was never asked in the run up to the approval of spot Bitcoin ETFs, according to Johnsson. The regulator can “deny on the basis that these spot filings are improperly filed as commodity based trust shares,” Johnsson said on X. This would mean that the funds “do not qualify if they are holding a security.” The SEC is perhaps considering Ethereum as “a security in their denial,” added senior Bloomberg ETF analyst Eric Balchunas in a May 14 X post. “It was literally buried 50 feet deep in a pile of legalese.” SEC Likely Considering Labeling ETH A Security Bloomberg ETF analyst James Seyffart said the filing increases the odds of a denial, adding that the request for public feedback “almost guarantees” that the regulator is considering labeling ETH a security. Looks like odds just went up for SEC to deny Ethereum ETFs by claiming #Ethereum is a security. Not a guarantee that they will do this but i think this almost guarantees that the SEC is at least considering it. (not groundbreaking but first i've seen in public SEC documents) https://t.co/JK7M9G9Ttu — James Seyffart (@JSeyff) May 14, 2024 VanEck’s spot ETH ETF is the first filing that might get rejected, with the final deadline for the SEC to deliver a decision set for May 23. Should the regulator choose to reject that application, the commission would likely do the same for the spot ETH ETFs filed by Hasdex, ARK21Shares, Invesco Galaxy, Fidelity and BlackRock.s Related Articles: Best Altcoins to Invest In: Unveiling Top Picks for Maximum Returns! Cat-Themed Cryptos Explode After Roaring Kitty Returns To Ignite A Meme Coin Rally Led By GameStop (GME) Multi-Chain Meme Coin with 100x Potential Launch Soon – Could This Be The Next WIF? Source: https://thebittimes.com/bloomberg-says-odds-of-sec-approving-ethereum-etfs-slim-to-none-as-new-filing-details-emerge-tbt88372.html","article_summary":"Bloomberg says the chances of the US Securities and Exchange Commission (SEC) approving spot Ethereum ETFs (exchange-traded funds) this month are “slim to none” as new filing details emerge.This view comes after analysts...","publisher":{"name":"The Bit Times","logo":"https://logo.clearbit.com/thebittimes.com?size=96"},"creation_date":"2024-05-15T08:45:30Z","categories":["ethereum","eth","btc","bitcoin","wif"],"article_link":"https://thebittimes.com/bloomberg-says-odds-of-sec-approving-ethereum-etfs-slim-to-none-as-new-filing-details-emerge-tbt88372.html","thumbnail_image":"https://cdn.thebittimes.com/vimedia/w800/2024/05/15/308986425e839ebcf75ba8667dd72085.webp"},{"article_title":"Robinhood launches Solana (SOL) staking in Europe","author":"Benson Toti","article_detailed_content":"Robinhood Crypto has announced launch of Solana (SOL) staking for its customers in Europe. New customers will also enjoy a 10% bonus on net buys. Robinhood is expanding its services and products for users in Europe. On Wednesday, the trading platform announced it was launching new features that include Solana (SOL) staking, localized apps and crypto rewards among others. The new features will target new customers, Robinhood Crypto said in an update. Robinhood launches SOL staking in Europe As part of its growth efforts, Robinhood Crypto now offers its “first-ever crypto staking product”. The platform said Solana (SOL) staking is now available directly via its app, which means users can earn rewards from their staked SOL tokens. The product will offer the flexibility of users being able to unstake at any time. “Robinhood Crypto is already one of the lowest cost places to trade on average with an easy-to-use interface that prioritizes education. Today’s news is a significant step forward in our mission to offer customers a more tailored in-app experience that meets their specific needs and helps them on their financial journey,” Johann Kerbrat, VP and GM of Robinhood Crypto said in a statement. Staking rewards, bonuses Other than the staking rewards, new customers have a chance to unlock a 10% bonus on net buys accrued over the user’s first 30 days of trading. Payouts for the bonuses will be in USDC. New customers will also benefit from the Learn & Earn modules the platform has launched, with initial focus on Bitcoin (BTC), Avalanche (AVAX) and the USDC stablecoin. The products are tailor-made to bolster customers’ knowledge and understanding of different cryptocurrencies. The new features also include localized apps, with local language versions of the app launched in Italy, Poland and Lithuania. Robinhood Crypto will be unveiling these localized app versions in coming weeks, the company announced. The post Robinhood launches Solana (SOL) staking in Europe appeared first on CoinJournal.","article_summary":"Robinhood Crypto has announced launch of Solana (SOL) staking for its customers in Europe. New customers will also enjoy a 10% bonus on net buys. Robinhood is expanding its services and products for users in Europe. On Wednesday, the trading platform announced it was launching new features that include Solana (SOL) staking, localized apps and […] The post Robinhood launches Solana (SOL) staking in Europe appeared first on CoinJournal.","publisher":{"name":"CoinJournal","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://coinjournal.net/&size=64"},"creation_date":"2024-05-15T08:44:08Z","categories":["solana","sol","crypto","usdc","bitcoin","btc","avalanche","avax"],"article_link":"https://coinjournal.net/news/robinhood-launches-solana-sol-staking-in-europe/","thumbnail_image":""}]}