{"count":1068,"totalPages":214,"categories":[{"category":"blockchain","articles":[{"article_title":"Bitcoin Investors Are Flocking to These Altcoins","author":"thebittimes@thebitfinance.com (TheBitTimes.Com)","article_detailed_content":"Table of Contents PawFury (PAW): The Memecoin Sensation Cardano (ADA): The Smart Contract Pioneer Ripple (XRP): The Banking Innovator Introduction: Bitcoin investors are diversifying their portfolios by flocking to promising altcoins. Here are the top altcoins attracting Bitcoin investors in 2024. PawFury (PAW): The Memecoin Sensation PawFury (PAW) is making waves in the crypto community. With $2.5 million raised in its presale and a robust community of over 30,000 members, PawFury is poised for significant growth. Analysts predict a 20x ROI upon its listing on major exchanges. The presale is selling out fast, making it a prime opportunity for early investment. This makes PawFury a top contender for investors seeking a high-potential crypto. Cardano (ADA): The Smart Contract Pioneer Cardano (ADA) is gaining traction for its scientific approach to blockchain development. Its focus on scalability and sustainability makes it a strong competitor in the altcoin market. Ripple (XRP): The Banking Innovator Ripple (XRP) continues to innovate in the realm of cross-border payments. Its partnerships with major financial institutions make it a valuable addition to any crypto portfolio. Conclusion: While Bitcoin (BTC), Ethereum (ETH), and Solana (SOL) dominate the crypto landscape, emerging altcoins like PawFury (PAW), Cardano (ADA), and Ripple (XRP) offer unique opportunities for high returns. PawFury's presale success and strong community support make it a standout investment. Secure your place in the PawFury presale now and take advantage of the 10% EXTRA BONUS using the promo code EXTRA10X. Discover the exciting opportunities of the PawFury presale: Official Website: PawFury.com Follow PawFury on Twitter: PawFury Twitter Source: https://thebittimes.com/bitcoin-investors-are-flocking-to-these-altcoins-tbt88713.html","article_summary":"Table of ContentsPawFury (PAW): The Memecoin SensationCardano (ADA): The Smart Contract PioneerRipple (XRP): The Banking InnovatorIntroduction: Bitcoin investors are diversifying their portfolios by flocking to promising altcoins....","publisher":{"name":"The Bit Times","logo":"https://logo.clearbit.com/thebittimes.com?size=96"},"creation_date":"2024-05-18T08:45:07Z","categories":["bitcoin","cardano","ada","xrp","crypto","blockchain","btc","ethereum","eth","solana","sol"],"article_link":"https://thebittimes.com/bitcoin-investors-are-flocking-to-these-altcoins-tbt88713.html","thumbnail_image":"https://cdn.thebittimes.com/vimedia/w800/2024/05/18/1716011741.webp"},{"article_title":"Fantom Unveils More Details for Sonic Network, FTM Price Rally to Continue?","author":"Bhushan Akolkar","article_detailed_content":"In the latest development, the Fantom Foundation has revealed additional details of its new Layer-1 blockchain Sonic Network, which connects to Ethereum via a Layer-2 bridge. This will allow Sonic to tap into a large number of users, liquidity, and other protocols. Connecting Fantom’s Sonic With Ethereum The combination of these two cutting-edge technologies, Sonic Network and Sonic Bridge, will position Sonic in a class of its own. For the first time, an ecosystem will enjoy the full benefits of a layer-1 blockchain while offering native access to ETH. This enables the network to integrate the low cost, scalability, and speed of a layer-1 blockchain with the security of a layer-2 bridge, providing access to native ETH and other assets on Ethereum. Sonic technology has undergone intense development, culminating in the upgraded Opera chain, which now achieves 2,000 TPS of real-world traffic with single-second finality, significantly reducing storage needs and costs. As a next-generation platform for builders, Sonic will empower dApps and communities to flourish. Upgrading from $FTM to $S Upon the launch of the Sonic chain, the supply of $S will align with that of $FTM, facilitating a smooth transition process, as per the press release. Pending the outcome of the governance vote initiated today, users will have the opportunity to migrate their $FTM tokens to the new $S token at a 1:1 ratio during genesis. With the introduction of the Sonic chain, developers, applications, and users within the Fantom ecosystem will have ample opportunity to transition to this innovative platform. Initially, this migration process is expected to be bidirectional, allowing users to switch between $FTM and $S tokens. Given that $S will exclusively exist on Sonic and $FTM on Opera, a bridge is anticipated to facilitate bidirectional swaps. This approach ensures a seamless migration for current Opera network participants to embrace the Sonic experience However, once the transitional period ends, the migration will be one-way from $FTM to $S. This news can provide additional fuel to the Fantom (FTM) price which has already been on a strong surge over the past week. As of press time, the Fantom (FTM) price is trading 7.13% up at $0.8595 with a market cap of $2.4 billion. Over the last week, the Fantom price is up by nearly 20% amid the surge in the total value locked (TVL) on the protocol. The post Fantom Unveils More Details for Sonic Network, FTM Price Rally to Continue? appeared first on CoinGape.","article_summary":"In the latest development, the Fantom Foundation has revealed additional details of its new Layer-1 blockchain Sonic Network, which connects to Ethereum via a Layer-2 bridge. This will allow Sonic to tap into a large number of users, liquidity, and other protocols. Connecting Fantom’s Sonic With Ethereum The combination of these two cutting-edge technologies, Sonic The post Fantom Unveils More Details for Sonic Network, FTM Price Rally to Continue? appeared first on CoinGape.","publisher":{"name":"CoinGape","logo":"https://logo.clearbit.com/coingape.com?size=96"},"creation_date":"2024-05-18T08:29:16Z","categories":["fantom","ftm","blockchain","ethereum","eth","token"],"article_link":"https://coingape.com/fantom-unveils-more-details-for-sonic-network-ftm-price-rally-to-continue/","thumbnail_image":"https://coingape.com/wp-content/uploads/2024/03/Fantom-Token-Price.jpg"},{"article_title":"Arbitrum Price Jumps 5% As Whale Heavily Bags ARB, What’s Next?","author":"Coingape Staff","article_detailed_content":"In an unprecedented development, Arbitrum’s (ARB) price has taken a dramatic upward turn today, May 18, sparking a wave of excitement across the broader crypto market. This sudden surge aligns with a substantial amount of ARB being amassed by a single whale in the past 24 hours, as revealed by blockchain data surfacing across the global crypto horizon. Further, coming in the midst of a consolidation period witnessed by ARB, this transaction has ignited a flurry of optimistic market sentiments surrounding the crypto’s future price movements. Let’s delve deeper into the whale data orbiting Arbitrum and its current market statistics. Whale Bags Over 4 Mln ARB From Binance According to insights from numerous on-chain analytics platforms, whale 0x695 accumulated 4.17 million ARB, worth $4.3 million, from Binance in the past 24 hours. Further, this whale has been recorded trading ARB since July 2023, experiencing considerable losses. Notably, the whale bought 39 million ARB, worth $49 million, at an average price of $1.25. Thereafter, the address sold 37.5 million ARB at an average price of $1.2, suffering a loss of more than $2M. This has stirred a whirlpool of speculations about the whale’s investment strategies and Arbitrum’s potential to offer gains. Meanwhile, it’s worth noting that the address still holds 5.98 million ARB. In addition, insights shared by ‘The Data Nerd’ spotlighted that some of this whale’s ARB holdings are also staked in AAVE and Compound. Also Read: Still in ICO Phase, Mollars Token Got 90% The Search Volume of Bonk Inu Memecoin Arbitrum Price Jumps As of writing, ARB’s price traded at $1.02, up 1.66% over the past day. Besides, it’s worth noting that the token’s 24-hour lows and highs are $1.00 and $1.07, respectively, underscoring nearly 5% gains witnessed recently. This chronicle has garnered noteworthy attention, as Coinglass data spotlighted a market uptrend for Arbitrum at press time. ARB’s OI surged 14.27% to $204.74 million, followed by a derivatives volume upswing of 69.31% to $400.03 million. This data highlighted heightened market trading activity for the token, further escorted by a substantial increase in investor interest in the digital asset. Coupled with the massive whale accumulation mentioned above, Arbitrum has set off waves across the crypto space today. Also Read: US Leads Global Bitcoin ETF Inflow Of $10B In Q1 The post Arbitrum Price Jumps 5% As Whale Heavily Bags ARB, What’s Next? appeared first on CoinGape.","article_summary":"In an unprecedented development, Arbitrum’s (ARB) price has taken a dramatic upward turn today, May 18, sparking a wave of excitement across the broader crypto market. This sudden surge aligns with a substantial amount of ARB being amassed by a single whale in the past 24 hours, as revealed by blockchain data surfacing across the The post Arbitrum Price Jumps 5% As Whale Heavily Bags ARB, What’s Next? appeared first on CoinGape.","publisher":{"name":"CoinGape","logo":"https://logo.clearbit.com/coingape.com?size=96"},"creation_date":"2024-05-18T08:21:20Z","categories":["arbitrum","arb","crypto","blockchain","aave","token","bonk","bitcoin"],"article_link":"https://coingape.com/arbitrum-price-jumps-5-whale-heavily-bags-arb-what-next/","thumbnail_image":"https://coingape.com/wp-content/uploads/2023/04/image-713-11-e1710860496728.webp"},{"article_title":"Bitcoin (BTC) Stability Questioned as Miners Face Lower Fees; $65 Million BTC Transaction Utilizes Tron Network","author":"Gideon Wolf","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! As Bitcoin continues to evolve, the sustainability of mining operations faces new challenges with reduced transaction fees and block rewards. Recently, a significant transaction involving a whale who transferred $65 million worth of Bitcoin using the Tron blockchain has spotlighted the […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! As Bitcoin continues to evolve, the sustainability of mining operations faces new challenges with reduced transaction fees and block rewards. Recently, a significant transaction involving a whale who transferred $65 million worth of Bitcoin using the Tron blockchain has spotlighted the […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-18T08:14:05Z","categories":["bitcoin","btc","tron","pepe","blockchain"],"article_link":"https://en.coinotag.com/bitcoin-btc-stability-questioned-as-miners-face-lower-fees-65-million-btc-transaction-utilizes-tron-network/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-16.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Billionaire Telegram Founder Pavel Durov Holds $7 Million in Notcoin, Pledges to Hold Until 100x","author":"Ruholamin Haqshanas","article_detailed_content":"Pavel Durov, the founder of Telegram, has received a generous donation from over half a million players of the viral Telegram-based clicker game called Notcoin. The players donated a portion of their in-game coins to Durov as a gesture of gratitude for the messaging app that hosts the crypto game. The donated haul has now surged in value to millions of dollars, and Durov has said he plans to hold onto the tokens until they experience a 100x increase. Over Notcoin 552,000 Players Donate to Durov In February, more than 552,000 players of Notcoin contributed a share of their in-game coins to Durov, resulting in him acquiring over 1.03 billion NOT tokens. This accounts for slightly over 1% of the total Notcoin supply on The Open Network (TON). As of this writing, the value of these tokens stands at approximately $7.3 million, though it was slightly lower at $6.8 million when Durov made the announcement. Durov, with an estimated fortune of $15.5 billion according to Forbes, is not in dire need of the cash and has no plans to sell the tokens. However, he has stated that if the value of the NOT token surges to $680 million, he will sell them to acquire additional servers for Telegram, further supporting the messaging app’s infrastructure. 1,030,383,291.36 Notcoin ($6.8M USD) were sent as donation to Pavel Durov and Telegram. Thanks for everything you guys built.https://t.co/ZaBgB22yyg pic.twitter.com/8gmNjbBs3s — Notcoin Ø (@thenotcoin) May 17, 2024 Notcoin, which launched as this year’s largest gaming token, debuted with a market capitalization of nearly $1.5 billion. As is often the case with new cryptocurrencies, the value of NOT has experienced volatility since its launch, plummeting by 50% to its current price slightly above $0.007, according to CoinMarketCap. Despite the decline, NOT currently ranks as the 101st most valuable cryptocurrency by market capitalization, amounting to $746 million. Impressively, it amassed trading volume worth over $1 billion within the first 24 hours of its launch. Having temporarily paused its coin-tapping gameplay in April to prepare for the token rollout, Notcoin is set to relaunch its crypto-earning game. The ultimate goal is for Notcoin to serve as a platform for additional games, aspiring to become the “Netflix of social, viral games,” as described by co-creator Sasha Plotvinov in an interview with Decrypt’s GG in April. TON Space Will be Available Starting November Starting in November, TON Space, a self-custodial wallet, will be accessible to Telegram’s global user base without requiring any wallet registration. This feature serves as an extension of the existing custodial version of the Telegram wallet, which has already amassed three million registered users. However, certain jurisdictions, such as the United States, are currently excluded from the self-custodial wallet due to the country’s increased regulatory scrutiny and the geofencing of numerous crypto apps from the market. The launch of a new wallet comes as Telegram TON Blockchain has introduced a new feature that enables Telegram users to transfer Tether (USDT). More recently, the team overseeing The Open Network (TON) blockchain also completed its transition into a Swiss non-profit organization. The post Billionaire Telegram Founder Pavel Durov Holds $7 Million in Notcoin, Pledges to Hold Until 100x appeared first on Cryptonews.","article_summary":"Pavel Durov, the founder of Telegram, has received a generous donation from over half a million players of the viral Telegram-based clicker game called Notcoin. The post Billionaire Telegram Founder Pavel Durov Holds $7 Million in Notcoin, Pledges to Hold Until 100x appeared first on Cryptonews.","publisher":{"name":"Crypto News","logo":"https://t1.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://cryptonews.com/&size=64"},"creation_date":"2024-05-18T08:00:36Z","categories":["crypto","ton","token","cryptocurrency","blockchain","tether","usdt"],"article_link":"https://cryptonews.com/news/billionaire-telegram-founder-pavel-durov-holds-7-million-in-notcoin-pledges-to-hold-until-100x.htm","thumbnail_image":"https://cimg.co/wp-content/uploads/2024/05/18053813/1716010693-1716010578464_processed.jpg"}]}],"currentPage":2}