{"count":9690,"totalPages":323,"currentPage":2,"articles":[{"article_title":"Finalto Asia Advances into Singapore’s Business Hub: A Strategic Move for Crypto Market Expansion, Featuring Bitcoin (BTC) and Ethereum (ETH)","author":"Marisol Navaro","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Finalto Asia, a leading provider of trading software and liquidity services, has relocated its operations to a new office in Singapore’s business district. The move comes as part of the company’s strategic expansion in the Asian market, particularly after obtaining its […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Finalto Asia, a leading provider of trading software and liquidity services, has relocated its operations to a new office in Singapore’s business district. The move comes as part of the company’s strategic expansion in the Asian market, particularly after obtaining its […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T14:10:19Z","categories":["crypto","bitcoin","btc","ethereum","eth","pepe"],"article_link":"https://en.coinotag.com/finalto-asia-advances-into-singapores-business-hub-a-strategic-move-for-crypto-market-expansion-featuring-bitcoin-btc-and-ethereum-eth/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-12.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Sonne Finance exploited for $20m, offers hacker reward for returning funds","author":"Anna Kharton","article_detailed_content":"The Sonne Finance landing protocol team announced that the project was hacked for $20 million","article_summary":"The Sonne Finance landing protocol team announced that the project was hacked for $20 million","publisher":{"name":"Crypto.news","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://crypto.news/&size=64"},"creation_date":"2024-05-15T14:06:43Z","categories":["general"],"article_link":"https://crypto.news/sonne-finance-exploited-hacked/","thumbnail_image":"https://crypto.news/app/uploads/2024/01/crypto-news-cryptocurrency-hack-pyramid-scheme-option03.webp"},{"article_title":"Spinning with Crypto: Safe Play Starts at Kiwislots","author":"AMBCrypto Team","article_detailed_content":"Crypto and by extension, crypto gambling, continues to slowly but surely enter the public domain. […]","article_summary":"Crypto and by extension, crypto gambling, continues to slowly but surely enter the public domain. […]","publisher":{"name":"AMBCrypto","logo":"https://logo.clearbit.com/ambcrypto.com?size=96"},"creation_date":"2024-05-15T14:05:28Z","categories":["crypto"],"article_link":"https://ambcrypto.com/spinning-with-crypto-safe-play-starts-at-kiwislots/","thumbnail_image":"https://ambcrypto.com/wp-content/uploads/2024/05/carl-raw-7H7KVCihBvI-unsplash-e1715780329966.jpg"},{"article_title":"Algotech gains as Bitcoin spikes towards $64k on latest CPI report","author":"thebittimes@thebitfinance.com (TheBitTimes.Com)","article_detailed_content":"Bitcoin price rose to near $64,000 as stock futures climbed. The upside came after US inflation data showed consumer prices rose less than expected in April. Algotech, a new crypto trading project, continued to attract investors as its presale crossed $4.8 million. As stock futures rose on Wednesday, Bitcoin price jumped more than 2% to break above $63,700. The benchmark cryptocurrency’s rise towards $64,000 saw altcoins flip green. Amid the gains for alts such as Ethereum, Toncoin and Avalanche, new Crypto project Algotech swelled in presale. Bitcoin surges as CPI rises less than expected On Wednesday, data on inflation showed that the consumer price index (CPI), the US Federal Reserve’s preferred inflation gauge, only rose 0.3% in April. That was lower than the expectation of 0.4% for the month-on-month increase, CNBC reported. While the inflation reading remains above 3%, its overall dip to 3.36% year-over-year in April from the 3.48% reported in March attracted a reaction across markets. Also notable was the US Core CPI (which excludes food and energy) – it was 3.62% YoY in April compared to 3.80% the previous month. The inflation report saw Treasury yields fell as Stocks pumped. The gains were also visible across the Crypto market, with Bitcoin jumping from below $62,000 to hit highs above $63,855. A 3.6% upside for BTC pushed the total crypto market cap up by more than 2% to over $2.43 trillion. Algotech: A new crypto trading project At its core, Algotech is a decentralized algorithmic trading platform that brings innovative crypto trading technologies to the ordinary trader. The goal is to empower traders via integration of artificial intelligence, machine learning and analytics tools. Automation and blockchain technology meet to offer a potentially game-changing platform for crypto traders. As it prepares to launch, Algotech has allocated 70% of the total of 350,000,000 ALGT to the public presale. When the current presale stage concludes, the ALGT price will increase to $0.10. Meanwhile, the estimated launch price after the presale is $0.15. Algotech gains as presale nears $5 million raise Algotech has raised more than $4.88 million in its ongoing token sale, with the current presale stage more than 75% sold out. Currently, only 14% of ALGT tokens remain unsold in stage 3. It means investors keen to grab some of the tokens at prices of $0.08 may want to take swift action. But why is the interest in Algotech rising? While today’s Bitcoin price spike towards $64k has buoyed the broader crypto market, the overall interest in Algotech is something that has built up in bounds these past few weeks. The positive sentiment around the project has strengthened as more people understand what the platform offers. Moreso, it’s the potential for its defining features to drive the next big wave in crypto trading that has investors flocking to the presale. Visit the Algotech website to learn more about this project. Source: https://thebittimes.com/algotech-gains-as-bitcoin-spikes-towards-64k-on-latest-cpi-report-tbt88423.html","article_summary":"Bitcoin price rose to near $64,000 as stock futures climbed.The upside came after US inflation data showed consumer prices rose less than expected in April.Algotech, a new crypto trading project, continued to attract investors as its...","publisher":{"name":"The Bit Times","logo":"https://logo.clearbit.com/thebittimes.com?size=96"},"creation_date":"2024-05-15T14:03:12Z","categories":["bitcoin","near","crypto","ethereum","toncoin","avalanche","core","btc","blockchain","token"],"article_link":"https://thebittimes.com/algotech-gains-as-bitcoin-spikes-towards-64k-on-latest-cpi-report-tbt88423.html","thumbnail_image":"https://cdn.thebittimes.com/vimedia/w800/2024/05/15/64eb8feda448ed4b6f1d248654495296.webp"},{"article_title":"Crypto Old-Head Otoh Talks Casascius Bitcoins, Tax Havens and Old Friends","author":"Daniel Kuhn","article_detailed_content":"The pseudonymous investor – early to both Ethereum and Litecoin – has lived large. He is a speaker at this year’s Consensus festival in Austin, Texas, May 29-31.","article_summary":"The pseudonymous investor – early to both Ethereum and Litecoin – has lived large. He is a speaker at this year’s Consensus festival in Austin, Texas, May 29-31.","publisher":{"name":"CoinDesk","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.coindesk.com/&size=64"},"creation_date":"2024-05-15T14:02:08Z","categories":["crypto","ethereum","litecoin"],"article_link":"https://www.coindesk.com/opinion/2024/05/15/crypto-old-head-otoh-talks-casascius-bitcoins-tax-havens-and-old-friends/?utm_medium=referral&utm_source=rss&utm_campaign=headlines","thumbnail_image":"https://www.coindesk.com/resizer/VNKf6Ut9cttL4cfJROLVzWj1H2w=/800x600/cloudfront-us-east-1.images.arcpublishing.com/coindesk/3UAMX56J3VG3HFTLY2CMLORHYM.jpg"},{"article_title":"Anchorage Digital announces support for native DYDX staking","author":"Florence Muchai","article_detailed_content":"Anchorage Digital, an institutional crypto platform, has announced its endorsement for native DYDX staking. Currently, institutions have the ability to deposit DYDX into secure custody at Anchorage Digital and get staking incentives in USDC from the protocol. Anchorage Digital is a crypto platform that allows institutions to invest in digital assets by providing services such as custody, staking, trading, governance, settlement, and top-notch security infrastructure. Anchorage Digital moves in on native DYDX staking Anchorage Digital is the home of the only federally authorized digital asset bank and offers some of the biggest names in traditional and decentralized finance crypto custody, staking, and other services. Anchorage Digital has backed native DYDX custody since the dYdX Chain launched in Q4 of last year and ethDYDX custody since the mainnet debut in August 2021. For many institutions, custody is just the start. Increasingly, institutions want to engage in staking, earn rewards, and contribute to the long-term scaling of innovative networks like dYdX. By adding staking support for its native token, DYDX, Anchorage Digital is proud to help unlock a new era of institutional participation in the dYdX ecosystem. Nathan McCauley, CEO and Co-Founder of Anchorage Digital Anchorage Digital offers support for a wide range of assets, carefully chosen to meet the high standards of institutional demand and ensure quality and safety. Customers have the opportunity to stake DYDX and receive staking rewards, as both the DYDX tokens and USDC tokens earned are securely held in custody on the Anchorage Digital platform. Anchorage Digital’s integration of native DYDX staking initiates a new era of institutional engagement with dYdX. Staking involves more than just the accumulation of USDC rewards; it is a proactive effort to enhance the growth and sustainability of the dYdX ecosystem. This collaboration provides best in class custody solutions and boosts the attractiveness of the protocol. Charles d’Haussy, CEO of dYdX Foundation The dYdX Chain is the leading DeFi system that specializes in perpetual futures. It operates in a fully decentralized manner and is regulated by the community. The protocol fees are distributed in their whole to DYDX stakers in order to enhance the security of the dYdX Chain. According to Mintscan, the dYdX Chain has achieved a total trading volume of over $136 billion and has distributed more over $23 million in USDC as staking rewards to nearly 20,000 stakers since its introduction six months ago. As of May 13, 2024, the current annual return rate stands at 18%. Anchorage’s inclusion of staking support for native DYDX strengthens institutional interest by leveraging Anchorage’s secure and regulated custodial services. This collaboration offers a regulatory-compliant staking solution for individuals who own DYDX tokens. Additionally, it promotes the adoption of DYDX tokens by institutional investors, thereby helping to the overall expansion of the ecosystem. The companies partnership The primary objective of the dYdX Foundation is to foster and expand the dYdX protocol ecosystem by facilitating the participation of communities, developers, and decentralized governance. The dYdX Chain software is open-source and can be used or integrated by any entity in compliance with the relevant license. Per its development, the dYdX Chain and its software should never be considered as a product or service offered or given by the dYdX Foundation in any manner. The entity advises that engaging with the dYdX Chain software or any related implementation is unrestricted and free from intermediaries, but must adhere to the restrictions of the relevant licenses and code. On the other hand, Anchorage Digital supports institutions through Anchorage Digital Singapore, Porto by Anchorage Digital, and other solutions. Anchorage Digital Bank N.A. is the only federally chartered crypto bank in the United States. Leading investors like Andreessen Horowitz, GIC, Goldman Sachs, KKR, and Visa have contributed to the company’s above $3 billion Series D valuation. The entity, which was founded in 2017 in San Francisco, California, also maintains offices in Singapore, Sioux Falls, South Dakota, New York, and Portugal.","article_summary":"Anchorage Digital, an institutional crypto platform, has announced its endorsement for native DYDX staking. Currently, institutions have the ability to deposit DYDX into secure custody at Anchorage Digital and get staking incentives in USDC from the protocol. Anchorage Digital is a crypto platform that allows institutions to invest in digital assets by providing services such […]","publisher":{"name":"Cryptopolitan","logo":"https://t0.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.cryptopolitan.com/&size=64"},"creation_date":"2024-05-15T14:01:41Z","categories":["dydx","crypto","usdc","token","defi"],"article_link":"https://www.cryptopolitan.com/anchorage-digital-adds-dydx-staking-support/","thumbnail_image":"https://www.cryptopolitan.com/wp-content/uploads/2024/05/Anchorage-Digital.jpg"},{"article_title":"Algotech gains as Bitcoin spikes towards $64k on latest CPI report","author":"Benson Toti","article_detailed_content":"Bitcoin price rose to near $64,000 as stock futures climbed. The upside came after US inflation data showed consumer prices rose less than expected in April. Algotech, a new crypto trading project, continued to attract investors as its presale crossed $4.8 million. As stock futures rose on Wednesday, Bitcoin price jumped more than 2% to break above $63,700. The benchmark cryptocurrency’s rise towards $64,000 saw altcoins flip green. Amid the gains for alts such as Ethereum, Toncoin and Avalanche, new crypto project Algotech swelled in presale. Bitcoin surges as CPI rises less than expected On Wednesday, data on inflation showed that the consumer price index (CPI), the US Federal Reserve’s preferred inflation gauge, only rose 0.3% in April. That was lower than the expectation of 0.4% for the month-on-month increase, CNBC reported. While the inflation reading remains above 3%, its overall dip to 3.36% year-over-year in April from the 3.48% reported in March attracted a reaction across markets. Also notable was the US Core CPI (which excludes food and energy) – it was 3.62% YoY in April compared to 3.80% the previous month. The inflation report saw Treasury yields fell as stocks pumped. The gains were also visible across the crypto market, with Bitcoin jumping from below $62,000 to hit highs above $63,855. A 3.6% upside for BTC pushed the total crypto market cap up by more than 2% to over $2.43 trillion. Algotech: A new crypto trading project At its core, Algotech is a decentralized algorithmic trading platform that brings innovative crypto trading technologies to the ordinary trader. The goal is to empower traders via integration of artificial intelligence, machine learning and analytics tools. Automation and blockchain technology meet to offer a potentially game-changing platform for crypto traders. As it prepares to launch, Algotech has allocated 70% of the total of 350,000,000 ALGT to the public presale. When the current presale stage concludes, the ALGT price will increase to $0.10. Meanwhile, the estimated launch price after the presale is $0.15. Algotech gains as presale nears $5 million raise Algotech has raised more than $4.88 million in its ongoing token sale, with the current presale stage more than 75% sold out. Currently, only 14% of ALGT tokens remain unsold in stage 3. It means investors keen to grab some of the tokens at prices of $0.08 may want to take swift action. But why is the interest in Algotech rising? While today’s Bitcoin price spike towards $64k has buoyed the broader crypto market, the overall interest in Algotech is something that has built up in bounds these past few weeks. The positive sentiment around the project has strengthened as more people understand what the platform offers. Moreso, it’s the potential for its defining features to drive the next big wave in crypto trading that has investors flocking to the presale. Visit the Algotech website to learn more about this project. The post Algotech gains as Bitcoin spikes towards $64k on latest CPI report appeared first on CoinJournal.","article_summary":"Bitcoin price rose to near $64,000 as stock futures climbed. The upside came after US inflation data showed consumer prices rose less than expected in April. Algotech, a new crypto trading project, continued to attract investors as its presale crossed $4.8 million. As stock futures rose on Wednesday, Bitcoin price jumped more than 2% to […] The post Algotech gains as Bitcoin spikes towards $64k on latest CPI report appeared first on CoinJournal.","publisher":{"name":"CoinJournal","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://coinjournal.net/&size=64"},"creation_date":"2024-05-15T14:01:36Z","categories":["bitcoin","near","crypto","ethereum","toncoin","avalanche","core","btc","blockchain","token"],"article_link":"https://coinjournal.net/news/algotech-gains-as-bitcoin-spikes-towards-64k-on-latest-cpi-report/","thumbnail_image":""},{"article_title":"Ex-FTX Executive Ryan Salame Faces 18-Month Sentence, Expresses Remorse: Impact on Crypto Market and FTX Coin (FTT)","author":"Gideon Wolf","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Former FTX Executive Ryan Salame Pleads for Leniency in Court Former FTX executive Ryan Salame pleads for an 18-month sentence, citing cooperation and remorse. Salame’s attorneys argue that his role in the fraudulent activities was more operational than central. FTX bankruptcy […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Former FTX Executive Ryan Salame Pleads for Leniency in Court Former FTX executive Ryan Salame pleads for an 18-month sentence, citing cooperation and remorse. Salame’s attorneys argue that his role in the fraudulent activities was more operational than central. FTX bankruptcy […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T14:01:28Z","categories":["crypto","pepe"],"article_link":"https://en.coinotag.com/ex-ftx-executive-ryan-salame-faces-18-month-sentence-expresses-remorse-impact-on-crypto-market-and-ftx-coin-ftt/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies36.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Exploring Notcoin (NOT): The Rising Star Token on Telegram Open Network","author":"Gideon Wolf","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! The Telegram Open Network (TON) has been booming throughout the past year, becoming one of the largest projects in the industry by means of total market capitalization. This has been attributed to its bustling ecosystem, with more developers and users turning […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! The Telegram Open Network (TON) has been booming throughout the past year, becoming one of the largest projects in the industry by means of total market capitalization. This has been attributed to its bustling ecosystem, with more developers and users turning […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T14:00:47Z","categories":["token","pepe","ton"],"article_link":"https://en.coinotag.com/exploring-notcoin-not-the-rising-star-token-on-telegram-open-network/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies37.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Bitcoin, Ethereum underperform as crypto market remains bearish","author":"Adewale Olarinde","article_detailed_content":"The crypto market’s bearish sentiment is due to large-cap assets seeing declines in prices.","article_summary":"The crypto market’s bearish sentiment is due to large-cap assets seeing declines in prices.","publisher":{"name":"AMBCrypto","logo":"https://logo.clearbit.com/ambcrypto.com?size=96"},"creation_date":"2024-05-15T14:00:40Z","categories":["bitcoin","ethereum","crypto"],"article_link":"https://ambcrypto.com/bitcoin-ethereum-underperform-as-crypto-market-remains-bearish/","thumbnail_image":"https://ambcrypto.com/wp-content/uploads/2024/05/Crypto_markets_falling_sentiment-1.webp"},{"article_title":"Smart Altcoin Choices for Record-Breaking Earnings","author":"thebittimes@thebitfinance.com (TheBitTimes.Com)","article_detailed_content":"As the bull run of 2024 unfolds, selecting the right altcoins can lead to substantial financial gain. Investors are searching for the next big earners, and this article provides insights into promising altcoins. It offers a guide to navigate the flourishing market, focusing on standout choices poised to deliver impressive returns. Whether you're a seasoned investor or new to the scene, understanding which altcoins to watch is crucial in this dynamic period of growth. CYBRO Presale Runs Fast with 25M Tokens Already Sold Out CYBRO is a one-of-a-kind marketplace that leverages the native yield potential of the Blast blockchain. CYBRO offers early investors to enter the project on favorable terms by joining the CYBRO token presale. At this stage, CYBRO tokens are available at discounts of 3 times off their future market price, generating a generous ROI of 200%. The supply of the tokens is limited, and nearly 25M tokens have already been sold out. The earlier you buy, the bigger discount you get. Buy $CYBRO at the Best Price NOW to Secure 200% Profits The CYBRO token will unlock cashback in CYBRO, discounted fees for trading and lending operations, staking rewards, an exclusive Airdrop, and the Insurance Program. This solid utility will set a strong base for CYBRO to rise in value post-TGE in Q3 2024. With CYBRO, you can grow your crypto by investing in various vaults on Blast, the only Layer 2 blockchain to offer default yield for ETH and stablecoins staking. CYBRO's ultimate goal is to provide users with the highest returns possible for each strategy, while ensuring a simple and transparent interface. Secure Your Place in CYBRO at 66% Discount Today! Offer is Limited! Sei Crypto: Navigating the Price Trend Sei has seen substantial growth over six months with an increase of 202.62%, signaling strong interest. Despite a recent downturn with a one-week decline of 12.90% and one-month drop of 6.36%, Sei trades between $0.47 and $0.56. It's approaching a support level at $0.43; if that breaks, the next support is at $0.34. Resistance lies at $0.62 and $0.71. With an RSI of 42.40, the price appears to be in a corrective phase, indicating potential for recovery or further decline. Celestia Price Analysis and Prediction Celestia's price has seen a drop recently, now fluctuating between $8.51 and $10.23. In the past week, TIA's value fell by roughly 15%, while the monthly figure shows a larger 24% decline. Despite this recent dip, it has grown by 39% over the past six months. The price seems to be in a corrective move based on the low RSI and Stochastic values, which may indicate it's been oversold. Forecasts suggest a potential rebound if it stays above the main support level at $7.89, possibly testing the resistance at $11.33 soon. However, staying cautious is essential as a break below the support could lead to further drops toward $6.17. Avalanche Price Movement: Between Correction and Growth Avalanche (AVAX) has seen a mix of price movements recently. In the past week, AVAX dropped by 7.72% and in the last month, it slipped by 12.53%. Despite these decreases, the six-month overview shows an impressive gain of 50.12%. Currently, the price fluctuates between $30.69 and $37.75. The RSI at 57.29 suggests that AVAX isn't overbought, while a high Stochastic reading of 89.16 may indicate potential for a price pullback. The MACD level at 0.027 is low, hinting that the coin might be in a mild uptrend or preparing for a move higher. The moves appear corrective as the price remains above both support levels and attempts to approach the nearest resistance at $42.35. If the momentum continues, we could see AVAX testing further highs near second resistance at $49.41. Starknet Price Analysis: Volatility Persists Starknet (STRK) has seen a significant rise over six months, jumping around 469%. Currently, it fluctuates between $1.11 and $1.35. Despite a recent downturn over the last month with a drop of about 23%, its weekly decline sits just over 7%. The current movement suggests a trend towards correction, as indicated by an RSI below 50 and a Stochastic value hinting at possible undervaluation. If STRK can hold above the $1.03 support, it may avoid sliding toward the second support at $0.79. However, a push past $1.51 could reignite bullish efforts towards the $1.75 level. Conclusion Choosing smart altcoins could lead to significant earnings. Coins like SEI, TIA, AVAX, and STRK may not offer immediate high returns. However, the spotlight shines on CYBRO, a unique marketplace built on the Blast blockchain. Its upcoming release in the second quarter of 2024 marks a promising period for investors seeking advantageous entry points. The presale of CYBRO tokens presents an early opportunity to engage with the project's inherent yield potential. Site: https://cybro.io Twitter: https://twitter.com/Cybro_io Discord: https://discord.gg/xFMGDQPhrB Telegram: https://t.me/cybro_io Source: https://thebittimes.com/smart-altcoin-choices-for-record-breaking-earnings-tbt88399.html","article_summary":"As the bull run of 2024 unfolds, selecting the right altcoins can lead to substantial financial gain. Investors are searching for the next big earners, and this article provides insights into promising altcoins. It offers a guide to...","publisher":{"name":"The Bit Times","logo":"https://logo.clearbit.com/thebittimes.com?size=96"},"creation_date":"2024-05-15T14:00:11Z","categories":["blockchain","token","crypto","eth","sei","celestia","avalanche","avax","near","starknet","strk","tia"],"article_link":"https://thebittimes.com/smart-altcoin-choices-for-record-breaking-earnings-tbt88399.html","thumbnail_image":"https://cdn.thebittimes.com/vimedia/w800/2024/05/15/1715776458.webp"},{"article_title":"Rated, Home of the Industry’s Leading Network Explorer, Launches on Solana","author":"Advertorial","article_detailed_content":"Rated monitors node and node operator performance and risk on Proof of Stake networks, where node operators and validators steward billions in value. Rated is pleased to introduce the Solana Network Explorer, offering a detailed, real-time overview of Solana’s network performance, allowing users to delve into the specifics of consensus data and validators that secure billions of dollars in value. A significant amount of blockchain and transactional value is being built natively on the internet, yet information about how they perform and the risks underlying them is fragmented. Block explorers are essential, yet the work carried out by network operators and the underlying blockchain infrastructure providers is often in the dark. Solana’s performance driven design is entirely reliant on the network of validators who make up the Solana Network. There are currently around 1767 validators securing the Solana with an active stake of approximately 58 Billion USD, across over 1 million active staking accounts. Questions often arise about the actual composition of the network, Who are the network operators and stakers ? What risks are they taking, and how do they perform? The Rated Solana Network Explorer and suite of API tools answers these questions by providing detailed insights into the present and historical state of the network, including operator performance, commissions, network penetration, vote effectiveness/latency, client, geo and host distribution, and more. In the blockchain realm, traditional metrics like uptime, latency, and APY only tell part of the story about a network’s health and the standing of the operators within it , Rated saw the need to develop RAVER, an open-source methodology aimed at measuring risk-adjusted performance more comprehensively. Reliable and up-to-date network state data forms a crucial foundation for sophisticated blockchains like Solana. Rated’s methodology not only sheds light on the specifics of the Solana’s network but also establishes a path forward towards enhanced transparency, accountability, and ongoing innovation. “The introduction of the Solana Explorer on Rated adds valuable context to the Solana validator network and is an important step in making it easy for users to monitor and understand the network’s core functioning.” Amira @ Solana Foundation “We’re really excited to be launching support for Solana. This release stands on the shoulders of innovations in wrangling with the myriad of data points that the network produces, which we think will add material value to the ecosystem.” Elias Simos @ Rated To explore Solana’s network and operators, visit the Solana Rated Explorer About Rated Labs Rated Labs is a pioneer in the Web3 infrastructure data space. Since its inception in 2022, the company has seen nearly 250k unique visitors on its network explorer, 15k MAUs, 500M calls on its API spread across 45+ integrations, as well as partnerships and integrations with leaders and innovators in the Staking ecosystem including Lido, Metamask, Liquid Collective, Chorus One, and more. Links: Explorer | API | Press Kit | Brand Guidelines The post Rated, Home of the Industry’s Leading Network Explorer, Launches on Solana appeared first on BeInCrypto.","article_summary":"Rated monitors node and node operator performance and risk on Proof of Stake networks, where node operators and validators steward billions in value. Rated is pleased to introduce the Solana Network Explorer, offering a detailed, real-time overview of Solana’s network performance, allowing users to delve into the specifics of consensus data and validators that secure … Continued The post Rated, Home of the Industry’s Leading Network Explorer, Launches on Solana appeared first on BeInCrypto.","publisher":{"name":"Be(In)Crypto","logo":"https://t3.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://beincrypto.com/&size=64"},"creation_date":"2024-05-15T14:00:00Z","categories":["solana","blockchain","core","web3"],"article_link":"https://beincrypto.com/rated-home-of-the-industrys-leading-network-explorer-launches-on-solana/","thumbnail_image":"https://beincrypto.com/wp-content/uploads/2024/05/IMG_20240515_143944_235.jpg"},{"article_title":"Bitcoin (BTC) Faces Critical Turning Point: Insights from Crypto Expert Michaël van de Poppe","author":"Gideon Wolf","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Noted crypto analyst Michaël van de Poppe predicts a crucial decision point for Bitcoin, with potential for a new all-time high or a significant sell-off. Bitcoin must maintain support at $60,500 for a chance at a major upward burst, otherwise, BTC […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Noted crypto analyst Michaël van de Poppe predicts a crucial decision point for Bitcoin, with potential for a new all-time high or a significant sell-off. Bitcoin must maintain support at $60,500 for a chance at a major upward burst, otherwise, BTC […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T13:58:24Z","categories":["bitcoin","btc","crypto","pepe"],"article_link":"https://en.coinotag.com/bitcoin-btc-faces-critical-turning-point-insights-from-crypto-expert-michael-van-de-poppe/","thumbnail_image":""},{"article_title":"Critical Developments for 28 Altcoins Today: Key Updates and Predictions (Including Coin Name and Symbol)","author":"Crypto Vira","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! The cryptocurrency space is bustling with activity today, May 15, 2024, with significant events unfolding for Bitcoin and altcoins. Both eCash (XEC) and Bitcoin Cash (BCH) are undergoing planned network upgrades today, emphasizing the critical importance of running the latest software […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! The cryptocurrency space is bustling with activity today, May 15, 2024, with significant events unfolding for Bitcoin and altcoins. Both eCash (XEC) and Bitcoin Cash (BCH) are undergoing planned network upgrades today, emphasizing the critical importance of running the latest software […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T13:56:23Z","categories":["pepe","cryptocurrency","bitcoin","ecash","xec","bch"],"article_link":"https://en.coinotag.com/critical-developments-for-28-altcoins-today-key-updates-and-predictions-including-coin-name-and-symbol/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-18.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Market Uncertainty Dampens Stablecoin Activity: Implications for Bitcoin (BTC) and Ethereum (ETH)","author":"Gideon Wolf","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! The crypto market has seen a noticeable shift towards stablecoins, as market participants show reluctance to buy assets amidst market volatility. The trend of stablecoin activity has been on a decline in recent weeks, indicating a bearish performance in the altcoin […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! The crypto market has seen a noticeable shift towards stablecoins, as market participants show reluctance to buy assets amidst market volatility. The trend of stablecoin activity has been on a decline in recent weeks, indicating a bearish performance in the altcoin […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T13:52:18Z","categories":["bitcoin","btc","ethereum","eth","pepe","crypto"],"article_link":"https://en.coinotag.com/market-uncertainty-dampens-stablecoin-activity-implications-for-bitcoin-btc-and-ethereum-eth/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-3.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Potential Roadblocks for Ethereum (ETH) ETF Approval: An In-depth Analysis","author":"Lucien Renard","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Leading ETF analyst James Seyffart suggests that the US Securities and Exchange Commission (SEC) may deny several Ethereum ETF applications in May, claiming that the underlying cryptocurrency is a security. Finance lawyer Scott Johnsson believes that the SEC will provide a […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Leading ETF analyst James Seyffart suggests that the US Securities and Exchange Commission (SEC) may deny several Ethereum ETF applications in May, claiming that the underlying cryptocurrency is a security. Finance lawyer Scott Johnsson believes that the SEC will provide a […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T13:51:01Z","categories":["ethereum","eth","pepe","cryptocurrency"],"article_link":"https://en.coinotag.com/potential-roadblocks-for-ethereum-eth-etf-approval-an-in-depth-analysis/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-21.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Komodo (KMD) Community Influences Major Changes with Successful 2024 KIP Proposals Voting","author":"Gideon Wolf","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! The Komodo community has made significant strides in the crypto world, with key proposals passing in the 2024 Komodo Improvement Proposal (KIP) voting. This marks a major milestone for the blockchain platform, demonstrating the power of decentralized governance. “This is a […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! The Komodo community has made significant strides in the crypto world, with key proposals passing in the 2024 Komodo Improvement Proposal (KIP) voting. This marks a major milestone for the blockchain platform, demonstrating the power of decentralized governance. “This is a […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T13:49:42Z","categories":["pepe","crypto","blockchain"],"article_link":"https://en.coinotag.com/komodo-kmd-community-influences-major-changes-with-successful-2024-kip-proposals-voting/","thumbnail_image":""},{"article_title":"Brillion’s Smart Wallet (BSW) Revolutionizes Digital Assets Sector with New Leadership in RWA & DePIN","author":"Marisol Navaro","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Brillion Smart Wallet Introduces New C-Suite to Lead in RWA & DePIN Sector of Digital Assets Brillion, a smart wallet development company, is welcoming three new C-suite executives to its team. The new leadership will bring diverse, industry-leading expertise and strengthen […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Brillion Smart Wallet Introduces New C-Suite to Lead in RWA & DePIN Sector of Digital Assets Brillion, a smart wallet development company, is welcoming three new C-suite executives to its team. The new leadership will bring diverse, industry-leading expertise and strengthen […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T13:48:34Z","categories":["pepe"],"article_link":"https://en.coinotag.com/brillions-smart-wallet-bsw-revolutionizes-digital-assets-sector-with-new-leadership-in-rwa-depin/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-11.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Lens Network to Migrate to zkSync: Scaling Social Networking on the Blockchain","author":"Amara Khatri","article_detailed_content":"Lens Network, an on-chain social network infrastructure, is preparing for a significant migration to zkSync's ZK Stack hyperchains, with a goal to enhance scalability and user experience in social networking on the blockchain. Lens Network's Transition to zkSync Lens Network's move to zkSync's ZK Stack hyperchains was announced on May 14. Leveraging Matter Labs' modular ZK Stack infrastructure, Lens Network plans to build a hybrid validium and volition Layer 2 solution. This design is tailored to support the high transaction throughput required by mainstream consumer applications while ensuring minimal fees. Additionally, Lens Network will implement account abstraction, enabling gasless and signless transactions to simplify user onboarding. Scalability and User Experience Matter Labs, the team behind zkSync, highlighted Lens Network's potential to overcome scaling limitations on the blockchain. By offering users an almost social media-esque experience with the benefits of web3, Lens Network could significantly contribute to mass adoption. The new Lens Network will host an updated version of the Lens Protocol, serving as a central hub for Lens users. This updated protocol will facilitate integrations with both Ethereum Virtual Machine (EVM) and non-EVM compatible blockchains. Developers will be able to build Lens-based social applications across multiple networks, expanding the reach and functionality of Lens Network. Modular ZK Stack Framework Matter Labs CEO Alex Gluchowski emphasized the benefits of the modular, open-source ZK Stack framework for Lens Network. Based on the zkSync Era code, this framework provides Lens with horizontal scaling capabilities. Gluchowski noted that the framework allows for seamless scalability, connecting multiple Lens chains as needed through zk bridges. He said, “You can add one billion users and you will not lose any of the properties of verifiability. Every single transaction of those millions and billions of users will be verified by every single Ethereum validator — which is the magic of zk.” Three-Phase Rollout Avara, the parent company of Lens and Aave, will oversee Lens Network's permissionless rollout in three phases. The rollout will begin with the launch of a validium using ZK compression techniques to ensure data accessibility. Validiums, different from rollups, publish data off-chain to reduce transaction costs and improve throughput. While a testnet release of the new Lens Network is still several months away, the current version of Lens has been operational on Polygon's PoS chain since May 2022. Avara CEO Speaks Stani Kulechov, CEO of Avara, highlighted the immense potential of non-financial use cases of crypto, such as identity and online social interactions. While no financial terms related to the migration were disclosed, Kulechov expressed confidence in organic user migration. He said, “There are a lot of people who have financial capital, but everyone on the planet has social capital — the content we create, the relationships we create, and the identities we interact with.” He suggested that users migrate from the existing structure to the Lens Network fork as it becomes available. Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.","article_summary":"Lens Network, an on-chain social network infrastructure, is preparing for a significant migration to zkSync's ZK Stack hyperchains, with a goal to enhance scalability and user experience in social networking on the blockchain.","publisher":{"name":"Crypto Daily","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://cryptodaily.co.uk/&size=64"},"creation_date":"2024-05-15T13:48:14Z","categories":["blockchain","web3","ethereum","aave","crypto"],"article_link":"https://cryptodaily.co.uk/2024/05/lens-network-to-migrate-to-zksync-scaling-social-networking-on-the-blockchain","thumbnail_image":"https://cryptodaily.blob.core.windows.net/space/photo_2024-05-15%2015.32.41.jpeg"},{"article_title":"Data Indexer Subsquid Plans to Launch SQD Token Friday","author":"Danny Nelson","article_detailed_content":"The decentralized indexing protocol has raised over $17 million lifetime from venture capital firms and community investors.","article_summary":"The decentralized indexing protocol has raised over $17 million lifetime from venture capital firms and community investors.","publisher":{"name":"CoinDesk","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.coindesk.com/&size=64"},"creation_date":"2024-05-15T13:47:51Z","categories":["token"],"article_link":"https://www.coindesk.com/business/2024/05/15/data-indexer-subsquid-plans-to-launch-sqd-token-friday/?utm_medium=referral&utm_source=rss&utm_campaign=headlines","thumbnail_image":"https://www.coindesk.com/resizer/hOuEQsaJl9ZN_vpZhHugeP5n3Og=/800x600/cloudfront-us-east-1.images.arcpublishing.com/coindesk/X65XHBBKH5FYPLZLF5DHORZX7Q.jpg"},{"article_title":"Binance Exchange Announces Support for Altcoin Contract Change: A New Era for Bitcoin (BTC)","author":"Jocelyn Blake","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Leading cryptocurrency exchange Binance has announced its support for the upcoming contract swap of Lisk (LSK) and shared crucial details for users ahead of the transition. The contract swap for Lisk (LSK) will see all old LSK tokens’ deposit and withdrawal […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Leading cryptocurrency exchange Binance has announced its support for the upcoming contract swap of Lisk (LSK) and shared crucial details for users ahead of the transition. The contract swap for Lisk (LSK) will see all old LSK tokens’ deposit and withdrawal […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T13:45:41Z","categories":["bitcoin","btc","pepe","cryptocurrency"],"article_link":"https://en.coinotag.com/binance-exchange-announces-support-for-altcoin-contract-change-a-new-era-for-bitcoin-btc/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-19.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Next Cryptocurrency To Explode Wednesday, May 15 — Pendle, MUMU THE BULL, Starknet, Axelar","author":"thebittimes@thebitfinance.com (TheBitTimes.Com)","article_detailed_content":"Earning significant ROI in a bull market could mean paying attention to the meme coins and Altcoins with explosive potential. However, identifying the next cryptocurrencies to explode might be a bit challenging as most funds are attracted to pumping assets. Today’s article explores the performance of cryptocurrencies that have dominated the gainers list in the last 24 hours. The objective is to identify the next cryptocurrencies to explode and inform investors and traders about each token. Also included in the post is an overview of the market trend of crypto assets, which have the potential to post significant gains in the future. Next Cryptocurrency To Explode It’s that time in the market when investors and traders take a position to either edge their gains or capitalize on emerging trends. Experts believe investors have a better chance of finding the next cryptos to explode among upcoming crypto projects. With that in mind, investors should explore the potential of Mega Dice. The project aims to reward current casino users with many benefits while drawing in new ones. Updates on the project and its prospects are shared below. 1. Pendle (PENDLE) Today, PENDLE is priced at $4.15. Over the past day, EOS’s price rose by 5.15%. The total market cap has fallen by 33.74% to $626,331,748. On the other hand, trading volume in the last 24 hours surged by 49.18%, reaching $88,506,866. This shows that although the market value dropped, there’s still significant trading activity. Pendle’s current trading is impressive, at 429.98% above the 200-day SMA of $0.778006. The sentiment for EOS price prediction is bullish, reinforcing the positive outlook. The Fear & Greed Index stands at 64 (Greed), suggesting an increase in token transactions and growing market confidence. In the last year, Pendle’s price jumped by 801%, doing better than 94% of other top crypto assets like Bitcoin and Ethereum. This shows how well it’s doing. At Pendle, we strive to make DeFi yields doubly #ez for our users. So that means double @RenzoProtocol pools, with quadruple (4x) ezPoints 🔥 🔹 ezETH on @Ethereum (26 Sep 2024) 🔹 ezETH on @Arbitrum (26 Sep 2024) Restaking has never been so #ez 🏝️ pic.twitter.com/0S8Sq7cQgm — Pendle (@pendle_fi) May 15, 2024 Pendle has strong basics, a dedicated crypto community, and a unique value. It could go even higher in the future. If Pendle teams up with other networks, like through partnerships, its coin could go past $5.00 by 2024. If the crypto market stays buoyant, we expect EOS Coin to be around $4.15 in 2024. 2. Mega Dice (DICE) Mega Dice‘s recent token launch is causing a stir in The GameFi industry. During its presale, it collected over $1 million. The DICE token is at the heart of its new gaming system, which aims to reward current casino users while drawing in new ones. People are eager to get DICE tokens for the best deal possible, but some might miss out since there’s only a limited supply. The Mega Dice token’s presale is just beginning, offering buyers a chance to get it at a low price. However, once 14.7 million DICE are sold, the price is expected to increase. Currently, 13.4 million DICE have already been sold. This shows that the presale is gaining momentum, approaching the $1 million mark in total funds raised. Mega Dice boasts 50,000 players and over $50 million monthly wagers, making it a big name in crypto casino circles. This suggests that its current momentum could continue. If you buy DICE early, you’ll receive extra rewards and benefits. Staking encourages people to hold onto their tokens for a long and participate in the cryptocurrency community. When you stake DICE in Mega Dice, it helps keep the token stable and encourages loyalty in the community. Plus, you can earn rewards with little effort. Stakeholders also get special bonuses, offers, and access to games. Lucky Mega Dice Casino players will receive special NFTs with exclusive rewards or privileges. You can also trade these NFTs if you want. Moreover, DICE holders can get a 25% revenue share through the Mega Dice Referral Program. Visit Mega Dice Token Presale 3. MUMU THE BULL (MUMU) Mumu the Bull is a relatively new token on Solana that aims to unite people in the crypto community. Currently priced at $0.00001091, MUMU has surged by 41.82% in the last day, showing positive market feelings. This increase follows a significant drop, but token holders are happy with the turnaround, seeing it as a chance to buy while the price is low. Some experts suggest waiting before buying MUMU until it surpasses the 61.8% Fibonacci retracement level at $0.00001721. This level marks where the price might stabilize or change direction after a big move, and traders often use it to make decisions. If the MUMU bulls push the price beyond $0.00001721, more people might want to buy. However, we can hope for an upward trend only when the price closes above the 50% Fibonacci mark at $0.00002108. In an optimistic scenario, MUMU’s price could rise above the 38.2% Fibonacci level, hitting $0.00002494. If a candlestick closes above this level in 12 hours, it could signal a further uptrend, possibly reaching as high as $0.00003747. This would be a significant climb, almost 160% higher than current prices. 4. Starknet (STRK) Over the last six months, Starknet (STRK) has increased by 487.001%. Currently, it’s valued between $1.11 and $1.35. However, it dropped by 13.45% in the past week, followed by a monthly decline of 22.19%, showing a continued downward trend. Its current prices are below the 10-day and 100-day moving averages, at $1.19 and $1.22, respectively. The RSI and Stochastic indicators suggest Starknet isn’t overbought or oversold, with readings of 44.57 and 46.16. MACD levels are slightly negative, possibly indicating a correction phase. Resistance lies at $1.51, while support is at $1.03. On May 8th, 2024, STRK tweeted their goal to reduce gas fees below $0.01 and become the L2 with the highest TPS capacity, aiming for several hundred TPS. Another tweet announced gas fees were reduced to $0.001, enabling various use cases like micro-payment protocols, DePIN marketplaces, and gaming. Here's what happens when an ambitious project decides to cook on Starknet 🧑‍🍳 Learn Cairo, buidl your dream project, and receive support for your growth. Exciting things coming from the @LootRealms ecosystem in the coming months! https://t.co/ABxMzZmxPS — Starknet 🦇🔊 (@Starknet) May 15, 2024 If STRK gains bullish momentum and faces resistance from the 20-day EMA on the daily chart, sellers might break support and push the price to a new low. Conversely, if demand remains high, it could rebound from the current level. 5. Axelar (AXL) In 2020, Axelar was established as a decentralized interoperability network. It links all blockchain ecosystems and applications and has support from big names like Binance, Coinbase, Dragonfly, Galaxy, and Polychain. Just recently, Axelar revealed that it’s integrating more than 60 chains into its Interchain Amplifier devnet-phase pilot. This includes chains like Stacks, Moonriver, Hedera Network, and Iron Fish. The Interchain Amplifier is a developer toolkit that uses smart contracts to automate routing and translation across Axelar’s blockchains. This makes it easier for new chains to join without needing permission. Axelar’s Interchain Amplifier now includes over 60 chains, such as Stacks, Moonriver, Hedera Network, and Iron Fish. It promises smooth connectivity across major blockchain networks without needing permission. Even though cross-chain adoption faces challenges, with only 13% of Ethereum Virtual Machine (EVM) addresses having transactions across chains, Axelar’s recent advancements could change this sector soon. \"It's now clear that secure blockchain interoperability is a requirement to unlock the trillion-dollar potential in asset tokenization. … Axelar is critical infrastructure for institutional adoption.\" – @sergey_nog in https://t.co/mjMh98w0cv — Axelar Network (@axelarnetwork) May 14, 2024 Axelar’s method for connecting different blockchains is attracting attention from developers and users. Recent data from the blockchain itself shows that usage has grown significantly, increasing by more than 31,000% since October 2023. Over 270,000 people have used Axelar’s solution, suggesting it is becoming more popular within the wider cryptocurrency community. Especially in the Ethereum world, Axelar is standing out, surpassing competitors like Wormhole and LayerZero in terms of usage. Read More Next Cryptocurrency To Explode 2024 Source: https://thebittimes.com/next-cryptocurrency-to-explode-wednesday-may-15-pendle-mumu-the-bull-starknet-axelar-tbt88421.html","article_summary":"Earning significant ROI in a bull market could mean paying attention to the meme coins and Altcoins with explosive potential. However, identifying the next cryptocurrencies to explode might be a bit challenging as most funds are attracted...","publisher":{"name":"The Bit Times","logo":"https://logo.clearbit.com/thebittimes.com?size=96"},"creation_date":"2024-05-15T13:45:15Z","categories":["cryptocurrency","pendle","starknet","axelar","token","crypto","eos","bitcoin","ethereum","defi","arbitrum","solana","strk","axl","blockchain","stacks","hedera","wormhole"],"article_link":"https://thebittimes.com/next-cryptocurrency-to-explode-wednesday-may-15-pendle-mumu-the-bull-starknet-axelar-tbt88421.html","thumbnail_image":"https://cdn.thebittimes.com/vimedia/w800/2024/05/15/1836ca9ebfeea15d781f5cb5f096cdc1.webp"},{"article_title":"Vanguard CIO Cautions Against Risky GameStop Bets: Implications for Crypto Market & Bitcoin (BTC)","author":"Gideon Wolf","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Vanguard CIO Gregory Davis has issued a warning against risky bets associated with GameStop, stating that the firm’s fundamentals have not changed and trades might lead to losses. Despite the recent rally, Davis believes that the surge in GameStop’s stock price […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Vanguard CIO Gregory Davis has issued a warning against risky bets associated with GameStop, stating that the firm’s fundamentals have not changed and trades might lead to losses. Despite the recent rally, Davis believes that the surge in GameStop’s stock price […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T13:44:26Z","categories":["crypto","bitcoin","btc","pepe"],"article_link":"https://en.coinotag.com/vanguard-cio-cautions-against-risky-gamestop-bets-implications-for-crypto-market-bitcoin-btc/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-8.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Mike Novogratz Forecasts Bright Future for Bitcoin (BTC): Expert Crypto Analysis","author":"Gideon Wolf","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Mike Novogratz, CEO of Galaxy, predicts Bitcoin’s price will range from $55,000 to $75,000 until a new market narrative forms. This narrative could be influenced by decisions from the US central bank or changes in regulatory scrutiny on cryptocurrencies. Novogratz suggests […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Mike Novogratz, CEO of Galaxy, predicts Bitcoin’s price will range from $55,000 to $75,000 until a new market narrative forms. This narrative could be influenced by decisions from the US central bank or changes in regulatory scrutiny on cryptocurrencies. Novogratz suggests […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T13:43:44Z","categories":["bitcoin","btc","crypto","pepe"],"article_link":"https://en.coinotag.com/mike-novogratz-forecasts-bright-future-for-bitcoin-btc-expert-crypto-analysis/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies30.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Pepe Coin (PEPE) Skyrockets: Savvy Investors Reap Massive Profits with 943% ROI in Crypto Market","author":"Gideon Wolf","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! The cryptocurrency market is buzzing with the latest news of Pepe Coin’s unprecedented price surge. A smart investor reportedly made millions in profit, boasting an impressive 943% return on investment (ROI). “This is a testament to the potential of cryptocurrency investments,” […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! The cryptocurrency market is buzzing with the latest news of Pepe Coin’s unprecedented price surge. A smart investor reportedly made millions in profit, boasting an impressive 943% return on investment (ROI). “This is a testament to the potential of cryptocurrency investments,” […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T13:42:28Z","categories":["pepe","crypto","cryptocurrency"],"article_link":"https://en.coinotag.com/pepe-coin-pepe-skyrockets-savvy-investors-reap-massive-profits-with-943-roi-in-crypto-market/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies35.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Prop Trading Marketing: Is the Paid Ads Approach Viable?","author":"Anya Aratovskaya","article_detailed_content":"Trader-funded firms (TFFs), popularly referred to as prop trading firms (although this is technically incorrect), are fortunate to have access to a rather wide array of marketing strategies and tools, primarily because they are incorporated as non-financial entities. Marketing, particularly paid marketing, is a highly accessible field for them, largely because there are very few advertising restrictions on major platforms such as Google Ads and Meta (Facebook and Instagram). While paid marketing campaigns are undoubtedly competitive and can be quite costly, these issues are minor compared to the advertising restrictions faced by retail forex and contracts for differences (CFDs) brokers. The legal and customer success teams at Google Ads generally have limited understanding of FX and CFD regulations. Every FX and CFD industry marketer I've spoken with (both B2B and B2C) has encountered problems with them at some point, often over trivial issues. The surge in popularity of TFFs correlates directly with the decline of start-up brokerages due to legal and technological constraints. Therefore, it's no surprise that marketing for TFFs is often likened to the early, unruly days of binary options and FX. The Tactics of Heavy Bot-Spamming I firmly believe that every business should commit to a proper, long-term marketing strategy. However, many TFF founders lack patience, and concepts such as building awareness, capturing interest, establishing trust, and demonstrating strong performance records are frequently overlooked in favor of quick, spammy campaigns. These include bot-driven Facebook, Telegram, and WhatsApp campaigns, and fake groups that impersonate established TFF influencers and companies. Does heavy bot-spamming work? I would be lying if I said no. It does work, but only for a maximum period of 1-2 months and in certain regions. The biggest downside is the damaged reputation and the inability to sustain future growth, as these spammy techniques are short-lived. The same applies to large, short-term paid Google campaigns that are often discontinued within the same 1-2 months because they are not sustainable in the long term. Overall, the lack of planning is very common among retail FX and CFDs brokers, and this issue is even more prominent with TFFs. A Look into the Data Even a simple domain overview of TFF websites can reveal a wealth of data about those companies' marketing tactics. Unfortunately, retail traders rarely conduct these checks. Here is an example of consistent organic growth of one established TFF. When it comes to newly-created TFFs, the paid efforts to grow the businesses are very clear. Most of them heavily investment in paid ads followed to trigger organic traffic. Newly-created TFF 1: There was a heavy investment in paid ads for a couple of months that along with other marketing campaigns triggered organic growth as well. This firm continues to invest in paid marketing at a more sustainable pace. Newly-created TFF 2: This company had two sprints with paid advertisements, and both worked. The later was strategically timed when the organic growth was plateauing, which gave it a push higher. Newly-created TFF 3: The paid marketing strategy of this TFF did not translate to organic growth. However, it is to be noted that this TFF was affected by the MetaQuotes' “grey-label cancelling spree.” Newly-created TFF 4: Here is one of my favourites: this TFF is a one of few firms that benefited from “prop firm crisis” as they have own MetaTrader5 license. They also have socially active founders and a decent organically created community of traders that attributed to the growth. The trends in these charts are so prominent that even a non-marketer can spot the differences. The Right Way to Market TFFs There is no doubt that the TFF industry is now somewhat crowded, bringing a challenge to organic growth for new players. Paid ads work as long as they are strategically planned and coordinated with organic growth. Some of the basic marketing strategies a newly-created TFF must establish are: Mobile-optimized website with live support CRM Mass emailing tool of any kind Non-spammy content for Twitter and Discord (or Instagram; depends on the region) Experienced and energetic community manager Apart from the bare minimum basics, the TFFs must apply some other most common marketing strategies as well. Some of them are the following: 1. Video reviews have the highest conversion rates, especially when the influencer gets the % from the sales (to be fair, there are fewer of these in 2024). TFFs must produce YouTube Ads and organic educational videos. 2. Influencer marketing is ideally structured around paid dedicated content, including short and long-form videos, reels (Instagram, YouTube) and written posts. TFFs must consider such market avenues. 3. TFFs should explore traffic routing and partnerships with FX-focused educational portals of all kinds. 4. TFFs must have strong referral programs: keep in mind the average referral among 100 TFFs is 15%. Interestingly enough, while many TFFs desire to onboard retail IBs as referral partners, it is often not possible as rebates are not attractive enough compared to retail FX. 5. Community building/social selling is another key marketing channel. For TFFs, these communities are often structured around socially active Founders who are traders at heart. However, no marketing efforts go without errors, and TFFs are no exception. From what I have seen, the most common mistakes TFFs make are: Not running basic CAC analysis. Not having an established trader community of some sort prior to the launch, hoping that paid ads will drive 500+ clients in the first month (in reality, they will not, not in 2024). Not having retention programs in place. The average trader has at least 3 funded accounts at competing companies. Not investing in quality educational content and, instead, actively using AI-generated blurbs, often entirely copied from established firms’ websites, along with the use of flashy laughable 80' style images, videos, and slogans. Fully relying on one trading platform (a costly mistake many realised earlier this year). From what I have seen, YouTube and TikTok probably have the best organic growth results. Further, quite a few TFFs have organically grown because of the active presence of their founders on Twitter and TikTok, who have decent trading experience and are capable of producing decent content. Download the TFF Marketing Checklist along with the data insights on aggregated social stats of 100 trader-funded firms (it includes the top 6 social platforms, volumes, who takes on the majority of market share, 3 months organic traffic stats, and more). This article was written by Anya Aratovskaya at www.financemagnates.com.","article_summary":"Trader-funded firms (TFFs), popularly referred to as prop trading firms (although this is technically incorrect), are fortunate to have access to a rather wide array of marketing strategies and tools, primarily because they are incorporated as non-financial entities. Marketing, particularly paid marketing, is a highly accessible field for them, largely because there are very few advertising restrictions on major platforms such as Google Ads and Meta (Facebook and Instagram). While paid marketing campaigns are undoubtedly competitive and can be quite costly, these issues are minor compared to the advertising restrictions faced by retail forex and contracts for differences (CFDs) brokers. The legal and customer success teams at Google Ads generally have limited understanding of FX and CFD regulations. Every FX and CFD industry marketer I've spoken with (both B2B and B2C) has encountered problems with them at some point, often over trivial issues. The surge in popularity of TFFs correlates directly with the decline of start-up brokerages due to legal and technological constraints. Therefore, it's no surprise that marketing for TFFs is often likened to the early, unruly days of binary options and FX. The Tactics of Heavy Bot-Spamming I firmly believe that every business should commit to a proper, long-term marketing strategy. However, many TFF founders lack patience, and concepts such as building awareness, capturing interest, establishing trust, and demonstrating strong performance records are frequently overlooked in favor of quick, spammy campaigns. These include bot-driven Facebook, Telegram, and WhatsApp campaigns, and fake groups that impersonate established TFF influencers and companies. Does heavy bot-spamming work? I would be lying if I said no. It does work, but only for a maximum period of 1-2 months and in certain regions. The biggest downside is the damaged reputation and the inability to sustain future growth, as these spammy techniques are short-lived. The same applies to large, short-term paid Google campaigns that are often discontinued within the same 1-2 months because they are not sustainable in the long term. Overall, the lack of planning is very common among retail FX and CFDs brokers, and this issue is even more prominent with TFFs. A Look into the Data Even a simple domain overview of TFF websites can reveal a wealth of data about those companies' marketing tactics. Unfortunately, retail traders rarely conduct these checks. Here is an example of consistent organic growth of one established TFF. When it comes to newly-created TFFs, the paid efforts to grow the businesses are very clear. Most of them heavily investment in paid ads followed to trigger organic traffic. Newly-created TFF 1: There was a heavy investment in paid ads for a couple of months that along with other marketing campaigns triggered organic growth as well. This firm continues to invest in paid marketing at a more sustainable pace. Newly-created TFF 2: This company had two sprints with paid advertisements, and both worked. The later was strategically timed when the organic growth was plateauing, which gave it a push higher. Newly-created TFF 3: The paid marketing strategy of this TFF did not translate to organic growth. However, it is to be noted that this TFF was affected by the MetaQuotes' “grey-label cancelling spree.” Newly-created TFF 4: Here is one of my favourites: this TFF is a one of few firms that benefited from “prop firm crisis” as they have own MetaTrader5 license. They also have socially active founders and a decent organically created community of traders that attributed to the growth. The trends in these charts are so prominent that even a non-marketer can spot the differences. The Right Way to Market TFFs There is no doubt that the TFF industry is now somewhat crowded, bringing a challenge to organic growth for new players. Paid ads work as long as they are strategically planned and coordinated with organic growth. Some of the basic marketing strategies a newly-created TFF must establish are: Mobile-optimized website with live support CRM Mass emailing tool of any kind Non-spammy content for Twitter and Discord (or Instagram; depends on the region) Experienced and energetic community manager Apart from the bare minimum basics, the TFFs must apply some other most common marketing strategies as well. Some of them are the following: 1. Video reviews have the highest conversion rates, especially when the influencer gets the % from the sales (to be fair, there are fewer of these in 2024). TFFs must produce YouTube Ads and organic educational videos. 2. Influencer marketing is ideally structured around paid dedicated content, including short and long-form videos, reels (Instagram, YouTube) and written posts. TFFs must consider such market avenues. 3. TFFs should explore traffic routing and partnerships with FX-focused educational portals of all kinds. 4. TFFs must have strong referral programs: keep in mind the average referral among 100 TFFs is 15%. Interestingly enough, while many TFFs desire to onboard retail IBs as referral partners, it is often not possible as rebates are not attractive enough compared to retail FX. 5. Community building/social selling is another key marketing channel. For TFFs, these communities are often structured around socially active Founders who are traders at heart. However, no marketing efforts go without errors, and TFFs are no exception. From what I have seen, the most common mistakes TFFs make are: Not running basic CAC analysis. Not having an established trader community of some sort prior to the launch, hoping that paid ads will drive 500+ clients in the first month (in reality, they will not, not in 2024). Not having retention programs in place. The average trader has at least 3 funded accounts at competing companies. Not investing in quality educational content and, instead, actively using AI-generated blurbs, often entirely copied from established firms’ websites, along with the use of flashy laughable 80' style images, videos, and slogans. Fully relying on one trading platform (a costly mistake many realised earlier this year). From what I have seen, YouTube and TikTok probably have the best organic growth results. Further, quite a few TFFs have organically grown because of the active presence of their founders on Twitter and TikTok, who have decent trading experience and are capable of producing decent content. Download the TFF Marketing Checklist along with the data insights on aggregated social stats of 100 trader-funded firms (it includes the top 6 social platforms, volumes, who takes on the majority of market share, 3 months organic traffic stats, and more). This article was written by Anya Aratovskaya at www.financemagnates.com.","publisher":{"name":"Finance Magnates","logo":"https://t1.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.financemagnates.com/&size=64"},"creation_date":"2024-05-15T13:40:00Z","categories":["general"],"article_link":"https://www.financemagnates.com//forex/prop-trading-marketing-is-the-paid-ads-approach-viable/","thumbnail_image":""},{"article_title":"Bitcoin (BTC) and Ethereum (ETH) Gain Momentum as CPI Inflation Eases and S&P 500 Futures Rise Despite Slowing Retail Sales","author":"Gideon Wolf","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! The consumer price index data for April shows that core inflation moderated last month, while retail sales cooled more than expected. S&P 500 futures moved higher in early Wednesday stock market action after the CPI inflation data, as markets weighed the […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! The consumer price index data for April shows that core inflation moderated last month, while retail sales cooled more than expected. S&P 500 futures moved higher in early Wednesday stock market action after the CPI inflation data, as markets weighed the […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T13:37:44Z","categories":["bitcoin","btc","ethereum","eth","pepe","core"],"article_link":"https://en.coinotag.com/bitcoin-btc-and-ethereum-eth-gain-momentum-as-cpi-inflation-eases-and-sp-500-futures-rise-despite-slowing-retail-sales/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-17.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Bitcoin (BTC) Predicted to Reach New All-Time High This Weekend, Says Blockstream CEO","author":"Gideon Wolf","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Bitcoin, the world’s largest cryptocurrency, has recently seen a surge in value, crossing the $60,000 mark for the first time in history. This milestone comes amidst increasing institutional adoption and a growing acceptance of digital currencies as a legitimate asset class. […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Bitcoin, the world’s largest cryptocurrency, has recently seen a surge in value, crossing the $60,000 mark for the first time in history. This milestone comes amidst increasing institutional adoption and a growing acceptance of digital currencies as a legitimate asset class. […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T13:36:28Z","categories":["bitcoin","btc","pepe","cryptocurrency"],"article_link":"https://en.coinotag.com/bitcoin-btc-predicted-to-reach-new-all-time-high-this-weekend-says-blockstream-ceo/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies31.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Bitcoin network activity at 5-year low while BTC price is 10x higher","author":"thebittimes@thebitfinance.com (TheBitTimes.Com)","article_detailed_content":"The Bitcoin (BTC) network activity has dropped to lows previously seen in February 2019, five years ago. At that time, BTC was trading at $6,380 – ten times lower than its current price of $63,800. Finbold retrieved premium data from Santiment on May 15, which shows a 5-year low count for Bitcoin’s 30-day active addresses. Essentially, this metric looks at the number of distinct addresses participating in a transaction in the last 30 days. Each address is counted only once for the window and represents the overall network activity in a given period. Notably, the Bitcoin network registered 12.64 million active addresses in this window, a count previously seen in February 2019. BTC was trading at the $6,380 price level with massive volatility in the final phases of a bear market. Picks for you CROSS THE AGES secures $3.5M in equity round led by Animoca Brands 36 mins ago Bitcoin ‘danger zone’ is ‘officially over,’ What’s next for BTC? 2 hours ago We asked ChatGPT-4o what will be Silver price at the end of 2024; Here’s what it said 2 hours ago Crypto in peril as court ruling sets a dangerous precedent 3 hours ago Interestingly, July 2021 had a similar network activity drop to 14.50 million right after last cycle’s first top at nearly $65,000—happening at the same time as a 50% price crash hit BTC, driving the asset to below $30,000. Price (BTC) + Active Addresses 30d (BTC). Source: Sanbase Pro / Vini Barbosa for Finbold Why does Bitcoin network activity matter? There are a few possible insights to get from Bitcoin’s network activity, not necessarily related to price action. Nevertheless, the above chart suggests a direct correlation between the 30-day count of active addresses and the BTC price. Overall, higher network activity indicates a higher demand from unique peers to use Bitcoin for value transfer. Satoshi Nakamoto described Bitcoin as a “peer-to-peer electronic cash system.” Thus, higher demand for that use could suggest the tool is delivering its promise and attracting new users for that. Conversely, a lower network activity at surging prices could raise doubts about where Bitcoin’s market demand is coming from. Moreover, it could put this demand’s health in check if it comes mostly from derivatives speculation rather than organic use. BTC price analysis From another perspective, lower network activity means fewer addresses have withdrawn and deposited from and to crypto exchanges. Usually, increased withdrawals mean Bitcoin investors are buying, while increased deposits mean higher selling activity—both of which affect price. As of this writing, BTC is testing a key resistance on its 30-day exponential moving average (30-EMA). Bitcoin has been trading below this technical indicator resistance since April while also testing the $60,000 psychological support. BTC/USD daily price chart. Source: Finbold A breakout from any of these prices could set BTC’s next trajectory. Analysts believe Bitcoin has already left a “danger zone” and could be ready for a bounce. However, should the network activity correlation remain, Bitcoin could face a significant drop before visiting higher grounds. The leading cryptocurrency has kept a price range between $60,000 and $72,000 since February 2024, with two deviations. As cryptocurrencies continue to be a high-volatility market, investors and traders must be cautious while making sensitive financial decisions. Disclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk. Source: https://thebittimes.com/bitcoin-network-activity-at-5-year-low-while-btc-price-is-10x-higher-tbt88420.html","article_summary":"The Bitcoin (BTC) network activity has dropped to lows previously seen in February 2019, five years ago. At that time, BTC was trading at $6,380 – ten times lower than its current price of $63,800.Finbold retrieved premium data from...","publisher":{"name":"The Bit Times","logo":"https://logo.clearbit.com/thebittimes.com?size=96"},"creation_date":"2024-05-15T13:36:15Z","categories":["bitcoin","btc","crypto","cryptocurrency"],"article_link":"https://thebittimes.com/bitcoin-network-activity-at-5-year-low-while-btc-price-is-10x-higher-tbt88420.html","thumbnail_image":"https://cdn.thebittimes.com/vimedia/w800/2024/05/15/fb4fe509ededccd4eedaabcb02e0898c.webp"},{"article_title":"Worldcoin’s New Biometric Data Security System Promises Enhanced Protection","author":"Harsh Notariya","article_detailed_content":"The Worldcoin Foundation has unveiled a Secure Multi-Party Computation (SMPC) system. It claims that this technology is poised to redefine the protection of biometric data. It emerges as essential in an era where such data’s application extends from everyday services to complex security systems. Worldcoin Explains the Working of SMPC In an email conversation with BeInCrypto, Worldcoin explained the necessity of advanced data protection. It cited a projected increase in the biometric system market to $76.70 billion by 2029 from $30.77 billion in 2022, according to a Fortune Business Insights report. Furthermore, data breaches have surged, with a 20% increase in incidents year-over-year and a doubling in victim numbers, according to research by MIT Professor Stuart Madnick. Read more: How to Buy Worldcoin (WLD) and Everything You Need to Know SMPC technology divides a secret into multiple parts, distributed among several parties. Consequently, no single entity can reconstruct the full secret alone, enhancing security. This method proves particularly resistant to threats, including those from quantum computing. Historically, the resource-intensive nature of SMPC has restricted its widespread application, particularly in handling extensive biometric data. To overcome these limitations, the Worldcoin Foundation, along with teams from TACEO and Tools for Humanity, developed a scalable and cost-effective version of SMPC. They claim that this version is adept at managing large data volumes without compromising security. According to Jannick Preiwisch, the Worldcoin Foundation’s Data Protection Officer, this system complies with the EU General Data Protection Regulation and other data protection regimes worldwide. “Implementation of the new SMPC system enabled the Worldcoin Foundation to delete old iris codes by permanently encrypting them to SMPC shares that by themselves cannot be related to an identified person,” Preiwisch told BeInCrypto Despite this development, Worldcoin (WLD) trades at $4.90, down by around 3% in the past 24 hours. Read more: Worldcoin (WLD) Price Prediction 2024/2025/2030 Worldcoin (WLD) Price Performance. Source: BeInCrypto Meanwhile, the project still faces criticism regarding its tokenomics. Crypto analyst DeFiSquared claims that the WLD is devaluing, with its value currently decreasing daily by 0.6% due to high emission rates. With a fully diluted valuation of $60 billion, concerns mount. Moreover, DeFiSquared raised alarms about the imminent increase in token supply. This increase, due to allocations for venture capital and team members, could potentially result in increased selling pressure in the market. Additionally, the announcement of a strategic sale of $200 million worth of WLD tokens to trading firms has sparked further controversy. The post Worldcoin’s New Biometric Data Security System Promises Enhanced Protection appeared first on BeInCrypto.","article_summary":"Worldcoin Foundation unveils a new Secure Multi-Party Computation system aimed at redefining biometric data protection, ensuring compliance with global data protection laws. The post Worldcoin’s New Biometric Data Security System Promises Enhanced Protection appeared first on BeInCrypto.","publisher":{"name":"Be(In)Crypto","logo":"https://t3.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://beincrypto.com/&size=64"},"creation_date":"2024-05-15T13:35:46Z","categories":["worldcoin","wld","crypto","token"],"article_link":"https://beincrypto.com/worldcoin-biometric-data-security-system/","thumbnail_image":"https://beincrypto.com/wp-content/uploads/2023/08/Learn_worldcoin-covers.png"}]}