{"count":9690,"totalPages":323,"currentPage":5,"articles":[{"article_title":"ETFSwap (ETFS) Crosses 4,000 Users With $1.5 Million Raised","author":"Chainwire &#160;","article_detailed_content":"Singapore, Singapore, May 15th, 2024, Chainwire ETFSwap (ETFS), an emerging decentralized cryptocurrency and Exchange-Traded Funds (ETFS) platform, has achieved a series of significant milestones, marking a historic moment in its development and presale. With the support and confidence of thousands of users and investors worldwide, this ground-breaking platform is experiencing a meteoric rise in popularity. In addition, ETFSwap (ETFS) is gaining global recognition as a significant player in the tokenized ETF market. It offers a platform that is both distinctive and accessible, as well as unique and user-friendly, for trading cryptocurrencies and ETFs. ETFSwap (ETFS) records unprecedented surge to cross 4,000 users As of November 2023, the global ETFs industry reached a valuation of $10.99 trillion and has been growing rapidly ever since. Given this expansion, an increasing number of cryptocurrency enthusiasts and investors have looked for ways to engage with the potential in this sector. ETFSwap (ETFS) emerges as a bridge between the traditional and Decentralized Finance (DeFi) ecosystem. This platform offers investment opportunities for global investors, exposing them to trillion-dollar sectors such as health, energy, technology, commodities, and more ETFSwap (ETFS) offers crypto investors a novel service that has never been seen in the industry. It allows access to the trillion-dollar traditional ETFs market, allowing them to expand their investment portfolio by tokenizing these assets for easy trading. But perhaps where ETFSwap (ETFS) really outpaces its competitors is that it presents an easy on-and-off ramp for trading ETFs using both crypto and fiat, coupled with the decentralization of the Ethereum blockchain. Over the next year, the platform plans to complete its roadmap with the full launch of the ETFSwap (ETFS) trading platform open for all. Additionally, it’ll launch its partnership program, launch its staking decentralized application (DApp), and roll out community rewards. Its token will launch on decentralized exchanges such as Uniswap, with open public trading to follow. This comes with a full-blown marketing roll-out such as CoinMarketCap fast-track, Key Opinion Leaders (KOLs), and token competitions. The ETFSwap (ETFS) platform has undergone a rigorous audit by CyberScope, a leader in the blockchain security industry. The audit found no vulnerabilities in its contract, with the company declaring it safe for investment. Ahead of its full platform launch, the company is focused on securing all necessary licenses required to bring this novel service to investors worldwide. To sweeten the pot, it requires no KYC (Know Your Customer), which means investors just need to connect their wallet to start trading on the website. ETFSwap (ETFS) is already seeing unparalleled adoption amongst users across diverse regions globally. Currently, the innovative platform has recorded more than 4,000 users in just a few weeks. This surge in adoption is fueled not only by ETFSwap’s (ETFS) advanced trading technology and capabilities but also by the rising interest in tokenized ETFs within the digital asset landscape. Key milestones and presale progress Thanks to ETFSwap users’, ETFSwap (ETFS) has successfully hit key developmental milestones. With the help of institutional investors, ETFSwap (ETFS) successfully raised over $750,000 in its private fundraising round. In addition to the growth of ETFSwap’s user base, the first stage of the ongoing presale has seen over 75 million tokens sold. The ETFSwap team noticed the increase in sales and, with a strategic decision, has raised the ETFS token price from $0.00854 in its first presale stage to $0.01831 during the second stage. The public presale has also collectively raised over $1.5 million in a few weeks. For more information about the ETFS Presale: Users can visit ETFSwap Presale Users can join The ETFSwap Community Contact Jacob Moss ETFSwap LLC info@etfswap.io The post ETFSwap (ETFS) Crosses 4,000 Users With $1.5 Million Raised appeared first on CoinJournal.","article_summary":"Singapore, Singapore, May 15th, 2024, Chainwire ETFSwap (ETFS), an emerging decentralized cryptocurrency and Exchange-Traded Funds (ETFS) platform, has achieved a series of significant milestones, marking a historic moment in its development and presale. With the support and confidence of thousands of users and investors worldwide, this ground-breaking platform is experiencing a meteoric rise in popularity. […] The post ETFSwap (ETFS) Crosses 4,000 Users With $1.5 Million Raised appeared first on CoinJournal.","publisher":{"name":"CoinJournal","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://coinjournal.net/&size=64"},"creation_date":"2024-05-15T12:26:02Z","categories":["cryptocurrency","defi","crypto","ethereum","blockchain","token","uniswap"],"article_link":"https://coinjournal.net/news/etfswap-etfs-crosses-4000-users-with-1-5-million-raised/","thumbnail_image":""},{"article_title":"Nominations Now Open for UF AWARDS Global 2024!","author":"FM Contributors","article_detailed_content":"The road to winning this year’s most prestigious titles is officially underway as nominations are now open for the upcoming UF AWARDS Global 2024. As the standard for excellence in the financial services and fintech space, these awards have established themselves as the highest accolades available. With the industry’s top companies all vying for these exclusive awards, the competition this year will be higher than ever. The UF AWARDS Global 2024 acknowledge both leading B2C and B2B brands for several different attributes. This includes the most noteworthy accomplishments, substantive contributions within the online trading and fintech sphere, and best overall performance. It goes without saying that these trophies constitute the gold standard of awards in the industry. Winning these awards signals to traders and businesses that your company is the most reputable for both trading and business. Simply put, these titles have no equal! All prospective voters are encouraged to sign up today and submit their nomination for these coveted awards. Securing this year’s titles starts with you! Recognising the Best Brands from Around the World All nominees are approved based on strict criteria that assess service quality, the overall scope of a product offering, and industry accomplishments. Participants will be eligible to nominate any brand of their choosing until May 30. Immediately following this period will be the voting round, which will take place exclusively on June 3-12. The final awards ceremony will take place after the completion of the voting round, where the winners can receive their trophies. Further details surrounding this ceremony will be announced shortly so stay tuned. Why UF AWARDS Global 2024 Have No Equal Securing a UF Award bestows a wide range of advantages for all winners. These awards represent the perfect opportunity to improve your brand’s recognition and visibility to the audiences that matter most. There is no better way to validate and acknowledge your brand’s accomplishments than showing off these titles. Previous winners have helped strengthen their brand reputation and credibility in the industry as the most sure-fire way to differentiate themselves from competitors. Prospective nominees can explore the available categories on the official UF AWARDS Global 2024 website and nominate the most deserving brands, including their own. Some of the most sought-after titles this year include the following: BEST GLOBAL BROKER – GLOBAL BEST TRADING CONDITIONS - GLOBAL MOST TRUSTED BROKER - GLOBAL BEST IB/AFFILIATE PROGRAMME - GLOBAL BEST TRADING PLATFORM - GLOBAL BEST B2B LIQUIDITY PROVIDER - GLOBAL BEST CONNECTIVITY PROVIDER - GLOBAL BEST TECHNOLOGY PROVIDER - GLOBAL Nominating for this year’s awards is easier than ever for all participants - simply register on the UF AWARDS Global 2024 website and start by filling in the nomination form. As a reminder, only registered users can take part. Public voting will follow at the conclusion of the nominations round with only subscribed users eligible to cast their vote during this stage. Nominate your brand today for a chance to win the highest honours this June! This article was written by FM Contributors at www.financemagnates.com.","article_summary":"The road to winning this year’s most prestigious titles is officially underway as nominations are now open for the upcoming UF AWARDS Global 2024. As the standard for excellence in the financial services and fintech space, these awards have established themselves as the highest accolades available. With the industry’s top companies all vying for these exclusive awards, the competition this year will be higher than ever. The UF AWARDS Global 2024 acknowledge both leading B2C and B2B brands for several different attributes. This includes the most noteworthy accomplishments, substantive contributions within the online trading and fintech sphere, and best overall performance. It goes without saying that these trophies constitute the gold standard of awards in the industry. Winning these awards signals to traders and businesses that your company is the most reputable for both trading and business. Simply put, these titles have no equal! All prospective voters are encouraged to sign up today and submit their nomination for these coveted awards. Securing this year’s titles starts with you! Recognising the Best Brands from Around the World All nominees are approved based on strict criteria that assess service quality, the overall scope of a product offering, and industry accomplishments. Participants will be eligible to nominate any brand of their choosing until May 30. Immediately following this period will be the voting round, which will take place exclusively on June 3-12. The final awards ceremony will take place after the completion of the voting round, where the winners can receive their trophies. Further details surrounding this ceremony will be announced shortly so stay tuned. Why UF AWARDS Global 2024 Have No Equal Securing a UF Award bestows a wide range of advantages for all winners. These awards represent the perfect opportunity to improve your brand’s recognition and visibility to the audiences that matter most. There is no better way to validate and acknowledge your brand’s accomplishments than showing off these titles. Previous winners have helped strengthen their brand reputation and credibility in the industry as the most sure-fire way to differentiate themselves from competitors. Prospective nominees can explore the available categories on the official UF AWARDS Global 2024 website and nominate the most deserving brands, including their own. Some of the most sought-after titles this year include the following: BEST GLOBAL BROKER – GLOBAL BEST TRADING CONDITIONS - GLOBAL MOST TRUSTED BROKER - GLOBAL BEST IB/AFFILIATE PROGRAMME - GLOBAL BEST TRADING PLATFORM - GLOBAL BEST B2B LIQUIDITY PROVIDER - GLOBAL BEST CONNECTIVITY PROVIDER - GLOBAL BEST TECHNOLOGY PROVIDER - GLOBAL Nominating for this year’s awards is easier than ever for all participants - simply register on the UF AWARDS Global 2024 website and start by filling in the nomination form. As a reminder, only registered users can take part. Public voting will follow at the conclusion of the nominations round with only subscribed users eligible to cast their vote during this stage. Nominate your brand today for a chance to win the highest honours this June! This article was written by FM Contributors at www.financemagnates.com.","publisher":{"name":"Finance Magnates","logo":"https://t1.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.financemagnates.com/&size=64"},"creation_date":"2024-05-15T12:25:46Z","categories":["general"],"article_link":"https://www.financemagnates.com//thought-leadership/nominations-now-open-for-uf-awards-global-2024/","thumbnail_image":""},{"article_title":"Persistent Discount Plagues Grayscale’s Ethereum Trust as ETF Decision Nears","author":"Jamie Redman","article_detailed_content":"As May approaches its end, a significant number of market watchers are keen to find out whether the U.S. Securities and Exchange Commission (SEC) will approve a spot ethereum exchange-traded fund (ETF). Although Grayscale retracted its plan to convert its Ethereum Trust into a publicly traded ETF, the fund’s discount to net asset value (NAV) […]","article_summary":"As May approaches its end, a significant number of market watchers are keen to find out whether the U.S. Securities and Exchange Commission (SEC) will approve a spot ethereum exchange-traded fund (ETF). Although Grayscale retracted its plan to convert its Ethereum Trust into a publicly traded ETF, the fund’s discount to net asset value (NAV) […]","publisher":{"name":"Bitcoin News","logo":"https://logo.clearbit.com/news.bitcoin.com?size=96"},"creation_date":"2024-05-15T12:23:56Z","categories":["ethereum"],"article_link":"https://news.bitcoin.com/persistent-discount-plagues-grayscales-ethereum-trust-as-etf-decision-nears/","thumbnail_image":"https://static.news.bitcoin.com/wp-content/uploads/2024/05/eth-768x432.jpg"},{"article_title":"PEPE Coin (PEPE) and Three Other Cryptocurrencies Soar Amidst Stagnant Market: All-Time Highs Achieved!","author":"Crypto Vira","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! The cryptocurrency market continues to struggle, with a global market value of around $2.26 trillion and a trading volume that can’t surpass $72 billion. This downward trend has dampened investor sentiment, pushing the fear and greed index towards the neutral zone. […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! The cryptocurrency market continues to struggle, with a global market value of around $2.26 trillion and a trading volume that can’t surpass $72 billion. This downward trend has dampened investor sentiment, pushing the fear and greed index towards the neutral zone. […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T12:23:28Z","categories":["pepe","cryptocurrency"],"article_link":"https://en.coinotag.com/pepe-coin-pepe-and-three-other-cryptocurrencies-soar-amidst-stagnant-market-all-time-highs-achieved/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-11.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Huobi HK Withdraws Virtual Asset Trading Platform Application","author":"Jalpa Bhavsar","article_detailed_content":"On Tuesday, HTX’s Hong Kong affiliate withdrew its license application for the second time, casting doubt on the exchange’s ability to operate legally in the region. HBGL Hong Kong Limited (Huobi HK) was included among the applicants who withdrew their applications from the list of those seeking virtual asset trading platforms. However, it was removed from the list on Tuesday, as per the website of the Securities and Futures Commission. This action was taken after the company withdrew its initial application on February 23 and resubmitted it on February 26. However, the SFC did not specify why the firm withdrew its application. The SFC stated that crypto trading platforms must shut down their operations in Hong Kong by May 31 or within three months of further notification if they fail to submit their license applications by February 29. Hong Kong always welcomes crypto firms, but on the other hand, its neighbor, China has imposed a wide-ranging crackdown on crypto trading and mining. In June 2023, the city officially launched its crypto licensing regime for virtual asset trading platforms, enabling licensed exchanges to provide retail trading services. The SFC is formally examining the applications of twenty cryptocurrency exchange companies, including OKX, Bybit, Bullish, and Crypto.com, who have applied for such retail trading licenses Currently, Hong Kong has granted licenses to two platforms—HashKey and OSL. The cryptocurrency platform HKVAEX, which was purportedly connected to Binance, declared last month that it was closing down following the withdrawal of its application for a license on March 28. The platform officially closed on May 1. Also Read: HKVAEX Withdraws Hong Kong License Application Post-Deadline","article_summary":"This action was taken after the company withdrew its initial application on February 23 and resubmitted it on February 26.","publisher":{"name":"Crypto Times","logo":"https://logo.clearbit.com/www.cryptotimes.io?size=96"},"creation_date":"2024-05-15T12:22:22Z","categories":["crypto","cryptocurrency"],"article_link":"https://www.cryptotimes.io/2024/05/15/huobi-hk-withdraws-virtual-asset-trading-platform-application/","thumbnail_image":"https://www.cryptotimes.io/wp-content/uploads/2024/05/HTXs_Hong_Kong_affiliate_withdraws_license_application_again-1024x576.jpg"},{"article_title":"Best Cryptocurrencies to Invest in Right Now May 15 – Internet Computer, Jito, Wormhole","author":"thebittimes@thebitfinance.com (TheBitTimes.Com)","article_detailed_content":"Get insights into the recommended cryptocurrencies for investment today. Discover the growth potential of these tokens in today’s market. With the excitement building for this year’s bull run, investors need to know the significant altcoins poised for gains in the market. This article overviews altcoins gaining popularity in the growing crypto market. These coins have unique Features and the potential to generate massive gains for investors. Best Cryptocurrencies to Invest in Right Now Wormhole has experienced growth lately, with its current price at $0.5388, reflecting a 2.14% increase over the last 24 hours. Furthermore, Jito’s price has surged significantly by 176.55% over the past six months, demonstrating a strong upward trend in its value. Similarly, ICP has shown remarkable growth over the same period, appreciating by 172.78%. In the global crypto scene, Swaps unveiled a new offering called Payment Links, designed to streamline and enhance the process of receiving payments and transfers in cryptocurrency and traditional fiat currencies. 1. Wormhole (W) Wormhole has seen notable growth recently, with its current price is $0.5388, marking a 2.14% increase in the last 24 hours. This positioned it among the top gainers in the market today. Over the past week, it has climbed by 19%, demonstrating strong momentum. Analysts anticipate further gains by the end of this month, with a projected target of $0.79. This surge in value is attributed to Wormhole’s increasing adoption. On April 25th, the coin became available in SPL format on Solana and ERC-20 format on Ethereum and EVM L2s. This expansion has contributed to its enhanced liquidity, as reflected by its market cap and ranking. Currently, Wormhole holds the 13th position in the DeFi Coins sector and is the top token in the Solana Coins & Tokens sector. Portal enables token transfers across 30+ chains, powered by Wormhole.@portalbridge_ also supports native ETH transfers across EVM chains. This feature combines Wormhole's multichain architecture with @Uniswap's concentrated liquidity pools. See how Portal works. ⬇️ pic.twitter.com/FpkcKSdaBI — Wormhole (@wormhole) May 11, 2024 Despite the positive sentiment, the prediction remains neutral. The Fear & Greed Index, which stands at 64 (Greed), suggests cautious optimism in the market. Investors are advised to consider these factors alongside the ongoing developments within the cryptocurrency market. 2. 5th Scape (5SCAPE) 5th Scape is an emerging cryptocurrency project currently in its presale phase. It aims to introduce innovative technology into gaming, education, and potentially other sectors. The project utilizes advanced VR/AR (Virtual Reality/Augmented Reality) technology, positioning it as the world’s first AR/VR ecosystem. 🚀 Mixed Martial Arts fans, rejoice! Dive into the adrenaline-fueled world of MMA Cage Conquest by 5thScape on Meta! Experience intense combat, immersive arenas, and strategic training. Use code \"5THSCAPESUBSCRIBER-80F935\" for 99% off! To thank our incredible community,… pic.twitter.com/kM3BEn48tP — 5th Scape (@5th_scape) May 14, 2024 Furthermore, the project has announced a series of hyper-realistic games that offer immersive experiences across various genres. For instance, “Cage Conquest” targets enthusiasts of dynamic combat, authentic arenas, strategic training, and online championships. As of now, 5th Scape has raised $5.9 million through its presale. Its native token, 5SCAPE, is currently priced at $0.00327 during the presale, lower than its anticipated listing price of $0.01. This presents a potential increase of over 200% for early investors upon listing, with potential further gains driven by post-listing demand. Visit 5th Scape Presale 3. Jito (JTO) In the past six months, Jito’s price has surged significantly by 176.55%, indicating a strong upward trend in its value. This week alone, it has seen a modest increase of 1.45%, with its price currently fluctuating between $3.36 and $4.44. Compared to last month, Jito’s value has risen by 27.77%. Over the last 30 days, Jito has experienced 16 days of positive price movement, constituting 53% of the period. This indicates a significant frequency of positive trading days. Additionally, Jito boasts high liquidity, reflected in its market capitalization. Furthermore, recent market sentiment towards Jito is bullish, as indicated by price prediction. In addition, the Fear & Greed Index sits at 64, reflecting a level of greed among traders. Despite its recent peak, Jito’s price has cooled off and is currently near the lower end of its trading range. This correction suggests that the coin is struggling to surpass the $4.99 resistance level. Jito’s surge can be attributed to an announcement by cryptocurrency exchange Coinbase, which plans to introduce support for Jito perpetual futures on its platform. This development and similar additions for TNSR and JUP perpetual futures have likely contributed to increased interest in Jito. The Jito DAO is proposing to spend 7.5M $JTO on liquidity mining. 😁 Jito is for the people. 🤝https://t.co/xWdnz9oV17 — Jito (@jito_sol) May 13, 2024 Additionally, the DAO governing Jito is contemplating a proposal to allocate 7.5 million JTO tokens, approximately $29 million, towards liquidity mining. This represents 3.1% of the total JTO held by the DAO. This activity underscores Jito’s involvement in the Solana-based liquid staking service, aiming to enhance liquidity and growth within its ecosystem. The ongoing developments suggest continued interest and potential expansion in the foreseeable future. 4. KuCoin Token (KCS) The KuCoin Token started as an Ethereum-based token but now operates on its blockchain, facilitating transactions on the KuCoin exchange. KCS serves a dual purpose, it reduces trading fees for users on the KuCoin platform and grants holders a share of the exchange’s trading fees as dividends. Presently priced at $9.48, KCS saw a 4.56% decline in the last 24 hours but has shown stability overall, with a 6.51% increase in the past month. Its one-year performance boasts a 24% rise from its token sale price. Furthermore, the current sentiment around KCS is bearish, contrasting with a Greed Index rating of 64. Over the last month, KCS experienced positive price action on 16 days, indicating a 53% success rate. The Relative Strength Index (RSI) of 55.68 suggests the token is currently neutral and may trade sideways. Introducing a unique new entry to the #KuCoin Pre-Market. ⏰ Start Time: 07:00 on May 10, 2024 (UTC) Announcing with a resounding meh, @thenotcoin $NOT, the premier memecoin, joining into our lineup. Is it something? Is it nothing? It's definitely $NOT what you expect! 😉 — KuCoin (@kucoincom) May 10, 2024 Moreover, KCS could see significant growth, especially if it collaborates with other networks. With continued market bullishness, predictions indicate KCS might surpass $23.34 by the year-end, settling around $21.14 on average. Notably, KuCoin recently launched Notcoin (NOT) as a new addition to its Pre-Market on May 10. This highlights the exchange’s ongoing efforts to expand its offerings and attract new projects to its platform. 5. Internet Computer (ICP) Internet Computer has attracted significant interest within the crypto community due to its unique approach to decentralization. Despite recent market challenges, the token has displayed a positive trend, with a 1.11% increase in value over the past day, rebounding from a 1.69% loss over the week. Over six months, ICP has shown remarkable growth, appreciating by 172.78%. Currently, the 14-day Relative Strength Index (RSI) is 35.67, indicating a neutral market sentiment and potential sideways trading in the near term. Technically, ICP is undergoing a corrective phase following its recent upward movement. Furthermore, breaking through the immediate resistance level of $14.84 could signal a return to bullish momentum. Presently, ICP is trading 4.61% above its 200-day Simple Moving Average (SMA), which is $11.52. Attention #ICP community 📣 Excited to announce half a million canister smart contracts are now deployed on #ICP 👏 In a span of just 72 days, the number of canister smart contracts deployed on #ICP surged from 400 to 500k 🤯 pic.twitter.com/0hKwyYETz4 — DFINITY (@dfinity) May 14, 2024 Compared to its token sale price, ICP has demonstrated positive performance and boasts high liquidity based on its market capitalization. Analysts predict further upward movement for ICP this year. The projected average price is around $26.02, with a potential maximum of $30.17 if the current growth trajectory continues. Read More Best Crypto to Buy Now Source: https://thebittimes.com/best-cryptocurrencies-to-invest-in-right-now-may-15-internet-computer-jito-wormhole-tbt88393.html","article_summary":"Get insights into the recommended cryptocurrencies for investment today. Discover the growth potential of these tokens in today’s market.With the excitement building for this year’s bull run, investors need to know the...","publisher":{"name":"The Bit Times","logo":"https://logo.clearbit.com/thebittimes.com?size=96"},"creation_date":"2024-05-15T12:21:31Z","categories":["wormhole","crypto","icp","cryptocurrency","w","solana","ethereum","defi","token","eth","optimism","near","jup","kcs","blockchain"],"article_link":"https://thebittimes.com/best-cryptocurrencies-to-invest-in-right-now-may-15-internet-computer-jito-wormhole-tbt88393.html","thumbnail_image":"https://cdn.thebittimes.com/vimedia/w800/2024/05/15/788984ca429d23515679dafa4285d91f.webp"},{"article_title":"Hot New Solana GameFi Token Mega Dice Blasts Past $1 Million Raise In Crypto ICO","author":"thebittimes@thebitfinance.com (TheBitTimes.Com)","article_detailed_content":"Trending new Solana GameFi token Mega Dice ($DICE) has smashed through the $1 million milestone in its ongoing presale. On sale at an initial price of $0.069, the $DICE presale price has today risen to $0.075, representing an 8.6% hike. Moving quickly now will secure buyers the lowest possible entry point for this much-talked-about presale, improving the chances of capturing a potential 100x return on investment or more. $DICE presale is targeting a soft cap minimum raise amount of $5 million. The team looks to the success of Rollbit ($RLB) as a baseline. Given its superior feature set, $DICE buyers are confident that Rollbit’s 7,700% return to date for its early investors is more than achievable. $DICE is a fair presale. None of the 420 million tokens up for grabs are allocated to the team. As the native token of the Mega Dice platform, $DICE has valuable utility, which leaves the likes of competitors Rollbit wilting in the shade. $DICE presale has raised $1 MILLION! 🚀🚀 This #MillionDollarMilestone brings us closer to revolutionizing GameFi. What's coming next?👇 Next tier price: 0.075 💰 Next presale target: $2M 💰 We're implementing multiple tiered price increases, so make sure to secure your $DICE… pic.twitter.com/QSvTXn4tOC — Mega Dice Casino (@megadice) May 15, 2024 $DICE Is Now Seamlessly Integrated Into Mega Dice Casino The team has announced that from today $DICE investors will be able to use the token on MegaDice.com casino. Mega Dice offers an industry-leading rakeback bonus for $DICE players, matching the highest competitor VIP bonuses for all $DICE investors. Rollbit has a market capitalization in excess of $200 million – Mega Dice is setting its sights much higher. In addition to being able to use $DICE to wager in the casino, $DICE is the only GameFi coin that distributes a share of profits to its users on a daily basis through its novel staking system. Wagering with $DICE also unlocks access to weekly cashbacks as well as upcoming futures trading on the Mega Dice platform. Integration of the $DICE token into the Mega Dice platform has now been completed. Supported by literally dozens of KOL influencers and now having stacked up 9,000-plus members on Telegram, $DICE is on a roll. Rollup For The $DICE 2.25 Million Airdrop – Season 2 Kicks Off Now The news of the $1 million milestone achievement follows the completion of its season 1 airdrop which saw $750,000 paid out to eligible token holders. The season 2 airdrop is now open for a further distribution of $750,000. Players who wager a minimum of $5,000 in a 21-day period will be eligible for the airdrops and retroactive rewards. There will be three airdrops in total. The early success of gaming tokens such as Rollbit Coin ($RLB), which now has a market valuation of more than $200 million, has undoubtedly helped garner interest in the presale. But Mega Dice is bettering Rollbit in that it has its own story to tell as a successful business prior to the unveiling of its native token. With price stability and growth in mind, the team plans to execute strategic buybacks. The buybacks will be funded by a portion of the profits from the platform, contribution to price stability and appreciation. Alongside the buybacks, there is also a regular-schedule burn mechanism to reduce the total token supply, thereby increasing the token’s scarcity and, therefore, value. The capped supply of the $DICE token guards against inflation so token owners have an extra layer of security underpinning the value of their investment. Mega Dice, An Established Casino With 50,000 Players, Growing Revenue, Profits As an established and profitable business the $DICE presale is in the enviable position of being able to show its potential contributors the color of its money. According to the team, monthly wagering runs at $50 million, with the platform currently attracting around 10,000 monthly active users. Mega Dice already has 50,000 players of its 4,000 games in addition to a sportsbook with 50 sports and esports clocking up thousands of events with top industry betting markets. The sportsbook also comes with the ability to livestream many of the most popular events. Tying all of this together, the gamification layer on Mega Dice positions $DICE as the value proposition driver of its loyalty program. Native token users are rewarded more generously than other players and have the chance to win lifestyle prizes and experiences. Early bird bonuses, limited editions NFTs, a referral program, and full integration of the token into the casino ecosystem to provide exclusive access, rewards and benefits. Specifically, the refer-a-friend and program participants receive a generous 10% share of their friends’ investment. If a referral buys $1,0000 worth of $DICE the referrer automatically receives $100 in their wallet. Mega Dice ($DICE) Innovation A Platform For Success Mega Dice was among the first regulated casinos to open on the popular Telegram platform. The completion of $DICE’s full integration with the Mega Dice ecosystem makes possible even more customer engagement, by pushing the bounds of gamification possibilities. With growing engagement baked in, revenue growth can surge. Leveraging the openness and agility inherent in decentralized networks, $DICE is set to become the No.1 GameFi on Solana. Keep in touch with Mega Dice token ($DICE) news and developments on X/Twitter and Telegram. Source: https://thebittimes.com/hot-new-solana-gamefi-token-mega-dice-blasts-past-1-million-raise-in-crypto-ico-tbt88392.html","article_summary":"Trending new Solana GameFi token Mega Dice ($DICE) has smashed through the $1 million milestone in its ongoing presale.On sale at an initial price of $0.069, the $DICE presale price has today risen to $0.075, representing an 8.6% hike....","publisher":{"name":"The Bit Times","logo":"https://logo.clearbit.com/thebittimes.com?size=96"},"creation_date":"2024-05-15T12:21:29Z","categories":["solana","token","crypto"],"article_link":"https://thebittimes.com/hot-new-solana-gamefi-token-mega-dice-blasts-past-1-million-raise-in-crypto-ico-tbt88392.html","thumbnail_image":"https://cdn.thebittimes.com/vimedia/w800/2024/05/15/c1f8ad6274370d59abd1048a54de00af.webp"},{"article_title":"Three Months after Settlement with CySEC, Fintailor Investments Renounces License","author":"Damian Chmiel","article_detailed_content":"The Cyprus Securities and Exchange Commission (CySEC) has made the decision to revoke the Cyprus Investment Firm (CIF) authorization previously granted to Fintailor Investments Ltd. CySEC Revokes Fintailor Investments Ltd's CIF Authorization Fintailor voluntarily relinquished its CIF authorization, leading to CySEC's decision to withdraw it formally. The company's choice to expressly renounce its authorization was cited as the primary reason behind the regulator’s action. Finance Magnates last reported on Fintailor, which has held a CIF license since 2011, over three months ago. This was in February when CySEC announced a settlement with the company for €200,000. According to the statement at the time, the regulator highlighted potential breaches in anti-money laundering laws. The investigation covered the period between 2016 and 2019. The settlement agreement from February highlighted several critical issues within the Company's anti-money laundering and counter-terrorist financing framework. These issues included inadequate policies and procedures for customer identification and due diligence, a failure to thoroughly examine transactions that may be vulnerable to financial crimes, particularly complex or unusually large transactions and unusual transaction patterns lacking clear economic or legal purpose. Furthermore, the settlement revealed shortcomings in the Board of Directors' responsibilities in ensuring compliance and deficiencies in the Compliance Officer's duties in overseeing and implementing effective anti-money laundering measures. Leverate Financial Services Ltd, a popular brand in the brokerage market, also recently renounced its CySEC license. A month ago, the company was also excluded from the Investors Compensation Fund (ICF). CySEC's 2024 Supervisory Focus CySEC is set to intensify its oversight of firms involved in cross-border activities, particularly in handling complex financial products like Contracts for Difference (CFDs). The regulator's supervisory priorities for 2024 include bolstering investor protection and ensuring market integrity through an enhanced supervisory framework. This plan entails a thorough evaluation of the risks and responsibilities of the entities under its supervision. In 2023, CySEC carried out more than 700 on-site and remote inspections of supervised entities, resulting in over $2.2 million in fines. These thematic audits were conducted to ensure regulatory compliance and safeguard investors' interests. This article was written by Damian Chmiel at www.financemagnates.com.","article_summary":"The Cyprus Securities and Exchange Commission (CySEC) has made the decision to revoke the Cyprus Investment Firm (CIF) authorization previously granted to Fintailor Investments Ltd. CySEC Revokes Fintailor Investments Ltd's CIF Authorization Fintailor voluntarily relinquished its CIF authorization, leading to CySEC's decision to withdraw it formally. The company's choice to expressly renounce its authorization was cited as the primary reason behind the regulator’s action. Finance Magnates last reported on Fintailor, which has held a CIF license since 2011, over three months ago. This was in February when CySEC announced a settlement with the company for €200,000. According to the statement at the time, the regulator highlighted potential breaches in anti-money laundering laws. The investigation covered the period between 2016 and 2019. The settlement agreement from February highlighted several critical issues within the Company's anti-money laundering and counter-terrorist financing framework. These issues included inadequate policies and procedures for customer identification and due diligence, a failure to thoroughly examine transactions that may be vulnerable to financial crimes, particularly complex or unusually large transactions and unusual transaction patterns lacking clear economic or legal purpose. Furthermore, the settlement revealed shortcomings in the Board of Directors' responsibilities in ensuring compliance and deficiencies in the Compliance Officer's duties in overseeing and implementing effective anti-money laundering measures. Leverate Financial Services Ltd, a popular brand in the brokerage market, also recently renounced its CySEC license. A month ago, the company was also excluded from the Investors Compensation Fund (ICF). CySEC's 2024 Supervisory Focus CySEC is set to intensify its oversight of firms involved in cross-border activities, particularly in handling complex financial products like Contracts for Difference (CFDs). The regulator's supervisory priorities for 2024 include bolstering investor protection and ensuring market integrity through an enhanced supervisory framework. This plan entails a thorough evaluation of the risks and responsibilities of the entities under its supervision. In 2023, CySEC carried out more than 700 on-site and remote inspections of supervised entities, resulting in over $2.2 million in fines. These thematic audits were conducted to ensure regulatory compliance and safeguard investors' interests. This article was written by Damian Chmiel at www.financemagnates.com.","publisher":{"name":"Finance Magnates","logo":"https://t1.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.financemagnates.com/&size=64"},"creation_date":"2024-05-15T12:20:59Z","categories":["general"],"article_link":"https://www.financemagnates.com//forex/three-months-after-settlement-with-cysec-fintailor-investments-renounces-license/","thumbnail_image":""},{"article_title":"Solana Presale ‘Mega Dice Token’ Raises $1M After Announcing an Airdrop Campaign and Reward Scheme","author":"chainwire","article_detailed_content":"London, United Kingdom, May 15th, 2024, Chainwire The presale of Mega Dice Token (DICE), a new GameFi project, passed the $1 million funding milestone earlier today. Mega Dice Token Presale Structure and DICE Tokenomics Mega Dice Token presale allows investors to purchase DICE tokens before their upcoming launch on the open market. Mega Dice’s team has opted to structure the presale into “stages,” with each stage offering DICE tokens at a different price. To participate, investors must connect a wallet to Mega Dice Token’s presale dashboard and swap SOL, ETH, or BNB for DICE. Once the presale ends, the purchased DICE tokens will be distributed directly to investors’ connected wallets. When it comes to the project’s tokenomics, it’s worth noting that an allocation of 147 million DICE has been set aside for presale buyers – representing 35% of the total supply. A further 63 million DICE, accounting for 15% of the supply, will be deployed to provide liquidity once the token is listed on a DEX. DICE Token Powers Mega Dice’s Rewards & Benefits System DICE is the native token of the Mega Dice online casino platform. While Mega Dice is already an established casino brand, the introduction of DICE is designed to take the experience to an augmented level. A key draw of DICE is the opportunity for token holders to earn daily rewards based on the casino’s performance: by staking their DICE tokens, holders receive a portion of the casino’s profits. The team has structured the reward scheme this way with the aim of allowing the community to benefit from the potential growth of Mega Dice’s platform over the long term. As outlined in the project’s whitepaper, DICE holders also gain access to exclusive rewards, bonuses, and limited-edition NFTs. In addition to this, DICE holders will also be able to use their tokens to get engaged with the casino platform. Lastly, an upcoming referral program will allow token holders to earn a 25% revenue share for any new players they bring on board. $2.25M Airdrop Campaign Drives Community Growth Adding to the interest around DICE is the $2.25 million airdrop campaign that the development team has planned for active casino players which details have been clearly outlined on the token presale page. This airdrop will be split across three seasons, each distributing $750,000 worth of DICE tokens. The first season kicks off the airdrop, rewarding players who stay active and hit a $5,000 wager volume within 21 days. Season 2 allows players to earn DICE by wagering any supported cryptocurrency between the presale and the token’s official launch. Finally, Season 3 brings it full circle – players can accrue more DICE by wagering $5,000 within 21 days of the token going live. This airdrop campaign has driven Mega Dice’s Telegram and Twitter communities to increase the number of followers: the Mega Dice Telegram channel now has 9,300 members, while the project’s Twitter page has over 25,000 followers. About Mega Dice Token Mega Dice Token (DICE) is a Solana-based token that serves as the native currency of the Mega Dice casino. It enables token holders to earn daily rewards based on the casino’s performance by staking their DICE. The token also provides access to bonuses and limited-edition NFTs while offering utility within the Mega Dice ecosystem. Mega Dice Token presale website can be reached here. Mega Dice is the source of this content. This Press Release is for informational purposes only. The information does not constitute investment advice or an offer to invest. Contact Mega Dice Token contact@megadice.io","article_summary":"London, United Kingdom, May 15th, 2024, Chainwire The presale of Mega Dice Token (DICE), a new GameFi project, passed the $1 million funding milestone earlier today. Mega Dice Token Presale Structure and DICE Tokenomics Mega Dice Token presale allows investors to purchase DICE tokens before their upcoming launch on the open market. Mega Dice’s team has opted to structure the presale into “stages,” with each stage offering DICE tokens at a different price. To participate, investors must connect a wallet to Mega Dice Token’s presale dashboard and swap SOL, ETH, or BNB for DICE. Once the presale ends, the purchased","publisher":{"name":"Crypto Intelligence News","logo":"https://logo.clearbit.com/cryptointelligence.co.uk?size=96"},"creation_date":"2024-05-15T12:19:20Z","categories":["solana","token","sol","eth","bnb","cryptocurrency"],"article_link":"https://www.cryptointelligence.co.uk/solana-presale-mega-dice-token-raises-1m-after-announcing-an-airdrop-campaign-and-reward-scheme/","thumbnail_image":"https://cryptointelligence.b-cdn.net/wp-content/uploads/2024/05/yGwTR0z4GtPXcOPYIgoHzJXR0aShSsVUdiLmbNTXbpO5wEAodk_17157712138UO7IWMxHT.jpeg"},{"article_title":"Solana Presale 'Mega Dice Token' Raises $1M After Announcing an Airdrop Campaign and Reward Scheme","author":"Crypto Daily™","article_detailed_content":"London, United Kingdom, May 15th, 2024, Chainwire The presale of Mega Dice Token (DICE), a new GameFi project, passed the $1 million funding milestone earlier today. Mega Dice Token Presale Structure and DICE Tokenomics Mega Dice Token presale allows investors to purchase DICE tokens before their upcoming launch on the open market. Mega Dice’s team has opted to structure the presale into “stages,” with each stage offering DICE tokens at a different price. To participate, investors must connect a wallet to Mega Dice Token’s presale dashboard and swap SOL, ETH, or BNB for DICE. Once the presale ends, the purchased DICE tokens will be distributed directly to investors’ connected wallets. When it comes to the project’s tokenomics, it’s worth noting that an allocation of 147 million DICE has been set aside for presale buyers – representing 35% of the total supply. A further 63 million DICE, accounting for 15% of the supply, will be deployed to provide liquidity once the token is listed on a DEX. DICE Token Powers Mega Dice’s Rewards & Benefits System DICE is the native token of the Mega Dice online casino platform. While Mega Dice is already an established casino brand, the introduction of DICE is designed to take the experience to an augmented level. A key draw of DICE is the opportunity for token holders to earn daily rewards based on the casino's performance: by staking their DICE tokens, holders receive a portion of the casino’s profits. The team has structured the reward scheme this way with the aim of allowing the community to benefit from the potential growth of Mega Dice’s platform over the long term. As outlined in the project’s whitepaper, DICE holders also gain access to exclusive rewards, bonuses, and limited-edition NFTs. In addition to this, DICE holders will also be able to use their tokens to get engaged with the casino platform. Lastly, an upcoming referral program will allow token holders to earn a 25% revenue share for any new players they bring on board. $2.25M Airdrop Campaign Drives Community Growth Adding to the interest around DICE is the $2.25 million airdrop campaign that the development team has planned for active casino players which details have been clearly outlined on the token presale page. This airdrop will be split across three seasons, each distributing $750,000 worth of DICE tokens. The first season kicks off the airdrop, rewarding players who stay active and hit a $5,000 wager volume within 21 days. Season 2 allows players to earn DICE by wagering any supported cryptocurrency between the presale and the token’s official launch. Finally, Season 3 brings it full circle – players can accrue more DICE by wagering $5,000 within 21 days of the token going live. This airdrop campaign has driven Mega Dice’s Telegram and Twitter communities to increase the number of followers: the Mega Dice Telegram channel now has 9,300 members, while the project’s Twitter page has over 25,000 followers. About Mega Dice Token Mega Dice Token (DICE) is a Solana-based token that serves as the native currency of the Mega Dice casino. It enables token holders to earn daily rewards based on the casino’s performance by staking their DICE. The token also provides access to bonuses and limited-edition NFTs while offering utility within the Mega Dice ecosystem. Mega Dice Token presale website can be reached here. Mega Dice is the source of this content. This Press Release is for informational purposes only. The information does not constitute investment advice or an offer to invest. ContactMega Dice Tokencontact@megadice.io Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.","article_summary":"Solana Presale 'Mega Dice Token' Raises $1M After Announcing an Airdrop Campaign and Reward Scheme","publisher":{"name":"Crypto Daily","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://cryptodaily.co.uk/&size=64"},"creation_date":"2024-05-15T12:19:16Z","categories":["solana","token","sol","eth","bnb","cryptocurrency","crypto"],"article_link":"https://cryptodaily.co.uk/2024/05/solana-presale-mega-dice-token-raises-1m-after-announcing-an-airdrop-campaign-and-reward-scheme","thumbnail_image":"https://app.chainwire.org/storage/uploads/users/Chainwire_-_1800x1080_20_1715771561agKlU7CPVS.jpg"},{"article_title":"Shiba Inu Price Prediction as Analysts Spot Bull Flag Formation – Is a Rally Imminent?","author":"Simon Chandler","article_detailed_content":"SHIB has risen by 2% today, with the Shiba Inu price touching $0.00002399 on a day when the crypto market gains by 0.5% in the past 24 hours. This price also means that SHIB has increased by 5.5% in the past week and by 15% in the past fortnight, with the meme coin also sitting on a 169% lift in a year. And its gain today comes as its price chart forms a bullish pennant pattern, meaning that its resistance and support levels are converging on each other. This could signal that the coin is very close to a big rally, something which the return of meme-stock trader Keith Gill has made likelier this week. pic.twitter.com/D1bHJd0C1G — Roaring Kitty (@TheRoaringKitty) May 15, 2024 Shiba Inu Price Prediction as Analysts Spot Bull Flag Formation – Is a Rally Imminent? After rallying and dipping on each of the past two days, SHIB has rallied again in the past 24 hours, with its indicators looking very strong. Its relative strength index (purple) touched 70 earlier this morning, and despite a tiny dip, it has settled at around 65, indicating ongoing momentum and buying pressure. Source: TradingView More promisingly, SHIB’s 30-day average (orange) has begun rising again, after having recently overtaken the 200-day average (blue). The latter move is often a sign of a breakout and given that SHIB has risen strongly today, such a breakout appears to have recently begun. The coin’s resistance (red) and support (green) levels are point to such a possibility, with analysts recently taking to social media to suggest that SHIB is close to doing something special. $SHIB (Shiba Inu) in comparison to it's similar, previous breakout and run to All Time Highs (ATH), looks to be only in an \"intermission\" phase here in prepartion for a continuation to and above the current ATH at $0.000088598 which is currently over 282% away from here! In this… https://t.co/1w1C8dBNL8 pic.twitter.com/RfNV8nasxr — JAVONMARKS (@JavonTM1) May 12, 2024 SHIB’s promising movements also come as the meme token market hots up, with PEPE also being a big winner over the past couple of days. And the wider reason why the market has redoubled its interest in meme coins is that this week saw the return of GameStop instigator Keith Gill, better known as ‘Roaring Kitty.’ Gill’s reappearance after a three-year absence has sparked expectations that we’ll see a meme token season in the coming weeks, with traders already wading into meme coins in anticipation. Yet more broadly, SHIB continues to be one of the strongest meme coins in the market, given its fundamentals. It recently unveiled its upcoming privacy-focused layer-three network, while its layer-two network Shibarium has now processed well over 400 million transactions. Based on its strength, the Shiba Inu price should reach $0.000030 in the next couple of months. New Meme Tokens with Solid Fundamentals While SHIB may be one of the ‘safest’ bets within the meme token category, it certainly isn’t the only mew coin with the potential to witness big gains in the coming weeks. In fact, newer tokens may be in a better position to outperform the market, with several new meme coins holding very successful presales at the moment. One of the best is WienerAI (WAI), a new Ethereum-based cryptocurrency that has raised more than $1.8 million in its sale. WienerAI is more than a trading bot It's your AI trading companion! More details coming SOON! pic.twitter.com/HG5C0tE6Rk — WienerAI (@WienerDogAI) May 14, 2024 WienerAI is the native token of an innovative AI-based trading bot that will help investors trade more profitably. As a chatbot, it answer trading queries and offer recommendations on potential winners, so that users can stay ahead of the market. Yet it will also offer an atomic swap function, so that users can directly buy (or sell) any recommended coins through its platform. On top of this, it provides protection against front-running bots and traders, enabling investors to make trades quickly and efficiently. This gives it plenty of utility as a platform, while its native token, WAI, will have a fixed max supply of 69 billion tokens. Also bullish is the fact that holders will be able to stake the coin for a passive income, something that will incentivize long-term holding. Given that so many meme tokens depend entirely on hype and FOMO, the fact that WienerAI has genuine fundamentals puts it in a great position. Investors can join its sale at the official WienerAI website, where 1 WAI is selling for $0.000707. The sale will end once it sells 30% of WAI’s overall supply, with the token set to list – and possibly rocket – soon afterwards. Buy WAI Today The post Shiba Inu Price Prediction as Analysts Spot Bull Flag Formation – Is a Rally Imminent? appeared first on Cryptonews.","article_summary":"SHIB has risen by 2% today, with the Shiba Inu price touching $0.00002399 on a day when the crypto market gains by 0.5% in the past 24 hours. The post Shiba Inu Price Prediction as Analysts Spot Bull Flag Formation – Is a Rally Imminent? appeared first on Cryptonews.","publisher":{"name":"Crypto News","logo":"https://t1.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://cryptonews.com/&size=64"},"creation_date":"2024-05-15T12:16:14Z","categories":["shib","crypto","token","pepe","cryptocurrency","ai"],"article_link":"https://cryptonews.com/news/shiba-inu-price-prediction-as-analysts-spot-bull-flag-formation-is-a-rally-imminent.htm","thumbnail_image":"https://cimg.co/wp-content/uploads/2024/05/15113458/1715772898-shiba-inu-price-prediction-as-analysts-spot-bull-flag-formation-is-a-rally-imminent.jpg"},{"article_title":"Degen Chain restarts after two-day outage, still stabilizing infrastructure","author":"Oluwapelumi Adejumo","article_detailed_content":"Degen Chain, an Ethereum layer-3 blockchain, has resumed operations two days after halting block validation. The pause, which began on May 12, rendered several decentralized applications and bridges operating on it non-functional. Today, the network is back online after Conduit, a rollup infrastructure platform, resynchronized its nodes from the genesis block. Block indexing The team at Conduit clarified that although the Degen Chain was now operational, its block explorer is still undergoing indexing. So, the firm advised infrastructure providers to initiate indexing from a designated block to ensure smooth consistency in the process. Additionally, Conduit has taken measures to filter transactions from approximately five addresses, each harboring millions of failed transactions. It added: “To bring the network online as soon as possible, a few (<5) addresses were filtered during the replay process. These addresses have tens of millions of failed transactions and were stalling the replay process. Transactions from these addresses can be replayed, but on a delay that does not prevent the network from coming back online.” The Degen Chain’s block explorer shows that transaction indexing is in progress, with the rate at 95% as of press time. What caused Degen Chain outage? An earlier statement from Conduit explained that Degen Chain’s issues began when it completed a custom configuration last Friday. According to the firm, this update caused two of its chains—Degen and Proof of Play’s Apex—to stop “posting batches for more than 24 hours. Upon resuming, the first batches triggered reorgs on both chains.” However, Conduit promised to provide a more detailed post-mortem about the incidents, adding that the upgrade that caused the network’s issues was validated on testnet before rolling out to mainnets. Meanwhile, the recent issues within Degen Chain have sparked increased attention on layer-3 blockchain networks, stirring division within the community. Particularly, skeptics such as Polygon CEO Marc Boiron have previously cautioned that these networks primarily serve to divert value from Ethereum onto the layer-2 platforms hosting these layer-3 solutions. The post Degen Chain restarts after two-day outage, still stabilizing infrastructure appeared first on CryptoSlate.","article_summary":"Degen Chain, an Ethereum layer-3 blockchain, has resumed operations two days after halting block validation. The pause, which began on May 12, rendered several decentralized applications and bridges operating on it non-functional. Today, the network is back online after Conduit, a rollup infrastructure platform, resynchronized its nodes from the genesis block. Block indexing The team […] The post Degen Chain restarts after two-day outage, still stabilizing infrastructure appeared first on CryptoSlate.","publisher":{"name":"Crypto Slate","logo":"https://t0.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://cryptoslate.com/&size=64"},"creation_date":"2024-05-15T12:15:55Z","categories":["ethereum","blockchain","polygon"],"article_link":"https://cryptoslate.com/degen-chain-restarts-after-two-day-outage-still-stabilizing-infrastructure/","thumbnail_image":"https://cryptoslate.com/wp-content/uploads/2024/05/degen-chain.jpg"},{"article_title":"SEC pursue Ripple (XRP) for $2B, Rollblock (RBLK) price predicted to surge 1200%","author":"AMBCrypto Team","article_detailed_content":"Recently, the SEC decided to pursue Ripple (XRP) for $2B as its legal battle heats […]","article_summary":"Recently, the SEC decided to pursue Ripple (XRP) for $2B as its legal battle heats […]","publisher":{"name":"AMBCrypto","logo":"https://logo.clearbit.com/ambcrypto.com?size=96"},"creation_date":"2024-05-15T12:15:06Z","categories":["xrp"],"article_link":"https://ambcrypto.com/sec-pursue-ripple-xrp-for-2b-rollblock-rblk-price-predicted-to-surge-1200/","thumbnail_image":"https://ambcrypto.com/wp-content/uploads/2024/05/Rollblock-RBLK-Price-Predicted-To-Surge.png"},{"article_title":"Legal experts weigh-in on case again Roger Ver","author":"Rony Roy","article_detailed_content":"Stanislav Andreyev, a senior lawyer with SBSB Fintech Lawyers, and Bing Wang, a legal advisor at basedVC, spoke to crypto.news about how Roger Ver’s case might shape the regulatory landscape for cryptocurrencies. Roger Ver, an early investor in Bitcoin and…","article_summary":"Stanislav Andreyev, a senior lawyer with SBSB Fintech Lawyers, and Bing Wang, a legal advisor at basedVC, spoke to crypto.news about how Roger Ver’s case might shape the regulatory landscape for cryptocurrencies. Roger Ver, an early investor in Bitcoin and…","publisher":{"name":"Crypto.news","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://crypto.news/&size=64"},"creation_date":"2024-05-15T12:13:29Z","categories":["bitcoin"],"article_link":"https://crypto.news/legal-experts-weigh-in-on-case-again-roger-ver/","thumbnail_image":"https://crypto.news/app/uploads/2024/05/crypto-news-SEC-issues-Wells-notice-to-Robinhood-Crypto-option02.webp"},{"article_title":"Finalto Unveils New Offices in Singapore","author":"FM Contributors","article_detailed_content":"Finalto Asia Pte Ltd is excited to announce its relocation to a new office at 79 Anson Road UE BizHub, Singapore. This expansion underscores Finalto’s commitment to strengthening its presence in Asia and its dedication to being a truly global financial services provider. Finalto continues to make good on its promise to strive for worldwide coverage, taking the time and resources to specifically cater to the needs of emerging local jurisdictions in the financial services space. Since obtaining its MAS Capital Markets Services license in December 2019, Finalto Asia has demonstrated remarkable resilience and a flair for innovation, even in the face of the global challenges posed by the COVID-19 pandemic. The license acquisition just before the pandemic set the stage for Finalto Asia to establish itself as a formidable player in the financial services sector. As part of its ongoing mission of global expansion and local market integration, Finalto has moved to a new office in the heart of Singapore’s business district. The new space is designed to support the company's growth strategy and accommodate a larger multinational team, driven by growing demand for Finalto's innovative financial solutions. Finalto is thrilled to be afforded the opportunity to grow and thrive in different markets, delivering value to both individual clients and businesses. Alex MacKinnon, CEO of Finalto Asia, remarked, \"The establishment of our new office in Singapore marks a significant milestone for Finalto. It not only supports our growth ambitions but also reinforces our commitment to serving our clients and partners with even greater capability. Singapore is incredibly important in our strategy as it allows us to cultivate a significant foothold in an exciting and fast-moving sector of the Asian market.\" The local team at the Singapore office includes specialists in regional financial regulations and market trends, ensuring that our services are both compliant and highly competitive. The investment in the new Singapore office is part of Finalto's strategic initiatives to enhance service excellence across its global operations. Finalto’s expansion in Singapore also aligns with its strategic vision to be at the forefront of financial services, leveraging local expertise while harnessing global trends and opportunities. Finalto Asia looks forward to welcoming clients and stakeholders to its new home and continuing its journey of success from 79 Anson Road. For more information about Finalto and our services, please contact the Finalto sales team at sales@finalto.com. This article was written by FM Contributors at www.financemagnates.com.","article_summary":"Finalto Asia Pte Ltd is excited to announce its relocation to a new office at 79 Anson Road UE BizHub, Singapore. This expansion underscores Finalto’s commitment to strengthening its presence in Asia and its dedication to being a truly global financial services provider. Finalto continues to make good on its promise to strive for worldwide coverage, taking the time and resources to specifically cater to the needs of emerging local jurisdictions in the financial services space. Since obtaining its MAS Capital Markets Services license in December 2019, Finalto Asia has demonstrated remarkable resilience and a flair for innovation, even in the face of the global challenges posed by the COVID-19 pandemic. The license acquisition just before the pandemic set the stage for Finalto Asia to establish itself as a formidable player in the financial services sector. As part of its ongoing mission of global expansion and local market integration, Finalto has moved to a new office in the heart of Singapore’s business district. The new space is designed to support the company's growth strategy and accommodate a larger multinational team, driven by growing demand for Finalto's innovative financial solutions. Finalto is thrilled to be afforded the opportunity to grow and thrive in different markets, delivering value to both individual clients and businesses. Alex MacKinnon, CEO of Finalto Asia, remarked, \"The establishment of our new office in Singapore marks a significant milestone for Finalto. It not only supports our growth ambitions but also reinforces our commitment to serving our clients and partners with even greater capability. Singapore is incredibly important in our strategy as it allows us to cultivate a significant foothold in an exciting and fast-moving sector of the Asian market.\" The local team at the Singapore office includes specialists in regional financial regulations and market trends, ensuring that our services are both compliant and highly competitive. The investment in the new Singapore office is part of Finalto's strategic initiatives to enhance service excellence across its global operations. Finalto’s expansion in Singapore also aligns with its strategic vision to be at the forefront of financial services, leveraging local expertise while harnessing global trends and opportunities. Finalto Asia looks forward to welcoming clients and stakeholders to its new home and continuing its journey of success from 79 Anson Road. For more information about Finalto and our services, please contact the Finalto sales team at sales@finalto.com. This article was written by FM Contributors at www.financemagnates.com.","publisher":{"name":"Finance Magnates","logo":"https://t1.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.financemagnates.com/&size=64"},"creation_date":"2024-05-15T12:13:23Z","categories":["general"],"article_link":"https://www.financemagnates.com//thought-leadership/finalto-unveils-new-offices-in-singapore/","thumbnail_image":""},{"article_title":"FTX Coin (FTX) Stability in Question: Salame Pleads Innocence, Seeks Leniency Amidst Exchange Collapse","author":"Jocelyn Blake","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Former FTX executive, Ryan Salame, has requested a lenient 18-month prison sentence in connection with the fraud case surrounding the company’s collapse. Salame’s legal team argues that his cooperation with law enforcement and his lesser role in FTX’s operations should be […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Former FTX executive, Ryan Salame, has requested a lenient 18-month prison sentence in connection with the fraud case surrounding the company’s collapse. Salame’s legal team argues that his cooperation with law enforcement and his lesser role in FTX’s operations should be […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T12:13:17Z","categories":["pepe"],"article_link":"https://en.coinotag.com/ftx-coin-ftx-stability-in-question-salame-pleads-innocence-seeks-leniency-amidst-exchange-collapse/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-9.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Revolutionize Crypto Trading with Binance’s New Arbitrage Bot and Spot Copy Trading Features","author":"Marisol Navaro","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Binance Expands Trading Options with New Funding Rate Arbitrage Bot and Full Access to Spot Copy Trading Binance, the world’s leading cryptocurrency exchange, has launched a new Funding Rate Arbitrage Bot and fully rolled out Spot Copy Trading to all eligible […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Binance Expands Trading Options with New Funding Rate Arbitrage Bot and Full Access to Spot Copy Trading Binance, the world’s leading cryptocurrency exchange, has launched a new Funding Rate Arbitrage Bot and fully rolled out Spot Copy Trading to all eligible […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T12:11:31Z","categories":["crypto","pepe","cryptocurrency"],"article_link":"https://en.coinotag.com/revolutionize-crypto-trading-with-binances-new-arbitrage-bot-and-spot-copy-trading-features/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies-6.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"Bitcoin in April: Halving Price Fallout, Network Peaks and ETF Updates","author":"Veronika Rinecker","article_detailed_content":"In April 2024, Bitcoin faced its sharpest price drop since the FTX collapse, with halving charts in focus, but network activity soared to record highs, driven by new protocols and ETF developments. This report explores and analyzes Bitcoin’s ecosystem and the BTC price developments last month. Key takeaways: The Bitcoin price dropped following the fourth halving, reaching $57,000 before a quick rebound. This marks the sharpest decline since the FTX collapse. Despite the price drop, the Bitcoin network saw a surge in activity in April, with daily transactions reaching a record high of 927k on April 23. However, this increase was short-lived, and it dropped again by the end of the month. The surge in network activity led to record-high transaction fees in April, peaking at $25.8 million on April 24. This congestion might be linked to the Runes protocol launch. Spot Bitcoin ETFs saw $343.5 million withdrawn from the funds in April – the first monthly net outflows since trading began in January. While US ETFs faced outflows, Hong Kong launched its first three spot Bitcoin ETFs in April, potentially becoming a hub for Asian crypto investment. Bitcoin Ordinals NFTs gained traction, reaching a $2.3 billion valuation, despite Binance ending support due to potential network strain. Bitcoin remained the leader in NFT sales volume in April, generating over $594 million compared to other blockchains. What You’ll Find in This March Bitcoin Analysis: What is Bitcoin? BTC Price Performance And Halving Charts Bitcoin’s Network Activity and Fees Spot Bitcoin ETFs Bitcoin Mining Updates Bitcoin DeFi Updates Bitcoin Ordinals NFTs Bitcoin NFTs lead the market Looking ahead – Can the Bitcoin Halving Charts be Inversed? What is Bitcoin? Bitcoin (BTC) is a decentralized cryptocurrency created to function as a digital currency and means of payment that operates independently of any single individual, organization, or authority, eliminating the need for third-party intermediaries in financial transactions. It is allocated to blockchain miners to validate transactions and can be purchased through various exchanges.Unveiled to the public in 2009 by an enigmatic developer or group known as Satoshi Nakamoto, Bitcoin has become the most widely recognized cryptocurrency in the world. Its success has spurred the creation of numerous other cryptocurrencies. BTC Price Performance And Halving Charts While widely anticipated, Bitcoin’s fourth halving on April 20 followed the historical trend of short-term volatility. Bitcoin fell nearly 21% in April alone, dropping below $60,000 on April 19 as investors cashed out of a robust rally that had previously pushed prices above $72,500 (on April 8). Between April 30 and May 1, the Bitcoin price crashed below $57,000, its lowest level since late February. BTC/USD daily chart. Source: TradingView Interestingly, past halving events also exhibited similar patterns. According to Glassnode data, while the first halving saw an immediate 11% gain, the subsequent two halving events saw price stagnation after two weeks. The 60-day period following halvings often shows choppy sideways movement, and price drops between -5% and -15%. BTC price performance after halvings. Source: Glassnode According to 10x Research CEO and senior analyst Markus Thielen, Bitcoin could further fall to $52,000. The analyst predicts a drop to $52,000, citing a slowdown in the main driver of the rally – inflows into Bitcoin exchange-traded funds (ETFs), which dropped in April. April 19, 2024: Why #Bitcoin May Fall to $52,000 (https://t.co/G5cig000eI The primary driver for the recent Bitcoin price rally was the inflow of funds into Bitcoin ETFs, which has now dried up over the past 4-5 weeks. The market internals have become weaker … -> -> pic.twitter.com/0RdkgNO5Q6 — Markus Thielen (@thielen10x) April 30, 2024 Fidelity Digital Assets downgraded Bitcoin’s outlook to “neutral” after Q1. Its Q1 2024 Signals Report suggests that Bitcoin is no longer “cheap” and undervalued. The analysts also see potential selling pressure from long-term holders and high overall profitability. According to VanEck, 94% of Bitcoin addresses remain in profit despite a slight decline of 4% over the month. Analysts at Bitfinex, on the other hand, are more positive and predict Bitcoin will consolidate for 1-2 months after the halving. The experts expect Bitcoin to remain the market leader and believe the economic situation is more stable than in past halvings. This could lead to sideways trading with swings of $10,000, with any price increase from the halving happening later. Looking for a Bitcoin Price Prediction? Bitcoin Price Prediction 2024 – 2034 Bitcoin’s Network Activity and Fees Bitcoin’s price dipped after the halving, but network activity boomed. Daily transactions increased by 135% after the halving, reaching 927k on April 23. However, this recovery was short-lived, and the number of daily transactions dropped again by the end of the month, reaching 403k transactions on April 30. Number of daily transactions on Bitcoin in April 2024. Source: Artemis Bitcoin’s daily active addresses saw a rollercoaster ride in April. Starting at 605k on April 1, the number climbed to 640k by April 4. However, it then took a sharp dip to 269k on April 20, the day after the halving. Activity recovered somewhat, reaching 483k by the end of the month. Number of active addresses on Bitcoin. Source: Artemis Average daily transaction fees on Bitcoin surged to a record $25.8 million on April 24 before falling back to $6,15 million on April 30. The average fee in April was $16.77. Similarly, average individual transaction fees on Bitcoin spiked to $40 on April 24 and dropped to $11,92 on April 30. Bitcoin managed to attract more capital in April and reached $1.4 billion in total value locked (TVL), an increase of 94% compared to TVL on April 2 ($724 million). Bitcoin’s total value locked in April 2024. Source: Artemis The 2024 halving block has become the most expensive block ever mined in Bitcoin’s history, with users scrambling to inscribe rare assets via the Runes protocol. Users spent a whopping 37.7 Bitcoin (over $2.4 million) to secure a spot, according to data from Bitcoin block explorer Mempool.space. Bitcoin users spent a record $2.4M in fees on the first halving block. Source: Mempool.space High fees on the Bitcoin halving block were fueled by a surge in demand for rare digital inscriptions and new token creation. This frenzy was driven by the launch of Casey Rodarmor’s Runes protocol, which allows users to create tokens directly on the Bitcoin network, coinciding with the halving event. Runes offers an alternative to existing methods like the BRC-20 token standard – an Ordinals-based method for creating Bitcoin-based tokens. Both leverage Bitcoin’s network, but Runes utilizes a more efficient Unspent Transaction Output (UTXO) model, unlike the “inscription” method of BRC-20s. Amid increasing Bitcoin use for day-to-day purchases, the Bitcoin network recorded the highest number – 1.63 million – of confirmed payments on April 23. The total number of confirmed payments per day during April 2024. Source: Blockchain.com This massive spike was also driven by the launch of the Runes protocol. According to Dune Analytics data, Runes accounted for a whopping 81.3% of all Bitcoin transactions that day. However, Bitcoin is making a comeback, reclaiming 82,6% of transactions by April 30. Other protocols like Ordinals (2,6%) and BRC-20 (0,7%) comprise a smaller portion of the network activity. Spot Bitcoin ETFs April 2024 was a whirlwind for spot Bitcoin ETFs. After a period of immense enthusiasm and record inflows in Q1 2024—attracting $1.5 billion, $6 billion, and $4.6 billion in January, February, and March, respectively—April saw a significant shift in sentiment, with outflows surpassing inflows for the first time since the Bitcoin ETFs launched in January. In April, spot Bitcoin ETFs saw $343.5 million withdrawn from the funds, ending their three-month inflow streak. The initial inflows surge slowed significantly after peaking at $1.05 billion daily in mid-March. This coincided with a drop in Bitcoin’s price, which fell 18% from its all-time high by the end of April. Grayscale’s GBTC fund saw the most significant outflows at $2.5 billion. ARK Invest’s ARKB and Valkyrie’s BRRR also experienced minor outflows.BlackRock’s IBIT initially attracted the most inflows in April ($1.5 billion), followed by Fidelity’s FBTC and Bitwise’s BITB. However, IBIT’s impressive 71-day inflow streak ended on April 23 and has seen zero flows for five consecutive days since. The trend continued on April 30. ARKB was the only ETF with inflows ($3.6 million), while outflows from GBTC, FBTC and BITB resulted in a net outflow of $161.6 million for the day. Total spot Bitcoin ETF net inflow in USD. Source: Coinglass Bitcoin ETFs’ trading activity also slowed significantly during the last month. After hitting a record daily volume of $9.9 billion on March 5 (coinciding with Bitcoin surpassing its previous cycle high), trading volume fell to $2.9 billion on April 30. BlackRock updated its Bitcoin ETF On April 5, BlackRock, a leading asset manager, updated their Bitcoin ETF prospectus, adding five new authorized participants: ABN AMRO Clearing, Citadel Securities, Citigroup Global Markets, Goldman Sachs, and UBS Securities. This move adds to the existing roster of authorized participants, including JPMorgan, Jane Street Capital, Macquarie Capital, and Virtu Americas. By incorporating these big Wall Street players, BlackRock could increase liquidity and attract more institutional interest in their Bitcoin ETFs. Hong Kong launched Asia’s first Bitcoin ETFs While US spot Bitcoin ETFs have dominated headlines recently, April marked a significant shift. The Hong Kong Stock Exchange (HKEX) debuted three new spot Bitcoin ETFs on April 30, offering investors exposure to these leading cryptocurrency-based products. These include Bosera HashKey Bitcoin ETF (3008.HK), ChinaAMC Bitcoin ETF (3042.HK), and Harvest Bitcoin Spot ETF (3439.HK). This launch positions Hong Kong as a potential hub for Asian cryptocurrency investment. However, the inflows from the launched spot Bitcoin ETFs in Hong Kong were not enough to cover the outflows from the 11 US-based spot Bitcoin ETFs. meanwhile, Hong Kong has seen US$217m on inflows this week pic.twitter.com/mLZVLzDQFy — James Butterfill (@jbutterfill) May 2, 2024 DTCC rules out collateral for Bitcoin-linked ETFs On April 26, the Depository Trust and Clearing Corporation (DTCC), a key player in financial settlements, dealt a blow to Bitcoin ETFs. DTCC announced it will not consider Bitcoin or other cryptocurrencies as collateral for loans or credit facilities. This change takes effect in late April, meaning these ETFs will have zero collateral value within the DTCC system. This decision could limit the attractiveness of Bitcoin ETFs for some institutional investors who rely on collateral for borrowing and managing risk. However, in an X post, cryptocurrency enthusiast K.O. Kryptowaluty clarified that this would only apply to inter-entity settlement within the line of credit system. The use of cryptocurrency ETFs for lending and as collateral in brokerage activities will continue unaffected, depending on the risk tolerance of individual brokers. The DTC system, or Depository Trust Company, is a key component of the financial infrastructure of the United States, acting as the central securities depository. DTC is part of a larger organization called the Depository Trust & Clearing Corporation (DTCC) what you write… — K.O Kryptowaluty (@KO_Kryptowaluty) April 27, 2024 Morgan Stanley and UBS want to offer Bitcoin ETFs Financial giants Morgan Stanley and UBS, boasting a combined $2.36 trillion in assets under management, are reportedly gearing up to offer spot Bitcoin ETFs on their platforms. This move could be a major tipping point for institutional adoption of Bitcoin, bringing mainstream legitimacy and potentially driving broader investor interest. Australia’s top exchange expected to approve Bitcoin ETFs in 2024 Australia’s leading stock exchange, the ASX, is expected to list its first spot Bitcoin ETFs by the end of 2024. Bloomberg quoted sources familiar with the matter saying several companies have already filed applications for these ETFs. These include established players like VanEck and local Australian firms BetaShares and DigitalX. With a domestic market capitalization of $2.7 trillion as of March 2024, the ASX is a major player in Australian finance, and the arrival of Bitcoin ETFs could further diversify investment options on the platform. Bitcoin Mining Updates Bitcoin miners feel the pinch after the halving cut their earnings (from 6.25 BTC to 3.125 BTC). According to data from Hashrate Index, the hash price fell below $45 per PH/s per day on May 2, despite a brief pop in revenue for miners post-halving amid the Runes frenzy transaction fee windfall (172 per PH/s on April 20). Bitcoin mining profitability (hash price) hits record lows after halving event. Source: Hashrate Index According to crypto analytics firm CryptoQuant, the hash price for miners dropped from nearly $0.12 in early April to $0.07 post-halving, following a $0.19 peak on halving day. Despite a high network hashrate maintaining pressure, hashprice has dropped, challenging miner profitability. The initial halving benefits through increased fees quickly dissipated, setting a new norm for lower daily revenues. With the network hashrate holding steady at 617… pic.twitter.com/yH2xP3qt7w — CryptoQuant.com (@cryptoquant_com) April 25, 2024 Despite the reduction in rewards, miners are still hashing, suggesting that BTC mining is still profitable at Bitcoin’s current prices. According to Ki Young Ju, CEO of CryptoQuant, there’s no sign of miners dumping their Bitcoin capitulation – for now. But, if Bitcoin prices keep dropping, large miners may be forced to sell some Bitcoin liquidate to stay afloat. #Bitcoin miners' revenue has dropped to levels seen in early 2023 following the halving. Now they have two options: 1. Capitulation, or 2. Waiting for a rise in $BTC price. There are no signs of capitulation for now. pic.twitter.com/8GrYk7zcN1 — Ki Young Ju (@ki_young_ju) April 30, 2024 While Bitcoin’s mining network appears stable in the short term, the long-term effects of halving the hash rate (processing power) and overall miner activity remain unclear. Historically, periods following halving events have witnessed some miners exiting the market due to increased operational costs. The future of Bitcoin mining will likely depend on factors like Bitcoin price fluctuations and changes in electricity costs. There are also some new April updates related to Bitcoin mining: Block develops its own Bitcoin mining system Payments company Block, formerly known as Square, announced the development of a new Bitcoin mining system. This follows the completion of a 3-nanometer application-specific integrated circuit (ASIC) chip designed specifically for Bitcoin mining. Block plans to offer both standalone mining chips and complete mining systems. Waste heat from Bitcoin mining warms Finnish homes Finland is exploring utilizing waste heat from Bitcoin mining for residential heating. A new project by Hashlabs Mining integrates heat generation from specialized Bitcoin mining equipment (WhatsMiner M63S) with the existing district heating system. This system transfers heat from a central source (in this case, Bitcoin mining) through insulated pipes to multiple buildings. This initiative could provide a sustainable heating solution for Finnish households, particularly during cold winters. Norway tightens regulations for data centers, potentially impacting Bitcoin miners In April, Norway enacted new legislation requiring all data centers to formally register with the government. This registration process will involve disclosing ownership, leadership, and the types of digital services offered. Terje Aasland, Norway’s Minister of Energy, stated that the government hopes this increased transparency will allow local authorities to make more informed decisions regarding data center operations, particularly their potential impact on Bitcoin mining activities. Bitcoin Ecosystem News April saw some important developments in the Bitcoin ecosystem, showing how companies innovate on multiple fronts. MicroStrategy unveils a decentralized identity solution on Bitcoin MicroStrategy, known for its massive Bitcoin holdings, is venturing beyond simple investment. At their “Bitcoin For Corporations” conference on May 1, the company announced “MicroStrategy Orange,” a decentralized identity solution built on the Bitcoin network. This system will leverage Ordinal inscriptions to store data directly on the Bitcoin blockchain. This could revolutionize online identity management by offering a secure, tamper-proof and user-controlled alternative to traditional systems. Moreover, in April, MicroStrategy purchased $7.8 million worth of Bitcoin, bringing its total holdings to 214,400 BTC. Ankr brings Bitcoin liquidity to Talus’ AI-powered blockchain Starting May 1, Ankr, an infrastructure provider for decentralized blockchains, brought Bitcoin liquidity to Talus, a blockchain-focused on artificial intelligence (AI). This collaboration unlocks new possibilities for Talus’ smart agents and AI assistants, allowing Talus users to leverage the security and value of Bitcoin while participating in DeFi activities on the Talus network. Coinbase integrates Lightning Network for Bitcoin transactions Coinbase is now offering users more flexibility when sending Bitcoin. The cryptocurrency exchange integrated the Lightning Network, a Layer 2 technology that enables quicker and cheaper transactions compared to the traditional Bitcoin blockchain. To use the Lightning Network, the intended recipient sends an invoice consisting of a lengthy string of characters that Coinbase recognizes as the transfer amount. For this integration, Coinbase chose Lightspark, a provider of Lightning payments solutions, as its partner. Animoca Brands enters Bitcoin with Opal Foundation Hong Kong-based game software company Animoca Brands announced its foray into the Bitcoin industry on April 30. The firm aims to become the “largest Web3 ecosystem” for gaming, education and culture built on Bitcoin. This move involves backing the Opal Foundation, a new protocol within the Bitcoin ecosystem. The foundation will focus on the Opal Protocol and its associated token, BLIF (potentially referring to “Opal Protocol Runes”). BLIF is initiated by collaborating with Animoca Brands and the metaverse technology platform Darewise. Animoca Brands is coming to #Bitcoin! Bitcoin is ready for Web3. OPAL Protocol (@OpalBTC), powered by $BLIF and initiated by @darewise & @animocabrands, is slated to become the largest #Web3 ecosystem of #gaming, entertainment, #Defi, education, and culture, built on Bitcoin. A… pic.twitter.com/WcJ65vMHfB — Animoca Brands (@animocabrands) April 30, 2024 Bitcoin DeFi Updates The emergence of Ordinals has reinvigorated the Bitcoin decentralized application (DApp) ecosystem by demonstrating the potential for novel protocols on the network. One such protocol is the Runes protocol, launched on April 20. Runes is a new standard for creating tokens on the Bitcoin blockchain. It allows users to represent real-world assets such as real estate, stocks, commodities or even other cryptocurrencies (including stablecoins) using tokens on the Bitcoin network. Runes ecosystem overview. Source: @DoggFatherCrew The growing interest in Runes could drive more activity to Layer 2 networks and increase the adoption of Bitcoin-native DApps, as we can see from recent developments. Stacks active accounts reach record-high Data from Bitcoin data provider Signal 21 showed that Stacks, a Layer 2 network for Bitcoin, reached a new all-time high of 122,497 active accounts in April. Active accounts are defined as addresses with at least one transaction. Active Accounts on @Stacks reached a new all time high of 122,497 for the month of April $STX pic.twitter.com/lcE8tAj9rz — Signal21 (@signal21btc) May 2, 2024 Orders DEX unveils roadmap Bitcoin decentralized exchange (DEX) Orders Exchange announced its 2024 roadmap on April 29. Plans include integrating with major Web3 wallets and building a Bitcoin nonfungible token (NFT) marketplace. Previously, Orders Exchange integrated with the Runes protocol to enable fungible token issuance and built a bridge with sidechain MicroVisionChain for BRC-20 token swaps. The 2024 roadmap for https://t.co/p5980u1jCI has just been released! Our team continues to work tirelessly to bring you the best experience. Stay tuned for more updates!#Bitcoin $BTC $RDEX #DeFi #BRC20 #Ordinlas #Runes pic.twitter.com/FZEGXvPhBX — Orders.Exchange (@orders_exchange) April 29, 2024 BEVM gains traction Launched in March 2024, BEVM, a Layer 2 scaling solution for Bitcoin, attracted over 700,000 user addresses and 30+ ecosystem projects during April 2024. Built on Taproot consensus, BEVM utilizes BTC for gas fees and boasts a current valuation of $200 million. BEVM also announced an investment from Bitmain, the world’s leading manufacturer of cryptocurrency mining servers. The exact amount of the investment was not disclosed. Bitcoin Ordinals NFTs The Bitcoin Ordinals market has reached a valuation of $2.3 billion at publication, even amid a broader market downturn. Ordinals are the first iteration of NFTs on Bitcoin. Ordinals live solely on the Bitcoin blockchain, unlike most of today’s popular NFT collections that host their metadata on centralized servers, creating additional points of vulnerability. According to data from Dune Analytics, the network has over 66,3 million inscriptions to date and generated over $267 million in transaction fees. Bitcoin Ordinals boasted over 66 million inscriptions. Source: Dune Analytics It’s no surprise that asset manager Franklin Templeton recognized Bitcoin Ordinals as a driving force behind the “renaissance” of activity on the Bitcoin network. Similarly, OKX Ventures, the investment arm of crypto exchange OKX, highlighted in its “2024 Bitcoin Outlook” report that Bitcoin Ordinals will play a “pivotal role” this year. However, the significant increase in NFT transactions has periodically congested the Bitcoin network since its inception, resulting in increased fees and slower processing times due to increased on-chain transaction validation. This circumstance may have influenced Binance’s decision on April 4 to discontinue support for Bitcoin Ordinals. As a result, users are no longer allowed to buy, sell or deposit Bitcoin Ordinals on the Binance NFT marketplace. Bitcoin NFTs lead the market Among the 24 blockchain networks minting NFTs, Bitcoin emerged as the leader in April, with sales reaching $594 million. Bitcoin NFT sales reached $594 million in April, topping the charts. Source: CryptoSlam According to CryptoSlam data, the sales volume of Bitcoin-based NFTs reached 602 million in April (only 3% less than in March and 93% more than in February). The data further revealed that the Bitcoin network attracted around 113k buyers and 98k sellers of NFTs during April. The number of NFT transactions on Bitcoin Ordinals reached more than 340k. Sales volume for Bitcoin-based NFTs reached $602 million in April. Source: CryptoSlam Uncategorized Ordinals, NFTs not associated with specific collections, led sales with $316.9 million in volume from 219k transactions. NodeMonkes came in second in sales volume, reaching $32.7 million in April. Runestone ($RUNE) NFT collection gained significant popularity during the month, attracting $798.4k in April (10836% more than in March). $PUPs, another NFT collection on Bitcoin using BRC-20 protocol, reached a trading volume of $72.7 million (up 2087% from last month). Notable NFT launches in April: Ordinal SigmaX (April 2 – April 9) is a digital collectibles project that features 5,555 unique, fully animated pixel-art profile pictures (PFPs). The Rune Guardians (April 12 – April 19) is a collection of 10,000 PFP NFTs built on the Bitcoin blockchain. The project began with an airdrop of “Rune” NFTs to members of over 20 Ordinals communities (Ordinals are a type of NFT on Bitcoin). Rune Mining Pups (April 20 – April 27) is a collection of 10,000 unique 2D pixel art NFTs on the Bitcoin blockchain. The project integrates functionalities associated with DAOs and offers potential benefits to holders. The collection’s theme revolves around characters who discover digital assets. Looking ahead – Can the Bitcoin Halving Charts be Inversed? The April 2024 halving triggered the expected short-term volatility in the Bitcoin market. Despite a price drop of nearly 21%, the network experienced a surge in activity, with record-breaking daily transactions and a significant rise in fees. This activity spike was partly fueled by the launch of the Runes protocol. Looking ahead, several factors will shape Bitcoin’s future trajectory: Institutional investment: The entry of major financial institutions like Morgan Stanley and UBS into the spot Bitcoin ETF market signifies growing mainstream recognition and could drive broader investor interest. However, the DTCC’s decision not to consider Bitcoin as collateral for loan purposes might limit its appeal for some institutional investors. Regulation: Regulatory developments like Norway’s data center registration requirement could impact Bitcoin mining operations. How other countries approach Bitcoin regulations will be crucial in shaping its future adoption. Bitcoin DeFi: The emergence of the Runes protocol has revitalized the Bitcoin DApp ecosystem, showcasing the potential for novel use cases on the network. Continued innovation in this space could drive more activity to Layer 2 solutions. While the post-halving period witnessed a price correction, the Bitcoin market continues to buzz with innovation. The influx of institutional interest, ongoing advancements in mining technology and the burgeoning DeFi space all point toward a dynamic future for Bitcoin. How these factors will interplay and ultimately shape Bitcoin’s trajectory remains to be seen. Looking for a Bitcoin Price Prediction? Bitcoin Price Prediction 2024 – 2034 The post Bitcoin in April: Halving Price Fallout, Network Peaks and ETF Updates appeared first on Cryptonews.","article_summary":"In April 2024, Bitcoin faced its sharpest price drop since the FTX collapse, with halving charts in focus, but network activity soared to record highs, driven by new protocols and ETF developments. This report explores and analyzes Bitcoin's ecosystem and the BTC price developments last month. The post Bitcoin in April: Halving Price Fallout, Network Peaks and ETF Updates appeared first on Cryptonews.","publisher":{"name":"Crypto News","logo":"https://t1.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://cryptonews.com/&size=64"},"creation_date":"2024-05-15T12:11:11Z","categories":["bitcoin","btc","crypto","nft","defi","cryptocurrency","blockchain","token","ai","web3","metaverse","stacks","stx","rune"],"article_link":"https://cryptonews.com/news/bitcoin-in-april-halving-chart-price-fallout-network-peaks-etf-updates.htm","thumbnail_image":"https://cimg.co/wp-content/uploads/2024/05/15120431/1715774671-bitcoin-in-april-halving-price-fallout-network-peaks-and-etf-updates.jpg"},{"article_title":"Bitcoin Hovers at $62K While Pepe Hits Record High as GameStop Extends Rally","author":"Shaurya Malwa","article_detailed_content":"Dog-themed floki (FLOKI) zoomed 12%, the highest among the top 50 tokens by market capitalization, while pepe (PEPE) jumped 5% to a new lifetime peak.","article_summary":"Dog-themed floki (FLOKI) zoomed 12%, the highest among the top 50 tokens by market capitalization, while pepe (PEPE) jumped 5% to a new lifetime peak.","publisher":{"name":"CoinDesk","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.coindesk.com/&size=64"},"creation_date":"2024-05-15T12:10:33Z","categories":["bitcoin","pepe","floki"],"article_link":"https://www.coindesk.com/markets/2024/05/15/bitcoin-hovers-at-62k-while-pepe-hits-record-high-as-gamestop-extends-rally/?utm_medium=referral&utm_source=rss&utm_campaign=headlines","thumbnail_image":"https://www.coindesk.com/resizer/Jbx9h6CSzupGACprURQsKoRRHy8=/800x600/cloudfront-us-east-1.images.arcpublishing.com/coindesk/ZRMLAYJ5NRB7ZBYO5XOKQSSK5A.jpg"},{"article_title":"Bitcoin (BTC) Purchase Signal Sparked by Jerome Powell’s Positive Economic Forecast","author":"Lucien Renard","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Top crypto analyst, Ali Martinez, predicts a bullish future for Bitcoin (BTC) as the TD Sequential indicator signals a potential price rebound. This development is accompanied by Federal Reserve Chair Jerome Powell’s positive remarks on the U.S. economy. Bitcoin is currently […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Top crypto analyst, Ali Martinez, predicts a bullish future for Bitcoin (BTC) as the TD Sequential indicator signals a potential price rebound. This development is accompanied by Federal Reserve Chair Jerome Powell’s positive remarks on the U.S. economy. Bitcoin is currently […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T12:10:11Z","categories":["bitcoin","btc","pepe","crypto"],"article_link":"https://en.coinotag.com/bitcoin-btc-purchase-signal-sparked-by-jerome-powells-positive-economic-forecast/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies34.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"BNB Greenfield Erdos Hardfork","author":"thebittimes@thebitfinance.com (TheBitTimes.Com)","article_detailed_content":"BNB Greenfield Erdos Hardfork, BNB Greenfield seeks to decentralize control over data such that no one entity can control, forcefully remove or seize someone else’s data. The BNB Greenfield network is about to undergo the Erdos hardfork, introducing major updates and enhancements to the platform. Important information and key actions required: The Testnet Serengeti hardfork is scheduled to occur at block height 8,285,529. Based on the current block interval, it is estimated to take place on May 16th at 07:00 AM UTC. The Mainnet Serengeti hardfork is scheduled to occur at block height 7,861,456. Based on the current block interval, it is estimated to take place on May 29th at 07:00 AM UTC. What’s New for Greenfield? To enhance user experience, the developer community is introducing the following Features and bug fixes: Add new cross-chain channel `ExecutorChannel` and corresponding cross-app `ExecutorApp` (PR #595) Implement storage fee paymaster (PR #582) What’s New for Storage Providers (SPs)? New API to query the recommended virtual group family id for creating bucket (PR #1392) For other bug fixes and refactoring, please refer to the changelog in the Greenfield Blockchain and Greenfield SP repository. About BNB Greenfield BNB Greenfield provides decentralized storage infrastructure within the broader BNB Chain ecosystem. The idea is to help users and DApps to create, store, and exchange data with full ownership, and form a new data economy. About BNB Chain Build N Build Chain is the world’s largest smart-contract blockchain in terms of transaction volume and daily active users and hosts Over 1,400 dApps and 2M+ weekly gamers, making it a great ecosystem for game developers to build on. Website | X SOURCE: BNBCHAIN BLOG REQUEST AN ARTICLE Source: https://thebittimes.com/bnb-greenfield-erdos-hardfork-tbt88391.html","article_summary":"BNB Greenfield Erdos Hardfork, BNB Greenfield seeks to decentralize control over data such that no one entity can control, forcefully remove or seize someone else’s data.The BNB Greenfield network is about to undergo the Erdos...","publisher":{"name":"The Bit Times","logo":"https://logo.clearbit.com/thebittimes.com?size=96"},"creation_date":"2024-05-15T12:09:07Z","categories":["bnb","blockchain"],"article_link":"https://thebittimes.com/bnb-greenfield-erdos-hardfork-tbt88391.html","thumbnail_image":"https://cdn.thebittimes.com/vimedia/w800/2024/05/15/a1cd462930844218a6ed4b7a55aa8db1.webp"},{"article_title":"FIU steps up AML and CFT compliance for crypto exchanges in India","author":"Rony Roy","article_detailed_content":"Indian authorities are actively working to bring all cryptocurrency exchanges operating in India under stringent Anti-Money Laundering (AML) and Countering Financing of Terrorism (CFT) guidelines to enhance compliance and oversight in the burgeoning digital asset market. The Indian government’s Financial…","article_summary":"Indian authorities are actively working to bring all cryptocurrency exchanges operating in India under stringent Anti-Money Laundering (AML) and Countering Financing of Terrorism (CFT) guidelines to enhance compliance and oversight in the burgeoning digital asset market. The Indian government’s Financial…","publisher":{"name":"Crypto.news","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://crypto.news/&size=64"},"creation_date":"2024-05-15T12:06:44Z","categories":["crypto","cryptocurrency"],"article_link":"https://crypto.news/fiu-steps-up-aml-and-cft-compliance-for-crypto-exchanges-in-india/","thumbnail_image":"https://crypto.news/app/uploads/2024/01/crypto-news-India-option03.webp"},{"article_title":"ETFSwap (ETFS) Crosses 4,000 Users With $1.5 Million Raised","author":"chainwire","article_detailed_content":"Singapore, Singapore, May 15th, 2024, Chainwire ETFSwap (ETFS), an emerging decentralized cryptocurrency and Exchange-Traded Funds (ETFS) platform, has achieved a series of significant milestones, marking a historic moment in its development and presale. With the support and confidence of thousands of users and investors worldwide, this ground-breaking platform is experiencing a meteoric rise in popularity. In addition, ETFSwap (ETFS) is gaining global recognition as a significant player in the tokenized ETF market. It offers a platform that is both distinctive and accessible, as well as unique and user-friendly, for trading cryptocurrencies and ETFs. ETFSwap (ETFS) Records Unprecedented Surge To Cross 4,000 Users As of November 2023, the global ETFs industry reached a valuation of $10.99 trillion and has been growing rapidly ever since. Given this expansion, an increasing number of cryptocurrency enthusiasts and investors have looked for ways to engage with the potential in this sector. ETFSwap (ETFS) emerges as a bridge between the traditional and Decentralized Finance (DeFi) ecosystem. This platform offers investment opportunities for global investors, exposing them to trillion-dollar sectors such as health, energy, technology, commodities, and more ETFSwap (ETFS) offers crypto investors a novel service that has never been seen in the industry. It allows access to the trillion-dollar traditional ETFs market, allowing them to expand their investment portfolio by tokenizing these assets for easy trading. But perhaps where ETFSwap (ETFS) really outpaces its competitors is that it presents an easy on-and-off ramp for trading ETFs using both crypto and fiat, coupled with the decentralization of the Ethereum blockchain. Over the next year, the platform plans to complete its roadmap with the full launch of the ETFSwap (ETFS) trading platform open for all. Additionally, it’ll launch its partnership program, launch its staking decentralized application (DApp), and roll out community rewards. Its token will launch on decentralized exchanges such as Uniswap, with open public trading to follow. This comes with a full-blown marketing roll-out such as CoinMarketCap fast-track, Key Opinion Leaders (KOLs), and token competitions. The ETFSwap (ETFS) platform has undergone a rigorous audit by CyberScope, a leader in the blockchain security industry. The audit found no vulnerabilities in its contract, with the company declaring it safe for investment. Ahead of its full platform launch, the company is focused on securing all necessary licenses required to bring this novel service to investors worldwide. To sweeten the pot, it requires no KYC (Know Your Customer), which means investors just need to connect their wallet to start trading on the website. ETFSwap (ETFS) is already seeing unparalleled adoption amongst users across diverse regions globally. Currently, the innovative platform has recorded more than 4,000 users in just a few weeks. This surge in adoption is fueled not only by ETFSwap’s (ETFS) advanced trading technology and capabilities but also by the rising interest in tokenized ETFs within the digital asset landscape. Key Milestones and Presale Progress Thanks to ETFSwap users’, ETFSwap (ETFS) has successfully hit key developmental milestones. With the help of institutional investors, ETFSwap (ETFS) successfully raised over $750,000 in its private fundraising round. In addition to the growth of ETFSwap’s user base, the first stage of the ongoing presale has seen over 75 million tokens sold. The ETFSwap team noticed the increase in sales and, with a strategic decision, has raised the ETFS token price from $0.00854 in its first presale stage to $0.01831 during the second stage. The public presale has also collectively raised over $1.5 million in a few weeks. For more information about the ETFS Presale: Users can visit ETFSwap Presale Users can join The ETFSwap Community Contact Jacob Moss ETFSwap LLC info@etfswap.io","article_summary":"Singapore, Singapore, May 15th, 2024, Chainwire ETFSwap (ETFS), an emerging decentralized cryptocurrency and Exchange-Traded Funds (ETFS) platform, has achieved a series of significant milestones, marking a historic moment in its development and presale. With the support and confidence of thousands of users and investors worldwide, this ground-breaking platform is experiencing a meteoric rise in popularity. In addition, ETFSwap (ETFS) is gaining global recognition as a significant player in the tokenized ETF market. It offers a platform that is both distinctive and accessible, as well as unique and user-friendly, for trading cryptocurrencies and ETFs. ETFSwap (ETFS) Records Unprecedented Surge To Cross","publisher":{"name":"Crypto Intelligence News","logo":"https://logo.clearbit.com/cryptointelligence.co.uk?size=96"},"creation_date":"2024-05-15T12:05:39Z","categories":["cryptocurrency","defi","crypto","ethereum","blockchain","token","uniswap"],"article_link":"https://www.cryptointelligence.co.uk/etfswap-etfs-crosses-4000-users-with-1-5-million-raised/","thumbnail_image":""},{"article_title":"Boost Your Crypto Portfolio: Bitcoin Fund Investment & Yield Earnings Now Available in Nordic Countries (BTC)","author":"Merritt Vale","article_detailed_content":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Canadian fintech firm DeFi Technologies has launched the world’s first yield-bearing Bitcoin ETP through its subsidiary, Valour. The ETP offers investors exposure to Bitcoin and a 5.65% yield, provided they are located in the Nordic markets. The product is a result […] Read more at COINOTAG.","article_summary":"Before you reading,Don't miss coins like PEPE again! Click here to find new PEPEs! Canadian fintech firm DeFi Technologies has launched the world’s first yield-bearing Bitcoin ETP through its subsidiary, Valour. The ETP offers investors exposure to Bitcoin and a 5.65% yield, provided they are located in the Nordic markets. The product is a result […] Read more at COINOTAG.","publisher":{"name":"CoinOtag","logo":"https://logo.clearbit.com/en.coinotag.com?size=96"},"creation_date":"2024-05-15T12:05:17Z","categories":["crypto","bitcoin","btc","pepe","defi"],"article_link":"https://en.coinotag.com/boost-your-crypto-portfolio-bitcoin-fund-investment-yield-earnings-now-available-in-nordic-countries-btc/","thumbnail_image":"https://i0.wp.com/en.coinotag.com/wp-content/uploads/2024/05/cryptocurrencies31.webp?resize=150%2C150&quality=70&ssl=1"},{"article_title":"ETFSwap (ETFS) Crosses 4,000 Users With $1.5 Million Raised","author":"Crypto Daily™","article_detailed_content":"Singapore, Singapore, May 15th, 2024, Chainwire ETFSwap (ETFS), an emerging decentralized cryptocurrency and Exchange-Traded Funds (ETFS) platform, has achieved a series of significant milestones, marking a historic moment in its development and presale. With the support and confidence of thousands of users and investors worldwide, this ground-breaking platform is experiencing a meteoric rise in popularity. In addition, ETFSwap (ETFS) is gaining global recognition as a significant player in the tokenized ETF market. It offers a platform that is both distinctive and accessible, as well as unique and user-friendly, for trading cryptocurrencies and ETFs. ETFSwap (ETFS) Records Unprecedented Surge To Cross 4,000 Users As of November 2023, the global ETFs industry reached a valuation of $10.99 trillion and has been growing rapidly ever since. Given this expansion, an increasing number of cryptocurrency enthusiasts and investors have looked for ways to engage with the potential in this sector. ETFSwap (ETFS) emerges as a bridge between the traditional and Decentralized Finance (DeFi) ecosystem. This platform offers investment opportunities for global investors, exposing them to trillion-dollar sectors such as health, energy, technology, commodities, and more ETFSwap (ETFS) offers crypto investors a novel service that has never been seen in the industry. It allows access to the trillion-dollar traditional ETFs market, allowing them to expand their investment portfolio by tokenizing these assets for easy trading. But perhaps where ETFSwap (ETFS) really outpaces its competitors is that it presents an easy on-and-off ramp for trading ETFs using both crypto and fiat, coupled with the decentralization of the Ethereum blockchain. Over the next year, the platform plans to complete its roadmap with the full launch of the ETFSwap (ETFS) trading platform open for all. Additionally, it’ll launch its partnership program, launch its staking decentralized application (DApp), and roll out community rewards. Its token will launch on decentralized exchanges such as Uniswap, with open public trading to follow. This comes with a full-blown marketing roll-out such as CoinMarketCap fast-track, Key Opinion Leaders (KOLs), and token competitions. The ETFSwap (ETFS) platform has undergone a rigorous audit by CyberScope, a leader in the blockchain security industry. The audit found no vulnerabilities in its contract, with the company declaring it safe for investment. Ahead of its full platform launch, the company is focused on securing all necessary licenses required to bring this novel service to investors worldwide. To sweeten the pot, it requires no KYC (Know Your Customer), which means investors just need to connect their wallet to start trading on the website. ETFSwap (ETFS) is already seeing unparalleled adoption amongst users across diverse regions globally. Currently, the innovative platform has recorded more than 4,000 users in just a few weeks. This surge in adoption is fueled not only by ETFSwap’s (ETFS) advanced trading technology and capabilities but also by the rising interest in tokenized ETFs within the digital asset landscape. Key Milestones and Presale Progress Thanks to ETFSwap users’, ETFSwap (ETFS) has successfully hit key developmental milestones. With the help of institutional investors, ETFSwap (ETFS) successfully raised over $750,000 in its private fundraising round. In addition to the growth of ETFSwap's user base, the first stage of the ongoing presale has seen over 75 million tokens sold. The ETFSwap team noticed the increase in sales and, with a strategic decision, has raised the ETFS token price from $0.00854 in its first presale stage to $0.01831 during the second stage. The public presale has also collectively raised over $1.5 million in a few weeks. For more information about the ETFS Presale: Users can visit ETFSwap Presale Users can join The ETFSwap Community ContactJacob MossETFSwap LLCinfo@etfswap.io Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.","article_summary":"ETFSwap (ETFS) Crosses 4,000 Users With $1.5 Million Raised","publisher":{"name":"Crypto Daily","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://cryptodaily.co.uk/&size=64"},"creation_date":"2024-05-15T12:04:57Z","categories":["cryptocurrency","defi","crypto","ethereum","blockchain","token","uniswap"],"article_link":"https://cryptodaily.co.uk/2024/05/etfswap-etfs-crosses-4000-users-with-15-million-raised","thumbnail_image":"https://app.chainwire.org/storage/uploads/users/1200720_1715337247eaMQyiAEUK.jpg"},{"article_title":"European Investors Can Now Enjoy Solana (SOL) Staking Services from Robinhood","author":"Lynn Wang","article_detailed_content":"On May 15, Robinhood, a multi-asset trading platform, announced a series of new features in its crypto services today. Robinhood Crypto has launched several new features aimed at its European customers. Among the most notable updates are the introduction of a crypto-staking product and the rollout of localized app versions. These enhancements are designed to boost accessibility and improve user experience. Robinhood Crypto Rolls Out Localized Apps for European Customers Starting today, Robinhood Crypto will offer its first-ever crypto-staking product exclusively to European customers. The app allows users to stake their Solana (SOL) holdings. They can also earn rewards with the flexibility to unstake at any time. Additionally, new customers can earn a 10% bonus on their net buys over their first 30 days on the platform, paid out in USDC. Johann Kerbrat, VP and GM of Robinhood Crypto, noted that European customers had expressed a need for opportunities to earn passive income. He said that the new features mark a significant advancement. Furthermore, these features will offer a more tailored in-app experience to meet customers’ specific needs. Read more: How to Buy and Sell Crypto on Robinhood: A Step-by-Step Guide “Today’s news is a significant step forward in our mission to […] help them on their financial journey,” Kerbrat stated. In addition to staking, Robinhood Crypto will soon launch localized versions of its app, starting with Italy, Poland, and Lithuania. These versions will offer the full range of services in local languages, giving users more confidence and comfort as they research investments and place trades. In a separate development, Vlad Tenev, Robinhood CEO, announced that the company had hit $5 billion in equities trading volume today. “One of our biggest days in the past 12 months,” Tenev said. Many link Robinhood’s recent achievement to the resurgence in stock market interests, particularly GameStop (GME). Keith Gill, a financial analyst popularly known as The Roaring Kitty, initiated the price surge. Following the news, Robinhood’s stock (HOOD) showed positive performance. HOOD’s price has been up 6.69% today and is trading at $18.02 at the time of writing. Read more: Coinbase vs. Robinhood: Which Is the Best Crypto Platform? HOOD Price Performance. Source: Google Finance Last week, Robinhood also announced an impressive performance in the first quarter of 2024. In its latest quarterly earnings report, Robinhood stated that it had a substantial increase in crypto assets under custody, which stood at $26 billion by the end of March. This represents a 78% rise from the end of 2023. Despite these developments, Robinhood now faces increased scrutiny from the US Securities and Exchange Commission (SEC). BeInCrypto previously reported that the SEC had issued a Wells notice regarding potential violations concerning Robinhood’s crypto practices. The notice issuance could lead to enforcement actions. However, Robinhood’s leadership remains committed to defending the company’s business practices. The post European Investors Can Now Enjoy Solana (SOL) Staking Services from Robinhood appeared first on BeInCrypto.","article_summary":"Robinhood Crypto launches Solana staking in Europe, alongside localized app versions to better serve European customers. The post European Investors Can Now Enjoy Solana (SOL) Staking Services from Robinhood appeared first on BeInCrypto.","publisher":{"name":"Be(In)Crypto","logo":"https://t3.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://beincrypto.com/&size=64"},"creation_date":"2024-05-15T12:03:49Z","categories":["solana","sol","crypto","usdc","link"],"article_link":"https://beincrypto.com/robinhood-crypto-solana-staking-europe/","thumbnail_image":"https://beincrypto.com/wp-content/uploads/2023/10/BIC_robinhood_1-covers_positive.png"},{"article_title":"Bitcoin can still hit $75k in consolidation phase, Galaxy’s Novogratz says","author":"Denis Omelchenko","article_detailed_content":"Galaxy Digital CEO Michael Novogratz thinks the crypto market has stuck in a “consolidation phase,” blocking it from growing higher. Bitcoin is unlikely to experience any bull run in the foreseeable future as the whole crypto market has been stuck…","article_summary":"Galaxy Digital CEO Michael Novogratz thinks the crypto market has stuck in a “consolidation phase,” blocking it from growing higher. Bitcoin is unlikely to experience any bull run in the foreseeable future as the whole crypto market has been stuck…","publisher":{"name":"Crypto.news","logo":"https://t2.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://crypto.news/&size=64"},"creation_date":"2024-05-15T12:02:36Z","categories":["bitcoin","crypto"],"article_link":"https://crypto.news/bitcoin-can-still-hit-75k-in-consolidation-phase-galaxys-novogratz-says/","thumbnail_image":"https://crypto.news/app/uploads/2024/04/crypto-news-bitcoin-option57.webp"},{"article_title":"Breaking News!! Binance launches a Funding Rate Arbitrage Bot and Full Availability of Spot Copy Trading","author":"Florence Muchai","article_detailed_content":"Binance has some news for all crypto traders amid the present bull run. Binance, the leading blockchain ecosystem powering the world’s largest crypto exchange by trading volume, has recently unveiled the Funding Rate Arbitrage Bot and made Spot Copy Trading available to all its eligible users. Binance delivers on community requests for the following products At present, Binance offers over 120,000 active trading strategies on its Trading Bots Marketplace. The platform is constantly improving its range of automated trading tools to cater to the needs of its users. To that end, some of its most sought-after automated trading bots among users are Grid Trading for Spot and Futures, Rebalancing Bot, Auto-Invest, and Dollar-Cost Averaging (DCA). Binance’s Funding Rate Arbitrage Bot is a trading bot that automates a delta-neutral spot and futures arbitrage strategy. Additionally, it eliminates the need for users to manually execute two separate spot and perpetual futures trades. The Arbitrage Bot enables traders to generate funding fees by strategically opening perpetual futures positions and hedging them through opposite positions of equal size in the spot market. We believe in giving users more choices and we constantly review community feedback to understand what users want. Our Funding Rate Arbitrage Bot is a simple and effective tool to automate for users who already manually deploy arbitrage strategies. Its user-friendly interface means more users can try new strategies. We continue to build trading tools for our users and we are pleased that the community’s reception to our Spot Copy Trading launch has been very positive with over 700 Lead Traders registrations so far. Rohit Wad, Chief Technology Officer of Binance What’s more – the Arbitrage Bot has the ability to execute both spot and futures trades automatically, while eliminating the need for users to manually manage two separate trade orders on different trading interfaces. Binance’s Arbitrage Bot strategies are managed independently in users’ trading bots wallet, making it convenient for users to monitor their performance. The Arbitrage Bot allows users two types of strategies – Details Binance’s Funding fees by design plays a crucial role in the crypto markets, ensuring that spot and perpetual futures prices remain in sync. When the funding rate is positive due to a bullish trend, long traders pay the funding fee to short traders. Conversely, when the funding rate is negative due to a bearish trend, short traders end up paying the funding fee to long traders. The Arbitrage Bot allows users to deploy two types of strategies: Positive Carry: The bot purchases assets on the spot market and concurrently sells the corresponding perpetual futures contract, with the goal of enabling the user to earn funding fees from a favorable funding rate. Reverse Carry: The bot strategically sells assets on the spot market while going long on perpetual contracts. The goal is for the user to benefit from collecting funding fees resulting from a negative funding rate. As per Binance’s official announcement, the Arbitrage Bot is currently available on the Binance website. In addition, it be released on Binance App on May 30. Copy Trading is now available to all eligible users Along with the official announcement, Binance reports that the Spot Copy Trading feature will be fully available to all eligible users from May 15 onwards. This follows the successful introduction of the feature to Lead Traders in April. Since signing up for Spot Copy Trading, over 70% of active Lead Traders have generated positive P&L, despite the extremely volatile market and the 11% decline in the overall crypto market capitalization in April.","article_summary":"Binance has some news for all crypto traders amid the present bull run. Binance, the leading blockchain ecosystem powering the world’s largest crypto exchange by trading volume, has recently unveiled the Funding Rate Arbitrage Bot and made Spot Copy Trading available to all its eligible users. Binance delivers on community requests for the following products […]","publisher":{"name":"Cryptopolitan","logo":"https://t0.gstatic.com/faviconV2?client=SOCIAL&type=FAVICON&fallback_opts=TYPE,SIZE,URL&url=https://www.cryptopolitan.com/&size=64"},"creation_date":"2024-05-15T12:01:50Z","categories":["crypto","blockchain"],"article_link":"https://www.cryptopolitan.com/binance-launches-funding-rate-arbitrage-bot/","thumbnail_image":"https://www.cryptopolitan.com/wp-content/uploads/2024/05/Binance.jpg"}]}