{"count":7942,"totalPages":159,"currentPage":1,"posts":[{"post_title":"Changpeng \"CZ\" Zhao Hints at Writing Own Book","post_content":"","post_link":"www.reddit.com/r/CryptoCurrency/comments/1cq7vw8/changpeng_cz_zhao_hints_at_writing_own_book/","author":"MasterpieceLoud4931","up_votes":1,"down_votes":0,"creation_date":"2024-05-12T20:28:32Z","categories":["general-news"],"media_url":null,"website_source":"r/CryptoCurrency"},{"post_title":"Best feature of Bitcoin","post_content":"You're no longer angry about politics screwing up, in fact you're happy you own the credit default swap.","post_link":"www.reddit.com/r/Bitcoin/comments/1cq7ntf/best_feature_of_bitcoin/","author":"LimitAlternative2629","up_votes":2,"down_votes":0,"creation_date":"2024-05-12T20:16:41Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"Best sources for 'studying' Bitcoin?","post_content":"I hear a lot of the time that I should 'study' Bitcoin but most research always points to the surface level common knowledge of Bitcoin that I see on repeat 24/7. I'm wondering if anyone has any sources to some in depth content I can't read up on to reallllllyyyyy deepen my knowledge, The mechanics behind it etc. At the moment I'd still consider myself a novice I only know some of the broader things like the halving, the 21 million supply, etc.","post_link":"www.reddit.com/r/Bitcoin/comments/1cq7lhv/best_sources_for_studying_bitcoin/","author":"JaydenLowe02","up_votes":2,"down_votes":0,"creation_date":"2024-05-12T20:13:32Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"US Scrutiny of Tether Could Disrupt Crypto Ecosystem, Ripple CEO Warns","post_content":"","post_link":"www.reddit.com/r/CryptoCurrency/comments/1cq77ps/us_scrutiny_of_tether_could_disrupt_crypto/","author":"Electrical_Tension","up_votes":2,"down_votes":0,"creation_date":"2024-05-12T19:53:37Z","categories":["general-news"],"media_url":null,"website_source":"r/CryptoCurrency"},{"post_title":"Whats next up for the crypto space technologicly?","post_content":"We have exchanges, wallets, people can buy and sell stuff. Is there any need left that hasn't been taken care of in the crypto space. I can't really think of anything except maybe like a website where u can buy and sell stuff fkr crypto, although there are some alternatives just no mainstream ones yet i guess.\n\nSo i guess does anyone know whats next up for crypto-tech ?","post_link":"www.reddit.com/r/CryptoTechnology/comments/1cq6v98/whats_next_up_for_the_crypto_space_technologicly/","author":"Neat-Data-7125","up_votes":3,"down_votes":0,"creation_date":"2024-05-12T19:34:35Z","categories":["general"],"media_url":null,"website_source":"r/CryptoTechnology"},{"post_title":"Taproot k of n threshold signature","post_content":"I would like to sign a taproot transaction using a threshold scheme. In a 1 of 1 scenario, the private key needs to be \"tweaked\" as well as the public key, but in threshold, each participant owns a share of the secret.\n\nNow my question is, should I treat the shares as individual private keys and tweak each share before generating the partial signature, or should I do something else? Are there any resources on the topic? Any help would be greatly appreciated.\n\nEdit: I don't know if this is the right place for this question. If there is a better place, I would love to know. Thanks","post_link":"www.reddit.com/r/Bitcoin/comments/1cq6ue0/taproot_k_of_n_threshold_signature/","author":"nokia_me","up_votes":8,"down_votes":0,"creation_date":"2024-05-12T19:33:13Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"So Wells Fargo, JP Morgan, and Blackrock all have bitcoin/bitcoin etfs on their balance sheets, and somehow the world isn't freaking out.","post_content":"Bottom Text","post_link":"www.reddit.com/r/Bitcoin/comments/1cq62v5/so_wells_fargo_jp_morgan_and_blackrock_all_have/","author":"eggaholic69","up_votes":46,"down_votes":0,"creation_date":"2024-05-12T18:49:02Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"I’m NOT Selling Bitcoin Until The First $1,000,000 GOD Candle Melts The Faces of Everyone Who Ever…","post_content":"","post_link":"www.reddit.com/r/Bitcoin/comments/1cq5q41/im_not_selling_bitcoin_until_the_first_1000000/","author":"mutinomonem","up_votes":56,"down_votes":0,"creation_date":"2024-05-12T18:26:47Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"✨ 2 years ago today, this legend dropped one of the most iconic Reddit posts about Bitcoin.","post_content":"","post_link":"www.reddit.com/r/CryptoCurrency/comments/1cq5ois/2_years_ago_today_this_legend_dropped_one_of_the/","author":"rizzobitcoin","up_votes":122,"down_votes":0,"creation_date":"2024-05-12T18:23:46Z","categories":["legacy"],"media_url":"https://i.redd.it/hhqhrhrxczzc1.png","website_source":"r/CryptoCurrency"},{"post_title":"✨ 2 years ago today, this legend dropped one of the most iconic Reddit posts about Bitcoin.","post_content":"","post_link":"www.reddit.com/r/CryptoCurrency/comments/1cq5oiq/2_years_ago_today_this_legend_dropped_one_of_the/","author":"rizzobitcoin","up_votes":0,"down_votes":0,"creation_date":"2024-05-12T18:23:45Z","categories":["legacy"],"media_url":"https://i.redd.it/hhqhrhrxczzc1.png","website_source":"r/CryptoCurrency"},{"post_title":"Zenon Network: Game-Theory For Progressive Decentralisation","post_content":"Just in case anyone's looking for something outside the bubble.","post_link":"www.reddit.com/r/CryptoCurrency/comments/1cq5hyj/zenon_network_gametheory_for_progressive/","author":"Virtual_Economist513","up_votes":0,"down_votes":0,"creation_date":"2024-05-12T18:12:03Z","categories":["discussion"],"media_url":null,"website_source":"r/CryptoCurrency"},{"post_title":"I have a Bitcoin and a baby. Now I want a trust","post_content":"Anyone set up a multi sig trust for something like this? I wantnto leave him a whole coin but not even sure what I should be thinking through and what boxes to check. I do have the Bitcoin and the baby. And suggestions on the others from anyone who has done somethingike this. There's a very real possibility that with my lifestyle I drop dead randomly. I trust those closest to me but don't trust their intelligence. How do to safeguard the future for them if you have some bags of coins?","post_link":"www.reddit.com/r/Bitcoin/comments/1cq4rxe/i_have_a_bitcoin_and_a_baby_now_i_want_a_trust/","author":"No_Investigator3369","up_votes":19,"down_votes":0,"creation_date":"2024-05-12T17:23:33Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"4 Reasons to Buy Ethereum Like There's No Tomorrow | The Motley Fool","post_content":"","post_link":"www.reddit.com/r/CryptoCurrency/comments/1cq4hvi/4_reasons_to_buy_ethereum_like_theres_no_tomorrow/","author":"kirtash93","up_votes":0,"down_votes":0,"creation_date":"2024-05-12T17:03:32Z","categories":["general-news"],"media_url":null,"website_source":"r/CryptoCurrency"},{"post_title":"Any P2P sites that does not require KYC or Verification to purchase and transfer BTC?","post_content":"Any P2P sites that does not require KYC or Verification to purchase and transfer BTC?","post_link":"www.reddit.com/r/Bitcoin/comments/1cq446n/any_p2p_sites_that_does_not_require_kyc_or/","author":"PoolOld9187","up_votes":6,"down_votes":0,"creation_date":"2024-05-12T16:36:55Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"An open letter about Bitcoin to Ann Barnhardt","post_content":"I decided to write a letter, then made it an open letter, to Ann Barnhardt. \n\nA lot of you may not have heard of her. She was my Morpheus, and it was well before Bitcoin existed. This is why it's extra painful I ignored Bitcoin for years because if I just looked at it, I probably would have immediately embraced it... and lost it all on Mt Gox! \n\nI thought of her today and hoped she wasn't making the same mistake, as she's a Bitcoiner at Hardt. Badum-diss. Shut up.\n\nHere's the link, and the letter. The post in the website has links with some of the text and pictures, and a link to Ann's video - you won't get all that with the plain text copy I posted here on Reddit.\n\nhttps://armantheparman.com/barnhardt\n\n\n\nAn Open Letter to Ann Barnhardt\n\nHi Ann,\n\nI want to thank you, and I hope this email finds you well.\n\nA long time I ago, I watched your excellent multi-part presentation on YouTube describing the problems with the fiat money system.\n\nI actually first heard the word ‘fiat’ for the first time in my life from that lecture. It was my first touchpoint to the awakening that humanity has been scammed, and a bunch of privileged people create money out of nothing and plunder the assets of the planet with it, and what’s more, they infiltrate/own the governments, media, education system to make us believe it’s good for society that they should control the issuance of money. We have been fooled, captured, hook line and sinker. An Austrian Econ enthusiast was born.\n\nI know some people believe gold is the solution, but really, gold failed – it is BECAUSE of gold’s portability-weakness that we are in this fiat mess. Gold got centralised, particularly after being easily confiscated from US citizens in 1933 (exec order 6102), as I’m sure you know all about. Partially backed, devalued, and then completely unhinged from gold in 1971 (thanks Nixon), we are now on a US dollar paper standard, and it’s being used to enslave humanity.\n\n“I have directed Secretary Connally to suspend, temporarily, the convertibility of the dollar into gold or other reserve assets, except in amounts and conditions determined to be in the interest of monetary stability and in the best interests of the United States.” – Nixon, 1971\nGold can never rise as world money once again, as it can not resist the paper trading that suppresses its price – because no meaningful volume of trade can happen peer-2-peer in the international economy; and so it will always be held by institutions, and they will always contribute to the paper suppression of gold.\n\nTo resist, people need to not just withdraw gold, but not depositing it back to banks when spending. Another way to say this is that no significant volume of gold will be withdrawn from institutions to resist the paper suppression, and if that ever begins to happen, the gold would need to be deposited back into the institutions in order to use it as a medium of exchange (that portability weakness I mentioned earlier ensures this trap plays out). But sure, if we descend into chaos, we can barter with gold, silver, bullets and food; but a thriving civilisation can not be built from that, and if we approach a prospering civilisation, fiat will return to capture us again. Gold only resists fiat if we have fractured local economies, and that’s what we had for 5000 years. Fiat money can even be printed in an ongoing way to suppress gold with little risk (until hyperinflation of course, and then a new fiat currency is thrust upon the people).\n\nBut now we have Bitcoin. Hear me out, please. I wonder if you have looked into it yet because it should certainly be right up your alley, but there’s a high risk you’ll dismiss it at first like most people, as I did too. I have you to thank for me beginning this path of enlightenment, and I want to help you by gently encouraging you to look at Bitcoin with an open mind if you haven’t, and also to help you dismiss any concerns. After 10,000+ hours of study/writing/teaching, I can logically demonstrate that any concern I have ever come across, is refutable. You may converse with me for any clarification; I’ll give you my time. Also, I have a website with 5 years of my writing – https://armantheparman.com\n\nThere are a lot of initial pushback points like\n\n“it’s too volatile“\n“it has no intrinsic value“\n“governments will ban it“\n“it’s bad for the environment“\n“quantum computers will kill it“, and much more\n\nNone of these are worthy arguments, and I have written essays to refute all of them.\n\nYou see, Bitcoin has the necessary technical properties of money, but not the social properties (yet) – the network effect of money. The network of people adopting it for future use as money has been steadily growing for the last 15 years, and it’s done a damn good job of growing so rapidly. It is 1 trillion in market cap, and one should ask themselves why this “Tulip Bubble” has inflated and collapsed, and reinflated 4 TIMES. The reason is that it’s not a bubble – it’s the way price action looks when a new sound money’s value is discovered. There is no other way. You see, Bitcoin is being adopted by a network of people that is only ever increasing – once you see a solution to worldwide tyranny, one never decides to abandon their only chance at resisting: Ether Bitcoin wins, or worldwide coordinated tyranny wins, and we all must choose a side. We are separating money and stat, join us.\n\nThose who are adopting it have learned (and can never unlearn) that Bitcoin is the ONLY contender as worldwide money (the world economy is actually in a state of partial-barter using USD primarily, gold, and recently some other fiat monies).\n\nBitcoin is the only contender because it is the ONLY unstoppable digital worldwide money that has all the minimum properties of money (that you know about from Aristotle, plus more) and of those, it is by far in the lead, and insurmountable. With your finance background, you might know that money trends toward there being one, because the natural force that causes the emergence of money in society from a state of barter, is the same force that causes multiple competing monies (partial barter) to one money.\n\nEven the “intrinsic” value property is actually satisfied, as I can argue that some people can find its cryptographic security and scarcity as a form of art, or beauty or a satisfying collectible – to deny this argument and say “not everyone thinks that way”, is to then be forced to conclude that “art has no intrinsic value because not everyone likes a given work of art” (to remain internally logically consistent).\n\nRegardless, I can demonstrate that money does not actually need an intrinsic value impurity to be money (yes, impurity, money has monetary value with or without non-monetary value, the impurity) – it only needs it when society is emerging from a state of barter; this property then satisfies Mises’ regression theorem. Bitcoin isn’t evolving from a barter-society. We already have money in our respective countries so the regression theorem applied to Bitcoin results in the regression going back to the exchange for it in dollars, or the electricity paid to mine it.\n\nThe reason Bitcoin is a contender (and the only one) for the status of world money is that it is not unilaterally controllable by anyone (or changeable, which contributes to soundness), it’s digital yet strictly scarce in supply (21 million), open source (the code is not secret), it’s possible to settle with finality internationally peer-2-peer in 10 minutes (compare that to gold on a cargo ship, or USD in an armoured truck), it is open source, decentralised so it’s unstoppable and not changeable, and works without any central authority. Yes, it can be copied, but the PEOPLE adopting that version of money can not be copied, and money (a complex idea) is both the token AND the people. Compare this to a language and see that the “value” of a language is determined by how good it is (properties of words, symbols, sounds, grammar, ease to learn etc), AND how many people USE it. The difference between language and money in this regard is that one can learn multiple languages, but one can not store value in two different things (two different tokens). One must choose, and hard money (hard to produce) always beats easy money (easy to produce) given a long enough timeframe.\n\nI’m going to stop here. If you got this far, thank you for reading. I hope to hear from you.\n\nBest wishes,\n\nParman","post_link":"www.reddit.com/r/CryptoCurrency/comments/1cq3mdl/an_open_letter_about_bitcoin_to_ann_barnhardt/","author":"armantheparman","up_votes":0,"down_votes":0,"creation_date":"2024-05-12T16:01:00Z","categories":["advice"],"media_url":null,"website_source":"r/CryptoCurrency"},{"post_title":"Don't fall for Binance referral scam","post_content":"They offer a 0.003 BTC ($200) reward when you refer friends, the trick is they don't tell you how many friends you need to reach that target, and you can't claim any reward you already gained until you reach 0.003. (until you fill the progress bar to 100%)\n\nMy progress bar was 97% I referred another friend who got verified and guess what? The progress bar is now 98.77% maybe I will reach 99.999999% if I refer another 25k friends, right? 🤡\n\nI don't understand how this shady company with bait and switch tactics like this are still operating.","post_link":"www.reddit.com/r/Bitcoin/comments/1cq3hiy/dont_fall_for_binance_referral_scam/","author":"Final-Cream-4037","up_votes":48,"down_votes":0,"creation_date":"2024-05-12T15:51:44Z","categories":["general"],"media_url":"https://i.redd.it/ndxl1oivlyzc1.jpeg","website_source":"r/Bitcoin"},{"post_title":"A website where i can buy and sell stuff with crypto","post_content":"Does this idea exjsts ? If it does I haven't been able to find it. I mean litterally a website where i can do my transactions purely with crypto money out my wallet and even back in my wallet allowing me to sell stuff as well. Imagine anything from buying cars to watches to just random stuff people are trying to sell like those other normal websites. For those who know what the silk road was on the dark web (recently watched a video about it). Is there a version of that which is legal?. Same way of transacting but with legal products?\n\nAnd if it doesn't exist, like me are u guy interested in something like that ?","post_link":"www.reddit.com/r/CryptoTechnology/comments/1cq3dc2/a_website_where_i_can_buy_and_sell_stuff_with/","author":"Neat-Data-7125","up_votes":4,"down_votes":0,"creation_date":"2024-05-12T15:43:27Z","categories":["general"],"media_url":null,"website_source":"r/CryptoTechnology"},{"post_title":"Ted Lasso: The universe told me to buy Bitcoin in 2009","post_content":"The full quote is: “Samuel, you’re overthinking this. Stop looking for the answer and let the answer come to you. If you open yourself to it, the universe will give you a sign. Daddy, with all due respect, isn’t this decision too important to be left to the universe? the universe has always put me on the right path. The universe told me to marry your mother, and to buy bitcoin in 2009.”\n\nI hope the universe also told him to self custody that shid, avoid Mt. Gox, and never trust an ETF or Coinbase, lest you end up like a GameStop investor pre squeeze and synthetic share bullshid. Can you even believe how messed up things are in the USA? Interest expense on national debt as expensive as military spending? Wow. Anyway, thanks Sam’s Dad.","post_link":"www.reddit.com/r/Bitcoin/comments/1cq2dxz/ted_lasso_the_universe_told_me_to_buy_bitcoin_in/","author":"courtrye","up_votes":27,"down_votes":0,"creation_date":"2024-05-12T14:34:32Z","categories":["general"],"media_url":"https://i.redd.it/pbb2t9m38yzc1.jpeg","website_source":"r/Bitcoin"},{"post_title":"Franklin Templeton CEO Makes a Huge Blockchain Prophecy","post_content":"","post_link":"www.reddit.com/r/CryptoCurrency/comments/1cq1lzi/franklin_templeton_ceo_makes_a_huge_blockchain/","author":"kirtash93","up_votes":14,"down_votes":0,"creation_date":"2024-05-12T13:38:45Z","categories":["general-news"],"media_url":null,"website_source":"r/CryptoCurrency"},{"post_title":"Daily Discussion, May 12, 2024","post_content":"Please utilize this sticky thread for all general **Bitcoin** discussions! If you see posts on the front page or /r/Bitcoin/new which are better suited for this daily discussion thread, please help out by directing the OP to this thread instead. Thank you!\n\nIf you don't get an answer to your question, you can try phrasing it differently or commenting again tomorrow.\n\nPlease check the [previous discussion thread](https://www.reddit.com/r/Bitcoin/comments/1cpambd/daily_discussion_may_11_2024/) for unanswered questions.","post_link":"www.reddit.com/r/Bitcoin/comments/1cq1478/daily_discussion_may_12_2024/","author":"rBitcoinMod","up_votes":10,"down_votes":0,"creation_date":"2024-05-12T13:04:43Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"[ADVICE NEEDED] BTC Transaction Stuck","post_content":"I sent a transaction two days ago, paying around 15.10 sat/vByte. I noticed this would cause the transaction to take hours to confirm due to the current network congestion, so I RBFed to 35.10 sat/vByte. Now, my transaction has had an ETA of being confirmed in the next block for well over a day. I'm super lost here; I've sent tons of BTC and never had an issue like this.\n\n[https://btc5.trezor.io/tx/40bc3b1eedd9a31c2a701be25b47af02435706beea112e55e1730c5974446fde](https://btc5.trezor.io/tx/40bc3b1eedd9a31c2a701be25b47af02435706beea112e55e1730c5974446fde)\n\nAm I just being impatient? I've never had anything like this happen before","post_link":"www.reddit.com/r/CryptoCurrency/comments/1cq07um/advice_needed_btc_transaction_stuck/","author":"MLG5006","up_votes":15,"down_votes":0,"creation_date":"2024-05-12T12:05:04Z","categories":["advice"],"media_url":null,"website_source":"r/CryptoCurrency"},{"post_title":"[HELP] Bitcoin Transaction Stuck","post_content":"I sent a transaction two days ago, paying around 15.10 sat/vByte. I noticed this would cause the transaction to take hours to confirm due to the current network congestion, so I RBFed to 35.10 sat/vByte. Now, my transaction has had an ETA of being confirmed in the next block for well over a day. I'm super lost here; I've sent tons of BTC and never had an issue like this.\n\n [https://btc5.trezor.io/tx/40bc3b1eedd9a31c2a701be25b47af02435706beea112e55e1730c5974446fde](https://btc5.trezor.io/tx/40bc3b1eedd9a31c2a701be25b47af02435706beea112e55e1730c5974446fde) \n\nAm I just being impatient? I've never had anything like this happen before","post_link":"www.reddit.com/r/Bitcoin/comments/1cq04da/help_bitcoin_transaction_stuck/","author":"MLG5006","up_votes":6,"down_votes":0,"creation_date":"2024-05-12T11:59:20Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"Game Theory","post_content":"Sorry to sounded like a complete noob to all the OG Bitcoiners. I have recently started my journey into the world of studying &amp; owning Bitcoin! My questions is, what is game theory &amp; how does it apply to holding / purchasing Bitcoin? Thank you for your time please don’t destroy me in the comments.","post_link":"www.reddit.com/r/Bitcoin/comments/1cpzwtf/game_theory/","author":"BenderMcBender","up_votes":2,"down_votes":0,"creation_date":"2024-05-12T11:45:50Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"Thoughts on this?","post_content":"https://youtube.com/shorts/30-cEsKpkeY?si=uQ1AOmuZuuaAaH0P","post_link":"www.reddit.com/r/Bitcoin/comments/1cpzuxx/thoughts_on_this/","author":"Dub_City204","up_votes":0,"down_votes":0,"creation_date":"2024-05-12T11:42:30Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"Day to day","post_content":"I’m a holder too, but in the day to day I still need to eat and all that… how do you use your BTC for living?","post_link":"www.reddit.com/r/Bitcoin/comments/1cpznsm/day_to_day/","author":"Emanuelsil","up_votes":0,"down_votes":0,"creation_date":"2024-05-12T11:30:10Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"Getting paid in SATS at work","post_content":"Assuming you are valuable to a company and make them good money… rather than asking for a high FIAT salary based on performance to have a higher standard of living, or to keep up with inflation….\n\nWhat if, you ask for 10,000,000 SATS per month fixed. \nAssuming your skills and experience rise each year….\n\nYou will never have to ask a raise, because the value of btc will rise. \n\nGetting paid in SATS at a fixed rate makes them negotiate to keep you, rather than you negotiating( assuming you are actually valuable and not there just to clock in )\n\nThe norm right now is asking for a raise to keep up with inflation. (Not a real raise)\n\nIf your skills keeps up with the rate of Bitcoin, you will never ever ever need to ask for a raise. \n\nCurrently, if your skills and expertise increase by 20%, and inflation is 10% your boss gives a 15% raise, there’s an extra 5% skill gained that is not accounted for in your raise. \n\nGetting paid in fixed SATS makes the company ask you “hey can we lower your salary by 1,000,000 SATS ” due to a FIAT 2x in price \n\nIt will force the company to notice your worth every 4 years. \n\nOf course if you suck and do nothing you’ll get fired. \n\nWhat are y’all’s thoughts??? Crazy or not???","post_link":"www.reddit.com/r/Bitcoin/comments/1cpzc5d/getting_paid_in_sats_at_work/","author":"All_I_Talk_Is_Tech","up_votes":1,"down_votes":0,"creation_date":"2024-05-12T11:10:05Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"Mining.","post_content":"Could someone please explain what exactly is Bitcoin mining?? How does it work??? Thanks in advance for some kind explanation! Thanks","post_link":"www.reddit.com/r/Bitcoin/comments/1cpyqqc/mining/","author":"Joey1422","up_votes":0,"down_votes":0,"creation_date":"2024-05-12T10:34:44Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"Fastest Way to buy and send bitcoin?","post_content":"I know there is Cash App and Vendo, but I need to send larger limits as Cash App has limit. Anyone know of a fast way to buy and send bitcoin like within minutes?","post_link":"www.reddit.com/r/Bitcoin/comments/1cpyq2h/fastest_way_to_buy_and_send_bitcoin/","author":"mindset1984","up_votes":5,"down_votes":0,"creation_date":"2024-05-12T10:33:37Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"Get your money out of the banks!!","post_content":"","post_link":"www.reddit.com/r/Bitcoin/comments/1cpxw5k/get_your_money_out_of_the_banks/","author":"BuzzardLightning","up_votes":19,"down_votes":0,"creation_date":"2024-05-12T09:46:05Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"How do you store your seed physically? I worked on a human friendly encryption and decryption algorithm... feedback?","post_content":"I've been thinking about this for a while, a human friendly encryption technique using a simple cipher on an alphabet. This way, instead of storing your seed phrase on a sheet or metal or paper and hiding it, putting it in a safe, or locking it in a bank vault and worrying about it being stolen, you can instead not concern yourself with it but creating a cipher.\n\nThis is simple and definitely crackable with time.\n\nAlthough, you literally lessen your chances of being hacked by anyone non-developer and according to Google on 0.3% of the world population can code. So Let's assume 10% of the people in crypto can, this literally lessens your chances of being hacked through stealing your physical seed by 90%+.\n\nAll it does is take a password, counts the delta between the password letter and word letter from the seed phrase to the right, then subtracts that from the password letter to the left, and now you have the encrypted letter.\n\nWhat's your feed back on this, anything to change?\n\nThe most important thing is that this needs to be human friendly like avoiding hashes and other complex to memorize for humans type of encryption techniques.\n\nI have also thought of using some sort of math problem instead of shifting like simply remembering your favorite math equation, affine maybe, etc. and applying that to each letter with a password, instead of shifting.\n\nThis is only the first iteration. Took me about an hour or less here. Will probably work on something better\n\n    from typing import List\n    \n    alphabet = [\"a\", \"b\", \"c\", \"d\", \"e\", \"f\", \"g\", \"h\", \"i\", \"j\", \"k\", \"l\", \"m\", \n                \"n\", \"o\", \"p\", \"q\", \"r\", \"s\", \"t\", \"u\", \"v\", \"w\", \"x\", \"y\", \"z\"]\n        \n    def encrypt(phrase: List, password: str) -&gt; List:\n        abc_len = len(alphabet)\n        b_len = len(password)\n        a = 0\n        encrypted_phrase = []\n        for word in phrase:\n            encrypted_word = \"\"\n            for letter_count, letter in enumerate(word):\n                a += 1\n                b_letter = password[(a % b_len) - 1]\n                a_index = alphabet.index(letter)\n                b_index = alphabet.index(b_letter)\n                shift_right = (abc_len - b_index + a_index) % abc_len\n                shift_left = (b_index - shift_right) % abc_len\n                encrypted_letter = alphabet[shift_left]\n                encrypted_word += encrypted_letter\n                if letter_count + 1 &gt;= len(word):\n                    encrypted_phrase.append(encrypted_word)\n                    encrypted_word = \"\"\n        return encrypted_phrase\n    \n    def decrypt(phrase: List, password: str) -&gt; List:\n        abc_len = len(alphabet)\n        b_len = len(password)\n        a = 0\n        decrypted_phrase = []\n        for word in phrase:\n            decrypted_word = \"\"\n            for letter_count, letter in enumerate(word):\n                a += 1\n                b_letter = password[(a % b_len) - 1]\n                a_index = alphabet.index(letter)\n                b_index = alphabet.index(b_letter)\n                shift_right_1 = ((abc_len + b_index - a_index) % abc_len)\n                shift_right_2 = ((b_index + shift_right_1) % abc_len)\n                encrypted_letter = alphabet[shift_right_2]\n                decrypted_word += encrypted_letter\n                if letter_count + 1 &gt;= len(word):\n                    decrypted_phrase.append(decrypted_word)\n                    decrypted_word = \"\"\n        return decrypted_phrase\n    \n    encrypted_phrase = encrypt(\n        [\"water\", \"freedom\", \"capsul\", \"candy\", \"soda\", \"lemon\",\n         \"vitamin\", \"pepper\", \"capsul\", \"candy\", \"soda\", \"lemon\"], \n        \"ilovemydog\"\n    )\n    print(encrypted_phrase)\n    \n    decrypted_phrase = decrypt(\n        encrypted_phrase, \n        \"ilovemydog\"\n    )\n    print(decrypted_phrase)\n\nSo instead of writing down your seed phrase as:\n\n    \"water\", \"freedom\", \"capsul\", \"candy\", \"soda\", \"lemon\", \"vitamin\", \"pepper\", \"capsul\", \"candy\", \"soda\", \"lemon\"\n\nYou can openly store is physically with:\n\n    'uwjmr', 'tfcyjck', 'aqtgcv', 'amdte', 'yuvw', 'vyacj', 'hipykyp', 'xmhnmr', 'wwrksf', 'ucdfa', 'eszm', 'fsqcv'\n\nNow, you can store this in a bank vault without worrying about the employees stealing it ;)\n\nAnd not only can you just remember a password (as well as ensuring you have access to this encrypted copy), as long as you have the copy of the encrypted phrase, this cipher is simple enough to do in your head.","post_link":"www.reddit.com/r/ethereum/comments/1cpxw2c/how_do_you_store_your_seed_physically_i_worked_on/","author":"advias","up_votes":1,"down_votes":0,"creation_date":"2024-05-12T09:45:56Z","categories":["general"],"media_url":null,"website_source":"r/ethereum"},{"post_title":"Any recommendations for a node","post_content":"Specially a node that has apps and has an electric personal server ? Like umbrel or citadel? Are their others?  To difficult for me to figure out how to get an electrum server on my own.  Thank you","post_link":"www.reddit.com/r/Bitcoin/comments/1cpxqsk/any_recommendations_for_a_node/","author":"Unlucky-Citron-2053","up_votes":9,"down_votes":0,"creation_date":"2024-05-12T09:37:23Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"Can Ethereum Maintain Momentum? Key Levels To Watch","post_content":"","post_link":"www.reddit.com/r/CryptoCurrency/comments/1cpx54p/can_ethereum_maintain_momentum_key_levels_to_watch/","author":"MasterpieceLoud4931","up_votes":0,"down_votes":0,"creation_date":"2024-05-12T09:03:55Z","categories":["🟢 markets"],"media_url":null,"website_source":"r/CryptoCurrency"},{"post_title":"Trouble claiming Eigenlayer","post_content":"Trouble claiming Eigenlayer\n\nAs title, is anyone having issues claiming the Eigenlayer airdrop?\n\nI could check my allocation a couple days ago, and now when I go to claim I get errors whether it be through my metamask on my phone or through safari/chrome on my phone.\n\nMetamask error: access denied. Your access request has been blocked by our automated security systems.\n\nSafari/chrome: application error: a client-side exception has occurred (see browser console for more information).\n\nI’m in Australia btw so it’s not a geofencing thing. \n\nIs it a phone problem? Does anyone know how to get past this?","post_link":"www.reddit.com/r/ethereum/comments/1cpwr84/trouble_claiming_eigenlayer/","author":"Open_Platypus1573","up_votes":5,"down_votes":0,"creation_date":"2024-05-12T08:42:31Z","categories":["general"],"media_url":null,"website_source":"r/ethereum"},{"post_title":"Daily Crypto Discussion - May 12, 2024 (GMT+0)","post_content":"**Welcome to the Daily Crypto Discussion thread. Please read the disclaimer and rules before participating.**\n \n***\n&amp;nbsp;\n    \n###Disclaimer:\n\nConsider all information posted here with several liberal heaps of salt, and always cross check any information you may read on this thread with known sources. Any trade information posted in this open thread may be highly misleading, and could be an attempt to manipulate new readers by known \"pump and dump (PnD) groups\" for their own profit. BEWARE of such practices and exercise utmost caution before acting on any trade tip mentioned here. \n\n\n**Please be careful about what information you share and the actions you take.** Do not share the amounts of your portfolios (why not just share percentage?). Do not share your private keys or wallet seed. Use strong, non-SMS 2FA if possible. Beware of scammers and be smart. Do not invest more than you can afford to lose, and do not fall for pyramid schemes, promises of unrealistic returns (get-rich-quick schemes), and other common scams.\n    \n***\n&amp;nbsp;\n    \n###Rules:\n\n  - All [sub rules](https://www.reddit.com/r/CryptoCurrency/about/rules/) apply in this thread. The prior exemption for karma and age requirements is no longer in effect. \n  - Discussion topics must be related to cryptocurrency.\n  - Behave with civility and politeness. Do not use offensive, racist or homophobic language.\n  - Comments will be sorted by newest first.\n  \n***\n&amp;nbsp;\n\n###Useful Links:\n\n  - [**Beginner Resources**](https://www.reddit.com/r/CryptoCurrency/wiki/beginner_resources)\n\n  - [**Intro to r/Cryptocurrency MOONs 🌔**](https://www.reddit.com/r/CryptoCurrency/comments/gj96lb/introducing_rcryptocurrency_moons/)\n\n  - [**MOONs Wiki Page**](https://www.reddit.com/r/CryptoCurrency/wiki/moons_wiki/)\n\n  - [**r/CryptoCurrency Discord**](https://www.reddit.com/r/CryptoCurrency/comments/kth255/join_the_crypto_currency_discord/)\n\n  - [**r/CryptoCurrencyMemes**](https://www.reddit.com/r/cryptocurrencymemes)\n\n  - [**Prior Daily Discussions**](https://www.reddit.com/r/CryptoCurrency/search?q=title%3A%22Daily+Crypto+Discussion+-+%22+&amp;restrict_sr=on&amp;sort=new&amp;t=all) - (Link fixed.)\n\n  - [**r/CryptoCurrencyMeta**](https://www.reddit.com/r/CryptoCurrencyMeta/) - Join in on all meta discussions regarding r/CryptoCurrency whether it be moon distributions or governance.\n\n***\n&amp;nbsp;\n\n### Finding Other Discussion Threads\n\nFollow a mod account below to be notified in your home feed when the latest r/CC discussion thread of your interest is posted.\n\n* u/CryptoDaily- — Posts the Daily Crypto Discussion threads. \n\n* u/CryptoSkeptics — Posts the Monthly Skeptics Discussion threads.\n \n* u/CryptoOptimists- — Posts the Monthly Optimists Discussion threads.\n\n* u/CryptoNewsUpdates — Posts the Monthly News Summary threads.","post_link":"www.reddit.com/r/CryptoCurrency/comments/1cpuu0f/daily_crypto_discussion_may_12_2024_gmt0/","author":"CryptoDaily-","up_votes":16,"down_votes":0,"creation_date":"2024-05-12T07:00:41Z","categories":["official"],"media_url":null,"website_source":"r/CryptoCurrency"},{"post_title":"Harari on BTC.  Thoughts?","post_content":"Im genuinely interested in seeing if we're able to nicely agree to disagree.  But also... skeptical.","post_link":"www.reddit.com/r/Bitcoin/comments/1cptqcv/harari_on_btc_thoughts/","author":"ze_monster","up_votes":2,"down_votes":0,"creation_date":"2024-05-12T06:06:02Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"Blockchain Transactions and the Power of Parallel Execution","post_content":"","post_link":"www.reddit.com/r/CryptoCurrency/comments/1cptq24/blockchain_transactions_and_the_power_of_parallel/","author":"ACSportsbooks","up_votes":0,"down_votes":0,"creation_date":"2024-05-12T06:05:37Z","categories":["scalability"],"media_url":null,"website_source":"r/CryptoCurrency"},{"post_title":"Speculating…","post_content":"Okay hello.  Here we are again.  **Obligatory this feels like 2021 cycle again disclaimer**\n\nSo, with more people getting involved again, I’m seeing a lot of those posts pop up here to the point I wouldn’t be surprised if this post gets flagged.  \n\nHere are two interesting tools I’ve found you can play with if you want to speculate about price: \n1) [Wen Moon?](https://observablehq.com/@jimbojw/wen-moon) Bitcoin calculator. \n2) [Bitcoin Fair Price](https://bitcoinfairprice.com)\n\nWhat do you think about these tools?  I realize this is just another way to speculate.  They provide their sourcing and formulas so you can DYOR.","post_link":"www.reddit.com/r/Bitcoin/comments/1cpsp34/speculating/","author":"HealthyCraic","up_votes":0,"down_votes":0,"creation_date":"2024-05-12T05:16:32Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"Look what I found today","post_content":"~50Gh/s I believe","post_link":"www.reddit.com/r/Bitcoin/comments/1cps2gx/look_what_i_found_today/","author":"BenedictiRegula","up_votes":10,"down_votes":0,"creation_date":"2024-05-12T04:46:34Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"People still don't understand how Bitcoin works: \"What if a huge solar storm takes out all the Bitcoin servers?\"","post_content":"","post_link":"www.reddit.com/r/Bitcoin/comments/1cpruxy/people_still_dont_understand_how_bitcoin_works/","author":"bitsteiner","up_votes":392,"down_votes":0,"creation_date":"2024-05-12T04:36:38Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"non usa resident incorporate company in Wyoming state for buying selling holding stalking bitcoin please share experience  what is the pros cons ? what is there tax benefits i read there is no income tax for buying selling or holiding no capital gain tax .","post_content":"","post_link":"www.reddit.com/r/Bitcoin/comments/1cprf80/non_usa_resident_incorporate_company_in_wyoming/","author":"bsun-321","up_votes":0,"down_votes":0,"creation_date":"2024-05-12T04:15:44Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"Thoughts on solcex?","post_content":"It’s a new CEX token launched that’s the first centralized exchange on Solana. Is this token legit or a scam? Anyone have any solid information showing this is legit? Just trying to make sure this isn’t a rug pull.\n\nThe website and documents seem legit but the video seems a little sketchy along with some people on Reddit mentioning it might be a scam. There is an 8mil dollar market cap and the top holder only owns 10%, what are your guys thoughts? Is it too risky to make an investment? They have about 20m followers on twitter and says its been active since 2022, the only thing that seems like a red flag is I can’t find any information on the founder or ceo. If anyone knows where to find info on the team or ceo it would much be appreciated. It sounds like a good investment being on the Solana blockchain but I still have my doubts. Thanks guys.","post_link":"www.reddit.com/r/CryptoCurrency/comments/1cprd96/thoughts_on_solcex/","author":"OopsV","up_votes":0,"down_votes":0,"creation_date":"2024-05-12T04:13:14Z","categories":["advice"],"media_url":null,"website_source":"r/CryptoCurrency"},{"post_title":"Still early.","post_content":"","post_link":"www.reddit.com/r/Bitcoin/comments/1cpqku9/still_early/","author":"Moist-Income-1521","up_votes":90,"down_votes":0,"creation_date":"2024-05-12T03:35:28Z","categories":["general"],"media_url":"https://i.redd.it/cbiyhrliyuzc1.jpeg","website_source":"r/Bitcoin"},{"post_title":"Btc Screener","post_content":"Is there any website like Dexscreener where I can watch the live data of buy/sale transaction on BTC?","post_link":"www.reddit.com/r/Bitcoin/comments/1cpqc6h/btc_screener/","author":"Lazy_Cabinet381","up_votes":0,"down_votes":0,"creation_date":"2024-05-12T03:24:17Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"Blockstream Jade Vs Trezor safe 3","post_content":"Just bought a Trezor safe 3. But as I’ve been doing more and more research, it seems that blockstream Jade would be a better bet. \n\nAm I going to be set with Trezor safe 3? Or is blockstream Jade a massive enough improvement that I should send back the Trezor Safe 3 and go with Blockstream Jade? And if so, why specifically? (Help me learn!) \n\nI know there are so many posts in here about people generically asking ‘which cold storage’ so I appreciate you putting up with me. Tried to do my own research, but I just don’t understand the minor differences enough to know how serious it is. \n\nCheers!","post_link":"www.reddit.com/r/Bitcoin/comments/1cpq4ai/blockstream_jade_vs_trezor_safe_3/","author":"IndependenceNew8080","up_votes":0,"down_votes":0,"creation_date":"2024-05-12T03:13:54Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"From a investment stand point...thoughts?","post_content":"I invest $500/mo in S&amp;P500 and $500/mo in Bitcoin. Given Bitcoins yearly gains I believe in 20 years Bitcoin investment \\*should\\* yield more profit. What do you think?","post_link":"www.reddit.com/r/Bitcoin/comments/1cpp8jr/from_a_investment_stand_pointthoughts/","author":"s4orce","up_votes":54,"down_votes":0,"creation_date":"2024-05-12T02:32:42Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"call to hodlers: voluntary bitcoin staking for market signalling (using timelock)","post_content":"I think would be interesting if we start doing this. you transfer some btc to yourself with a timelock. then we can scan the database to see how many btc are staked and for how long.  \nnot sure if there is an online dashboard showing this already\n\nanyway I always wanted to tell the world that I am pretty confident and I would stake my btc for quite some time in a way that is verifiable. and hopefully giving more confidence to the market\n\nwhat do you think?","post_link":"www.reddit.com/r/Bitcoin/comments/1cpp3ra/call_to_hodlers_voluntary_bitcoin_staking_for/","author":"zxcjkltzxc","up_votes":4,"down_votes":0,"creation_date":"2024-05-12T02:26:30Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"Kraken Asks Court To Dismiss SEC Claims Alleging the Crypto Exchange Operated As Unregistered Securities Broker - The Daily Hodl","post_content":"","post_link":"www.reddit.com/r/CryptoCurrency/comments/1cpoeib/kraken_asks_court_to_dismiss_sec_claims_alleging/","author":"kirtash93","up_votes":60,"down_votes":0,"creation_date":"2024-05-12T01:53:44Z","categories":["general-news"],"media_url":null,"website_source":"r/CryptoCurrency"},{"post_title":"Getting in &amp; making your first purchase is more important than figuring out cold storage first","post_content":"I've seen posts &amp; comments by people that are intimidated &amp; struggling with the perceived complexity of hardware wallets &amp; cold storage. \n\nThis sub puts a really strong emphasis on those things, and I do understand why, but I've seen it with my own eyes people that have been trying to figure out the process for weeks or more &amp; haven't made their first purchase yet. Yes, it's a good idea once your stack gets significant enough to warrant the extra security, but it's not necessary to apply that level of security for a few hundred dollars worth of bitcoin. It's much more important that you get started with purchasing. You can &amp; should take the steps to learn about cold storage at a later time, but the self custody hot wallet apps for your phone are perfectly sufficient to get started.","post_link":"www.reddit.com/r/Bitcoin/comments/1cpoac1/getting_in_making_your_first_purchase_is_more/","author":"dvsbyknight","up_votes":39,"down_votes":0,"creation_date":"2024-05-12T01:48:25Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"Muun alternative","post_content":"Hi,\n\nFrom on of my previous post and after some research, I chose to use Kraken and muun for my DCA with minimum fees.\n\nKraken to muun lightning and muun to cold wallet on chain.\n\nBut here is my problem:\nI tried transfering funds from moon to my cold wallet with 9sat/vB and after 2weeks it's still not confirmed. So I think I will wait for the transaction to be dropped or failed so I can send it again with a good amount of fees.\n\nSo now I'm searching of a muun alternative with the same system of instant lightning/on chain swap but with RBF so I can resend a transaction of I still make this type of mistake. \n\nThanks for your help !","post_link":"www.reddit.com/r/Bitcoin/comments/1cpnxi1/muun_alternative/","author":"Orkusse","up_votes":1,"down_votes":0,"creation_date":"2024-05-12T01:31:29Z","categories":["general"],"media_url":null,"website_source":"r/Bitcoin"},{"post_title":"Ethereum Faucet - allcoins.pw","post_content":"Hey,\nAnyone has used this website called as allcoins.pw ?\n\nIt says to solve simple CAPTCHA and rewards some 0.00000008 ETH, has anyone withdrawn eth to your wallet ?\n\nIs it legit?","post_link":"www.reddit.com/r/ethereum/comments/1cpnvz1/ethereum_faucet_allcoinspw/","author":"Technical_Comment_80","up_votes":0,"down_votes":0,"creation_date":"2024-05-12T01:29:38Z","categories":["general"],"media_url":null,"website_source":"r/ethereum"}]}